[
{"title": "Mivi Collar Wireless Bluetooth 5.0 Neckband Earphones with Mic. Bluetooth Headset Wireless with Stereo Sound, Booming Bass, Long Battery Life, Voice Assistant and IPX4 Sweat Proof", "asin": ["B081XP71GD"], "rating": "4.0 out of 5 stars", "price": "₹ 1,499.00", "description": ["Immersive Sound: With powerful bass and a treble with balanced highs and lows, immerse yourself in the true-to-life HD sound that intensifies your music experience with these neck band bluetooth earphones", "Long Battery Life: The Collar wireless neckband earphones are packed with a 10-hour play time (at 70 percent of total volume) to encourage non-stop music", "Seamless Connectivity: The latest Bluetooth 5.0 has been engineered into the Collar neckband Bluetooth headphones so you can enjoy uninterrupted connections up to a 30 feet range and answer calls with lossless audio transmission", "Call Clarity: We pioneered a powerful built-in-mic in this bluetooth headset to ensure crystal clear quality of your phone calls", "Sweat-proof. Splash Resistant: The sweat-proof and splash resistant IPX4 rating of the Collar bluetooth earphones promises worry-free use at the gym", "Lightweight Design: Solid comfort around your neck as you listen to your jams on a feather-light earphone. Take calls, adjust volume, manage music and activate Google/Siri voice assistant on the Collar Bluetooth wireless earphones, hands-free"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61gmUIuS01L._SL1500_.jpg"]},
{"title": "TIZUM Earphone Carrying Case - Multi Purpose Pocket Storage Travel Organizer for Earphone, Pen Drives, Memory Card, Cable (Camouflage Orange)", "asin": ["B01NCZHE1D"], "rating": "4.3 out of 5 stars", "price": "₹ 279.00", "description": ["TRIPLE SHOCK PROTECTION - The Ultimate Protection with three layers AntiShock EVA HardShell + Extremely soft velveteen lining protects your headphones against all impacts. Ideal for Travelling, best travel Organizer for your headphones.", "SUPERIOR QUALITY - Your Headphones fit like a glove and will be perfectly protected against typical banging that comes with transporting, High quality material, long lasting rubber zipper, perfect fit.", "HOOK IT UP - Easily with Bags, Belts, Loops. This Carabiner hook is extremely useful for day to day use.", "COMFORTABLE CARRY - It can put a lot of little things, for easily carry to travel headphones bag, card bag, multi-function of the small box.", "PREMIUM EDITION – This is a PREMIUM Edition product comes in 3 Variants of Designer Camouflage Pattern. Product dimension: 10.6 x 10.4 X 4 (L x w x h in cms)"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71DqSuQ4XxL._SL1500_.jpg"]},
{"title": "MARKBIZ Wireless Neckband Bluetooth Earphone Headset Earbud Portable Headphone Handsfree Sports Running Sweatproof Compatible Android Smartphone (Black)", "asin": ["B08BX4NHRJ"], "rating": "4.0 out of 5 stars", "price": "₹ 399.00", "description": ["☑️ Bluetooth 5. 0 technology, with significant noise isolation and 10mm dynamic drivers, ensure stable transmission & 0 interruption for a HD stereo sound experience.", "☑️IPX7 Sweat and Waterproof: Fully waterproof build delivers serious defense against rain, sweat, and more; listen to music.", "☑️Design Allows For Ultimate Wearing Comfort For Running, Jogging, Cycling, Driving, Camping,Hiking,Gym Exercise And Other Outdoor Sports", "☑️The Headset Has Anin-Line Mic And Volume Control Buttons, Perfect For Answering Calls Or Listening Music.", "☑️Cool Magnetic Attraction: The magnet can attach the ends together, creating a fashionable sport lifestyle."], "image_urls": [null]},
{"title": "Zebronics Zeb-Symphony Bluetooth Earphone with Voice Assistant", "asin": ["B07TB9KGPR"], "rating": "3.2 out of 5 stars", "price": "₹ 729.00", "description": ["Flexible Neckband: Listening to music should be a comfortable experience hence Zeb-Symphony comes in a comfortable lightweight design in a neckband style providing ample support with a super flexible structure.", "Water resistants: Light rains, drizzle or a heavy workout; get through all of it with a water resistant design of the wireless neckband.", "13hrs* Playback Time: Converse or listen to non-stop music with 13* hours of pure playback time", "Supports Dual Pairing: Pair your wireless earphone with two devices and get connected instantly without waiting.", "Magnetic Earpieces: Say bye to tangled wires with a magnetic earpiece to get you started on hassle free music experience.", "Superior Sound Quality: Hear sound like never before on Zeb-Symphony wireless earphones that come with superior sound quality. prviding you all the details that you need", "Supports Voice assistants: Ask away all your queries and get instant replies from voice assistant for Android/iOS devices.", "Call function: Enjoy a true hands-free experience when you take calls at the a press of a button.", "For feedback & Support, Call us on: 9360942527 or Write to us on: support@zebronics.com"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/717aeqCigsL._SL1500_.jpg"]},
{"title": "Redmi Earbuds S, Punchier Sound,Up to 12 Hours of Playback time, IPX4 Sweat & Splash Proof& DSP Environmental Noise Cancellation", "asin": ["B0892QBCW5"], "rating": "3.5 out of 5 stars", "price": "₹ 1,799.00", "description": ["Pairing Procedure: Remove both earbuds from the charging case simultaneously, and wait for 2–3 seconds for the earbuds to automatically connect with each other. Make sure the Bluetooth is enabled on your device. When the indicator of the left or right earbud slowly blinks white, search for \"Redmi Earbuds S\" on your device", "Compatibility: Although we love Xiaomi, this device is compatible with all brands and products", "Sleek & compact design: Extremely sleek & stylish design that you can carry around seamlessly in your pockets and bags", "4.1g ultralight weight earbuds:  Super lightweight earbuds that are just 4.1 grams, it feels very comfortable to wear for long hours, you forget that you’re wearing one after some time", "Battery Life: Long lasting battery life of up to 4 hours with a single charge and total of 12 hours with the charging case to give you the best music experience", "Impeccable bass & sound quality: Equipped with 7.2mm dynamic drivers which are tuned for India to give you the punchier sound & better bass experience", "IPX4 sweat & splash proof: You can work out in the gym or go on a jog without getting worried about any damage to the earphones that has been built with IPX4 sweat & splash proof", "Seamless pairing: The pairing process is super easy. You can use both or only single earbud at a time as per your convenience", "Low latency mode for gaming: The low latency mode reduces the latency to 122ms to deliver best performance during your gaming adventures", "Stable connectivity with Bluetooth 5.0: Best in class Bluetooth 5.0 that enables strong wireless connection of up to 10m without any interruption", "Multi-functional button: Easy button controls for various functions you need - Play/pause music, activate a voice assistant, answer /disconnect call, switch between the calls, Mute the call etc", "Works with Voice Assistant: Trigger your voice assistants Alexa & Google Assistant by just double clicking the multi-function button & get your work done without reaching out for your phone", "DSP Environmental noise cancellation : Enabled with DSP Environmental noise cancellation that Suppresses the ambient noise during the voice calls", "Customer care number: Call 18001036286 or Reach Out to Nearest Authorized Service Center of Xiaomi for any after sales support"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61k1jK9XwVL._SL1500_.jpg"]},
{"title": "Realme Buds Wireless", "asin": ["B07XJWTYM2"], "rating": "4.2 out of 5 stars", "price": "₹ 1,789.00", "description": ["10 minutes of charging gives you 100 minutes of music time. Large 110mAh battery charges completely in 1.5 hours, giving a playback time of up to 12 hours", "11.2 mm sound driver capable of producing great bass", "Built-in magnets: Enjoy magnetic earbuds with auto on and off feature for seamless audio connection", "Three button remote: Control your music, handle phone calls and even summon Google Assistant with three tactile inline buttons", "A premiun neckband design along with a tangle free memory metal string ensures a great experience", "6 months warranty", "Customer Care :18001022777"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61e9td4-rjL._SL1500_.jpg"]},
{"title": "iBall EarWear Base BT 5.0 Neckband Earphone with Mic and 12 Hours Battery Life (Black)", "asin": ["B07WZG6VY7"], "rating": "3.3 out of 5 stars", "price": "₹ 939.00", "description": ["An excellent listening experience like never-before with its crisp, clear and precise audio", "Lightweight materials make these earphones comfortable over your ears", "EarWear Base Earphone offers up to 12 hours of power between charges", "With a comfortable fit and a stylish design, these earphones give you all the comfort required while jamming. Effortlessly skip songs or answer a call at the touch of a button. An over-ear hooking design and ergonomic ear tips ensure a comfortable and secure fit during workouts as well", "Instinctive touch controls on the earphones keep everything simple", "Stay connected to the world without stretching for your mobile phone", "1 Year free replacement warranty", "Contact_us on: [ 18002666409 ]"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51NkQ8O5bgL._SL1000_.jpg"]},
{"title": "pTron Bassbuds Lite V2 in-Ear True Wireless Bluetooth Headphones (TWS) with Mic - (Black)", "asin": ["B081QXQVFM"], "rating": "3.6 out of 5 stars", "price": "₹ 999.00", "description": ["In-ear True Wireless Bluetooth Earbuds (TWS) with Stereo Sound & Bass", "On-the earbuds multi-function buttons allow calls & music control for a hands-free experience", "1 year manufacturer warranty, customer care number: 040-67138888", "Bluetooth 5.0; 6 Hours Playback Time (Earbuds) & Extended Playtime up to 20 Hours using Charging Case; 5 Hours of Talk-time; 1.5 Hours Charging Time; 100 Hours of Standby-time", "10m Wireless range; Voice Assistant Support; 400mAh Compact & Portable Charging Case, Micro USB Charging Cable Provided; Up to 2 to 3 Charge Cycles", "Ergonomic and lightweight design fit comfortably and snugly in your ear, provide perfect fit and comfort for all-day wearing with no distractions"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51KM0EyQKNL._SL1100_.jpg"]},
{"title": "Sennheiser CX 180 Street II In-Ear Headphone (Black), without Mic", "asin": ["B00D75AB6I"], "rating": "4.1 out of 5 stars", "price": "₹ 749.00", "description": ["Note: Item is a Wired in-the-ear headphone without microphone/ button to control volume", "Powerful, bass-driven stereo sound", "Provides unparalleled bass sound with balanced and high resolution stereo sound and minimizes the outside ambient noise for better listening", "Innovative finger-contoured housing design enables for easy adjustment and optimal wearing comfort", "Optimised for mp3, iPod, iPhone, CD players and portable gaming systems", "Frequency response (Headphones) - 20 Hz - 20,000 Hz", "Sound pressure level (SPL) - 110dB (1kHz/1Vrms)", "Cable length - 1.2m", "Comes with 3.5mm plug which is compatible with most of the portable devices like handsets, MP3 players etc", "Contact_us on: [ 1800223632 ]"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51j4zZ9eQSL._SL1472_.jpg"]},
{"title": "Mi Earphone Basic with Ultra deep bass and mic (Black)", "asin": ["B07CD2BN46"], "rating": "4.1 out of 5 stars", "price": "₹ 399.00", "description": ["Tangle free cable", "Ultra deep bass", "Has mic and play/pause button", "High quality silicone earbuds. Cable length-1.25 m", "3.5mm jack. Speaker impedance: 32Ω. Frequency Response Range: 20-20,000Hz, Rated power: 5mW", "Super extra bass, powerful 10mm drivers, HD clear sound, in-line microphone, play/pause your music, change your tracks and answer/end your calls", "Aluminum alloy sound chamber", "Available in black and red", "Hotline Service: 1800 103 6286, Hotline Service is available from 9 a.m. to 9 p.m. local time"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71mQ9oKDMLL._SL1500_.jpg"]},
{"title": "Wolfano RZ_85 Plastic and Metal Zip Round Shape Earphone Pouch Case for Keeping Earphones and Carrying", "asin": ["B07MJJQ6N4"], "rating": "Previous page of related Sponsored Products", "price": "₹ 245.00", "description": ["[EXCELLENCE QUALITY] : The ELV Earphone Pouch Case is a Black Colour case that can holds Pen drives,earphone,SD cards and much more.", "[SHOCK PROOF] : The exterior of the case is semi rigid and absorbs shocks and does not transfer impact to the contents inside.", "[SECURE & DURABLE] : When you carry your earphones in your purses and your pockets; when you leave them on your tables they have a tendency of getting entangled, dirty or lost. It guards, carries, stores and protects your earphones from dirt and grime, and keeps them untangled.", "[WEATHER RESISTANT] : This waterproof case protects against dust, dirt, drops, and moisture, that holds the earphone securely in place and helps protect against shock. It Helps keep out water, dust and debris."], "image_urls": [null]},
{"title": "SYSTEM BREAKER 2 in 1 PUBG Gaming Trigger and 1 Zipper Case Combo for Carrying Triggers or Earphones (Black)", "asin": ["B07M5Y98J6"], "rating": "Previous page of related Sponsored Products", "price": "₹ 166.00", "description": ["1 pair Triggers + 1 Black Zipper Case (Without earphone): Fortnite and PUBG Mobile game controller will take your gaming skills to the next level, simulating a game controller experience. You can aim and shoot all at the same time!", "Supported Devices：Designed for games on iPhone and android, PUBG, Fortnite, Knives Out, Rules of Survival, Survivor Royale, Battle Royale,Critical Ops.", "Hypersensitive：Shooting with your index finger while your thumb are moving, no delays. Easy to use and high precision, just enjoy your game.", "Free Empty EARPHONE and PUBG TRIGGER CARRYING CASE( WITHOUT EARPHONES) providing you with complete protection for your valuable earphones and even PUBG triggers, keep cable safe and away from been damage.", "easy to use"], "image_urls": [null]},
{"title": "pTron BassFest Evo Intunes Magnetic in-Ear Wireless Bluetooth Headphones with Mic - (Grey and Black)", "asin": ["B07S23Z9GF"], "rating": "3.8 out of 5 stars", "price": "₹ 649.00", "description": ["In-ear Wireless Earphones with Stereo Sound, Bass, & Magnetic Earbuds", "In-line remote control allow calls & music control for a hands-free experience", "1 year manufacturer warranty, customer care number: 040-67138888", "Bluetooth 5.0; 10m wireless range; 3-4 Hours Music & Talk-time; 1.5 Hours Charging Time; 80 Hours of Standby-time; Micro USB Charging Cable included", "Ergonomic Flexible Design; Passive Noise Cancellation; 10mm Dynamic Drivers; 70mAh Li-Polymer Battery; Universal Bluetooth Headphones", "Wireless Magnetic Earphones with Mic; Music & Volume Control; Sports Lightweight; Dual Phone Connectivity"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51eWush-p3L._SL1100_.jpg"]},
{"title": "Skyfly Xbot GE100 - Wired Gaming Earphones with Dual Driver and Dual mic (one mic Detachable) || Ideal for Mobile Gamers", "asin": ["B07ZYR78B3"], "rating": "3.0 out of 5 stars", "price": "₹ 1,799.00", "description": ["Dual Driver with Dual Mic - for crystal clear sound quality", "Neodymium Dynamic Driver with Driver Diameter of 4 X 6 mm", "Gold Plated 3.5 mm Audio Jack for crisp sound to hear foot steps of approaching enemies in games", "Cable Length of 1.2m", "Ideal for mobile gaming like PUBG and Fortnite"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71zqIG7O%2BdL._SL1500_.jpg"]},
{"title": "iBall Convexo 2 in Ear Wired Earphone with Mic - Powerful Sound and Bass (Black)", "asin": ["B07TRNC21V"], "rating": "3.1 out of 5 stars", "price": "₹ 320.00", "description": ["QUALITY SOUND - Delivers quality sound to a young and connected audience who listens to music on the go A superior crystal-clear sound, rolling out a thumping bass", "BUILT-IN MIC - An in-line microphone to manage music and calls", "UNIQUE DESIGN - Redefining elegance, the in-ear headphone comes equipped with a cute button design", "PERFECT FIT - Angular design for a comfortable fit", "COMPATIBILITY - Universal 35 mm jack is compatible with most of your devices", "WARRANTY- 1 year warranty"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/41rQd0RM0LL._SL1000_.jpg"]},
{"title": "Wolfano RZ_85 Plastic and Metal Zip Round Shape Earphone Pouch Case for Keeping Earphones and Carrying", "asin": ["B07MFVKG6M"], "rating": "1.0 out of 5 stars", "price": "₹ 245.00", "description": ["[EXCELLENCE QUALITY] : The ELV Earphone Pouch Case is a Black Colour case that can holds Pen drives,earphone,SD cards and much more.", "[SHOCK PROOF] : The exterior of the case is semi rigid and absorbs shocks and does not transfer impact to the contents inside.", "[SECURE & DURABLE] : When you carry your earphones in your purses and your pockets; when you leave them on your tables they have a tendency of getting entangled, dirty or lost. It guards, carries, stores and protects your earphones from dirt and grime, and keeps them untangled.", "[WEATHER RESISTANT] : This waterproof case protects against dust, dirt, drops, and moisture, that holds the earphone securely in place and helps protect against shock. It Helps keep out water, dust and debris.", "It can also be gifted to your loved one. So, adorn the looks by adding this laptop sleeve cover"], "image_urls": [null]},
{"title": "pTron Bassbuds Lite V2 in-Ear True Wireless Bluetooth Headphones (TWS) with Mic - (Black)", "asin": ["B081QXQVFM"], "rating": "3.6 out of 5 stars", "price": "₹ 999.00", "description": ["In-ear True Wireless Bluetooth Earbuds (TWS) with Stereo Sound & Bass", "On-the earbuds multi-function buttons allow calls & music control for a hands-free experience", "1 year manufacturer warranty, customer care number: 040-67138888", "Bluetooth 5.0; 6 Hours Playback Time (Earbuds) & Extended Playtime up to 20 Hours using Charging Case; 5 Hours of Talk-time; 1.5 Hours Charging Time; 100 Hours of Standby-time", "10m Wireless range; Voice Assistant Support; 400mAh Compact & Portable Charging Case, Micro USB Charging Cable Provided; Up to 2 to 3 Charge Cycles", "Ergonomic and lightweight design fit comfortably and snugly in your ear, provide perfect fit and comfort for all-day wearing with no distractions"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51KM0EyQKNL._SL1100_.jpg"]},
{"title": "ATARC Gaming Earphones with Mic Wire Gaming (Black) for Comfort PubG and All Games", "asin": ["B08BTKV538"], "rating": "Previous page of related Sponsored Products", "price": "₹ 412.00", "description": ["✅ In-ear Wired Earphones with Stereo Sound & Bass", "✅ In-line Remote Control with Mic, Music & Call Control", "✅ Ensures Better Sound Separation; Ergonomic Design; Passive noise cancellation", "✅ Comfort & Durable; Silver-plated 3.5mm Audio Jack; Widely compatible with 3.5mm Audio Port Devices; 1.2m Tangle-free Cable"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61t3B7eK4RL._SL1500_.jpg"]},
{"title": "PTron Quinto Bluetooth Speaker 10W Wireless Mini Speaker Portable Bluetooth Dual BT Speaker with Mic (Gold)", "asin": ["B07FT699TP"], "rating": "4.0 out of 5 stars", "price": "₹ 1,149.00", "description": ["The whole body of this retro ptron quinto bluetooth speaker is beautifully finished and made of wood, this portable wireless speaker is a perfect musical companion at home or at work", "Ultra-portable - lightweight yet rugged, it is the best wood speaker for home, dorm room, kitchen, office, small parties, camping, creates a one-of-a-kind portable music experience", "Long lasting lithium battery - built in rechargeable 1200mah lithium battery can be charged by micro usb cable (charging cable included) and it also support charging while playing", "It offer 3-4 hours (at normal volume) of playtime with full battery on a single charge", "12 months warranty from the date of purchase by end customer. Contact_us on: [040 - 67138888]"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51AnOt07JlL._SL1100_.jpg"]},
{"title": "pTron BassFest Evo Intunes Magnetic in-Ear Wireless Bluetooth Headphones with Mic - (Grey and Black)", "asin": ["B07S23Z9GF"], "rating": "3.8 out of 5 stars", "price": "₹ 649.00", "description": ["In-ear Wireless Earphones with Stereo Sound, Bass, & Magnetic Earbuds", "In-line remote control allow calls & music control for a hands-free experience", "1 year manufacturer warranty, customer care number: 040-67138888", "Bluetooth 5.0; 10m wireless range; 3-4 Hours Music & Talk-time; 1.5 Hours Charging Time; 80 Hours of Standby-time; Micro USB Charging Cable included", "Ergonomic Flexible Design; Passive Noise Cancellation; 10mm Dynamic Drivers; 70mAh Li-Polymer Battery; Universal Bluetooth Headphones", "Wireless Magnetic Earphones with Mic; Music & Volume Control; Sports Lightweight; Dual Phone Connectivity"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51eWush-p3L._SL1100_.jpg"]},
{"title": "H3 Earphone by Fashion Factory|Earphone 3.5mm Jack with mic|Earphone 3D Sound|Earphone Double Speaker| Sound Deep bass Stereo Compatible with All 3.5 mm Jack Smartphones", "asin": ["B08CVSB135"], "rating": "Previous page of related Sponsored Products", "price": "₹ 299.00", "description": ["10mm dynamic drivers: Produces crystal clear sound and deep bass so that you can experience in-game battles and hear sounds such as footsteps and gunshots so you know your enemies location", "In-line Noise Cancelling Mic: H3 has an integrated microphone and smart remote for easy usability making it compatible with almost all 3.5mm devices", "Includes 1.2m TPE Cable: Our cable is made of TPE material to provide strong durability and is soft anti-winding to avoid getting it tangled", "Comfort Fit: These earphones are extremely light weight at just 15 grams; you can easily game for hours with maximum comfort. Metal Gaming Earphones with Noise Cancelling Microphone", "6 months warranty from the date of purchase by end customer."], "image_urls": [null]},
{"title": "Cosmic Byte Cosmos Carbon in-Ear Vibration Gaming Earphone with Mic (Black)", "asin": ["B07TPDR9RT"], "rating": "3.1 out of 5 stars", "price": "₹ 1,341.00", "description": ["Gaming Earphones with Vibration Drivers", "Stronger Bass", "Inbuilt Microphone", "Functional and technical", "Lightweight form-factor", "Extremely comfortable, ergonomic design for sustained usage", "Widely Compatible with Mobile devices, Tablets, PS4, Xbox 1, Laptops & PCs"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61N-P-Ce9QL._SL1100_.jpg"]},
{"title": "Oraima 7.1 Channel USB External Sound Card Audio Adapter with mic and 3.5mm Microphone Earphone Socket 2.0 Speaker Virtual 3D Support (White)", "asin": ["B07SRFPTFZ"], "rating": "3.5 out of 5 stars", "price": "₹ 245.00", "description": ["The USB Virtual 7.1 Channel Sound Adapter is a highly flexible audio interface which can be used either with desktop or notebook systems.", "Comes bundled with Xear 3D Sound simulation software, and turns your stereo speaker or earphones into a 7.1 channel environment! USB2.0 Full-Speed (12Mbps) Specification USB HID Class Specification 1.1 USB Audio Device Class Specification 1.0. Support Mac OS and Linux", "Plug the sound adapter into your usb port, and then plug your headphones into the adapter", "Connectors: USB Type-A, stereo output jack, Mono microphone input jack", "No driver required for Windows 98SE/ME/2000/XP/Server 2003/Vista/Windows7.Linux,Macos"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51n9KO1Oo7L._SL1100_.jpg"]},
{"title": "HP in-Ear H2310 Universal Headset with Mic and Volume Control (Black)", "asin": ["B077K1ZRP9"], "rating": "3.8 out of 5 stars", "price": "₹ 835.00", "description": ["Compatible with most notebook PCs, netbooks, tablets, mobile phones and MP3 players", "Hear it all - the bold bass and the high treble - with neodymium speaker drivers providing stereo performance to boost your listening experience", "Never lose a call, the in-line microphone is subtly designed into the flat cord and includes simple controls for volume, mute, answer and cancel", "3.5mm audio port", "1.5m cable length", "Headset: 20 Hz to 20 KHz", "Microphone: 100 Hz to 10 KHz", "1 year limited warranty"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61vMqEER%2BJL._SL1200_.jpg"]},
{"title": "Baal Spiral Protection Wire for Earphone, Data Cable and Charger Cable", "asin": ["B089STTF6L"], "rating": "Previous page of related Sponsored Products", "price": "₹ 348.00", "description": ["Easy to use on your cables and makes them easily identifiable and completely unique", "MULTIPURPOSE: Protect your wire and cords from dirt, frays, tangles and knots", "Easy to be kept in your pocket, handbag, backpack or carry-on luggage. (compatible To Iphone 5,6,7)", "It will takes you about 20-30 minutes to finish twining round your USB cable and headset line"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71R8iTiWabL._SL1500_.jpg"]},
{"title": "Saco Earphone Carrying Keychain Holder Case Pouch - Multi Purpose Pocket Storage Travel Organizer for Earphone, Pen Drives, mp3 Player - (Red)", "asin": ["B077VM69DY"], "rating": "3.7 out of 5 stars", "price": "₹ 231.00", "description": ["Multi-Purpose Pocket Storage Case Is Designed To Keep You Earphones Clean And Safe", "You Can Hold Like Earphone, Pen Drives, and mp3 player", "Hook It Up - Easily With Bags, Belts, And Loops", "Easily Carry To Travel Earphones Bag, Card Bag, Multi-Function Of The Small Box", "Best Quality and Lightweight. High-Quality Material"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/91StNA0TyiL._SL1500_.jpg"]},
{"title": "GoFree Multi-Purpose Large Case for Wi-Fi Hotspot 3G/4G USB dongle, Mobile Charger, Power Bank, Pen Drives, Earphones (Carbon Fibre Black)", "asin": ["B01N7520KS"], "rating": "4.2 out of 5 stars", "price": "₹ 399.00", "description": ["Spacious and versatile", "Unmatched styling", "Multi purpose hook", "Shock proof"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/716DpBWA8CL._SL1290_.jpg"]},
{"title": "CONEKT ACE + Type C Charging Cable for Samsung S8, Type-C, USB Charging Connector Cord 6.6 Feet 2 Meter 6.6 feet for New MacBook Chromebook Pixel Google Nexus 6P 5X Microsoft Lumia 950 XL Lumia 950 OnePlus 2 Nokia N1 Tablet Asus Zenpad S 8.0 Huawei P20 USB Cable (Grey Black)", "asin": ["B07H8HVJDF"], "rating": "Previous page of related Sponsored Products", "price": "₹ 499.00", "description": ["STURDY AND DURABLE: Making the charger cable has more longer working life", "Built-to-last - It's flat tangle free design makes it more resistant to tangles compared to the common round cable", "10x More Durable, 10000 Bend Test Ultra flexibility, 2 meter long cable ensures that you can simply use and carry it anywhere", "FASTER CHARGE: Great performance on charging, Support quick charge, without waiting for long time to charge the phone. Made with high quality, extra thick solid copper wire, which provides fastest charging up to 3.0A and smooth data transmission 2 year warranty", "SUPER COMPATIBILITY: Works with Samsung S8, HTC, LG, OnePlus Two, OnePlus Three,Google, Nexus 5X, Nexus 6P, MI, Oppo, Vivo and more devices"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61k0ySzGtEL._SL1100_.jpg"]},
{"title": "Zebronics Zeb-Temptation Standard Earphone", "asin": ["B07NQM2VR8"], "rating": "3.3 out of 5 stars", "price": "₹ 168.00", "description": ["In-line microphone and Stylish design", "Tangle free cable and Travel pouch", "Strong and long lasting cable", "Features: In-line microphone, Stylish design, Tangle free cable, Travel pouch & Strong and long lasting cable", "Frequency response 20Hz-20kHz", "Available in Black and White color", "Warranty - 6 months from the date of purchase"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71OGyYVci4L._SL1500_.jpg"]},
{"title": "FINGERS F2.0 USB Computer/Laptop Multimedia 2.0 Speaker", "asin": ["B07YFZNX7G"], "rating": "3.8 out of 5 stars", "price": "₹ 810.00", "description": ["【F2.0 speakers】 Is the perfect companion for your PCs and will look great in every home and office. A sleek space saving design complemented by a rich black piano finish makes this a visual treat.", "【 2 speakers rolled into one】 With the versatile F2.0 speakers - You get two speakers in a single form factor that provides immersive sound at any given volume.", "【 Use either vertically or horizontally】 Place it vertically or horizontally or even mount it as needed.", "【 USB Powered for simple Plug-n-Play setup】 Simply plug it into the USB port of your computer/laptop and enjoy crystal clear room-filling sound instantly.", "【 Crystal Clear Room filling Sound】  Equipped with anti-magnetic design that is magnetically shielded, F2.0 ensures seamless listening experience without any distortion. Means you no longer have to worry about any interference that can be caused by other peripherals connected in a PC setup."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61xZ%2BmO2xSL._SL1200_.jpg"]},
{"title": "iBall EarWear Sporty Wireless Bluetooth Headset with Mic for All Smartphones (Fluorescent Yellow)", "asin": ["B07VNQZJMJ"], "rating": "3.7 out of 5 stars", "price": "₹ 969.00", "description": ["Sporty look that will motivate you to go the extra mile", "Supreme Sound quality", "Multi-point technology that allows users to connect 2 phones simultaneously", "Angular earbuds for comfort fit, ideal for workout sessions", "EarWear Sporty is universally compatible with most of the Bluetooth enabled devices and Apps", "Built-in rechargeable battery (Charge through USB) that powers 3.5 hours of non-stop music on full volume", "Offers standby time up to 150 hours", "1 Year warranty", "For any queries, please contact_us on: [1800-266-6409]"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51zoLWtbKbL._SL1000_.jpg"]},
{"title": "Xmate Gusto Lite in-Ear True Wireless Bluetooth Headphones (TWS) - (Black)", "asin": ["B083LY3TGZ"], "rating": "3.3 out of 5 stars", "price": "₹ 1,799.00", "description": ["Binaural Earbuds; Passive Noise Cancelation; 400mAh Magnetic Charging Case; Micro USB Charging Cable included; 180 Hours Standby-time", "Xmate Gusto Lite is an In-ear True Wireless Earbuds with Hi-Fi Sound & Bass", "On-the-earbud multi-function button helps to manage phone calls & music", "Bluetooth v5.0; Ultra-Mini Size; Comfort-fit; 10m Wireless Range; 3 hours music/talk time (Earbuds); Extended Playtime up to 12 Hours using Charging Case; 50mAh Battery in each Earbud; 1.5 Hours Charging Time", "1 year warranty provided by the manufacturer from date of purchase"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61zFcKaSVvL._SL1100_.jpg"]},
{"title": "2 in 1 Splitter 8 Pin to Dual 8 Pin Phone Charger Converter for iPhone 7 8 Plus X Charging Cable Adapter Mini Earphone Converter (Silver)", "asin": ["B07Z222RZV"], "rating": "1.0 out of 5 stars", "price": "₹ 210.00", "description": ["Charge and listen: suitable for iPhone X, 8, 8 Plus, 7 and 7 Plus, this dual lightning splitter allows you to use headphones and charge at the same time. Supports the microphone and remote control on Apple headphones.", "Small and portable: this dual lightning adapter is very small, lightweight and compact. You can put it in your bag or pocket and enjoy your favourite music with your phone anytime and anywhere.", "Efficient and stable signal transmission: our iPhone adapter provides non-destructive digital sound quality and ensures stable transmission. Just plug it in and enjoy clear, faithful sound quality.", "High compatibility: this iPhone adapter is perfectly compatible with iOS 11.2, and supports all iPhone X, iPhone 8, iPhone 8 Plus, iPhone 7 and iPhone 7 Plus."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51CUC7K11pL._SL1100_.jpg"]},
{"title": "pTron Bassbuds Lite V2 in-Ear True Wireless Bluetooth Headphones (TWS) with Mic - (Black)", "asin": ["B081QXQVFM"], "rating": "3.6 out of 5 stars", "price": "₹ 999.00", "description": ["In-ear True Wireless Bluetooth Earbuds (TWS) with Stereo Sound & Bass", "On-the earbuds multi-function buttons allow calls & music control for a hands-free experience", "1 year manufacturer warranty, customer care number: 040-67138888", "Bluetooth 5.0; 6 Hours Playback Time (Earbuds) & Extended Playtime up to 20 Hours using Charging Case; 5 Hours of Talk-time; 1.5 Hours Charging Time; 100 Hours of Standby-time", "10m Wireless range; Voice Assistant Support; 400mAh Compact & Portable Charging Case, Micro USB Charging Cable Provided; Up to 2 to 3 Charge Cycles", "Ergonomic and lightweight design fit comfortably and snugly in your ear, provide perfect fit and comfort for all-day wearing with no distractions"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51KM0EyQKNL._SL1100_.jpg"]},
{"title": "(Renewed) Zebronics Zeb-Aika Earphone Supporting Bluetooth, Voice Assistant, Call Function, Dual Pairing", "asin": ["B08CGNKNPT"], "rating": "Previous page of related Sponsored Products", "price": "₹ 1,096.50", "description": ["This Certified Refurbished product is tested to work and look like new with minimal to no signs of wear & tear; the product comes with relevant accessories and is backed by a minimum six month supplier backed warranty; box may be generic", "Zeb-Aika Wireless Neckband Earphone with 22 Hours* playback ,Metallic Body ,Braided Neckband ,10mm Audio Driver ,Call/Media Controls ,Voice Assistant and Magnetic Earpieces", "Handsfree design with dedicated buttons for various functions like answer /reject calls ,voice assistance and media playback control .", "The wireless earphone features bluetooth v5.0 that provides stable and seamless connectivity.", "Charging Time 2 hours Talk Time 20 hours* (*at 50% volume) Playback Time 22 hours* (*at 50% volume)"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/518WfEipXjL._SL1000_.jpg"]},
{"title": "CONEKT ACE + Type C Charging Cable for Samsung S8, Type-C, USB Charging Connector Cord 6.6 Feet 2 Meter 6.6 feet for New MacBook Chromebook Pixel Google Nexus 6P 5X Microsoft Lumia 950 XL Lumia 950 OnePlus 2 Nokia N1 Tablet Asus Zenpad S 8.0 Huawei P20 USB Cable (Grey Black)", "asin": ["B07H8HVJDF"], "rating": "Previous page of related Sponsored Products", "price": "₹ 499.00", "description": ["STURDY AND DURABLE: Making the charger cable has more longer working life", "Built-to-last - It's flat tangle free design makes it more resistant to tangles compared to the common round cable", "10x More Durable, 10000 Bend Test Ultra flexibility, 2 meter long cable ensures that you can simply use and carry it anywhere", "FASTER CHARGE: Great performance on charging, Support quick charge, without waiting for long time to charge the phone. Made with high quality, extra thick solid copper wire, which provides fastest charging up to 3.0A and smooth data transmission 2 year warranty", "SUPER COMPATIBILITY: Works with Samsung S8, HTC, LG, OnePlus Two, OnePlus Three,Google, Nexus 5X, Nexus 6P, MI, Oppo, Vivo and more devices"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61k0ySzGtEL._SL1100_.jpg"]},
{"title": "Noise Shots Rush True Bluetooth Wireless Earbuds with Low Latency Gaming Mode & 3 Equaliser Sound Presets (Charcoal Grey)", "asin": ["B0881T571S"], "rating": "3.7 out of 5 stars", "price": "₹ 3,799.00", "description": ["Bluetooth 5.0: The latest Bluetooth standard enables better wireless range and more stable connections on Shots Rush.", "12mm Speaker Drivers: are tuned for punchy, satisfying bass.", "Extended Ear Hooks: on the earbuds for secure fit that that can withstand even the hardest workouts.", "Low Latency Gaming Mode: lets you game with Noise Shots Rush", "3 EQ Modes: Choose from Rock, Pop and Classic EQ modes.", "Full Touch Controls: let your control playtime, adjust volume and manage calls without pressing buttons.", "Offers playback time of up to 6 hours for every charge. Carrying case can give 3 additional charges to the earbuds making total play-time of up to 24 Hours.", "IPX5 Water Resistant: so no amount of rain or sweat can damage your Shots Rush earphones.", "Voice Assistant Support: For Siri & Google Assistant on iOS & Android with just a touch & hold on your Shots Rush earphones.", "For support, Contact_us on: +91 8882132132, Email: help@nexxbase.com or support.gonoise.in"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61mvQucgoNL._SL1500_.jpg"]},
{"title": "Cratly™ Assorted Multipurpose Taco Cable Holder Clips Organizer/Cable Wire Holder/Made of Pure Leather Having Brass Button Made of Leather Set of 2, Size 3x3 (LXB) Inches", "asin": ["B07NNRRP9S"], "rating": "3.0 out of 5 stars", "price": "₹ 299.00", "description": ["Size : 3x3( LXB ) Inches, Color : Assorted ( Any 2 Color PC)", "EASY TO USE: The Cord Keepers are simple to use. Just wrap up your cables, place them in the Dog or Cat’s mouth, and clip it closed with the sturdy, brass metal snaps that resembles its nose. Using only the finest heavy duty metal, these attractive snaps are firm and tight, ensuring no accidental release or flimsiness.", "Purpose : Hold Cable and Cover it. Compact and Classic Design, Fashion and Practical, Soft and Flexible, Convenient to Carry", "FUN CORD MANAGEMENT: Add a touch of fun and style to your messy cables with these easy to use Furry Friends Cord Keepers. Perfect for tidying up your cables on your travels, reducing desk clutter at work, storage in your car or at home. Made with Full Grain Suede Leather and heavy duty, attractive metal, these are fun and stylish ways to keep your cables neat and tidy. Perfect for phone chargers, headphones, your everyday cables.", "MADE WITH HIGH QUALITY FULL GRAIN LEATHER: These Furry Friends Cord Keepers are hand-made using only the best material, 100% full grain leather. Together with heavy duty, attractive, metal snaps, the combination of such quality materials ensures a long lasting, durable yet lightweight home for your cables. Compact enough to fit snugly in your pocket, too."], "image_urls": [null]},
{"title": "Trajectory Knight Grey Anti Theft Backpack, Premium Earphone Case and Laptop Sleeve 3 in 1 Combo", "asin": [], "rating": "3.8 out of 5 stars", "price": "₹ 999.00", "description": ["✔ANTI-THEFT CASUAL BACKPACK: Black Colour Anti Theft Light Weight Casual Backpack for Men and Women for Office, College and school students (NO POWER BANK INCLUDED IN PACKAGE)", "✔CONSIDERATE DETAILS: Easy Access Pockets on the Shoulder Strap as well on the Backside of the Bag for quick access to essentials. Huge compartment size that can fit all laptops with ease. Multiple pockets for other accessories. You can also fit several books with ease into this bag", "✔MULTI PURPOSE: Dimensions: 30 cms x 12 cms x 42 cms (LxWxH). Can keep Laptops of maximum 15.6 inch screen size. Comes with Premium 600D Oxford fabric. Shoulder strap has special pockets to store public transportation cards for easy access.", "✔WANT TO KEEP YOUR LAPTOP SAFE AND SOUND? Now keep your Laptop Dust and Scratch Free with Premium Black Neoprene Padded Laptop Sleeve for a maximum of 15.6' laptop. (NOTE: This sleeve has its natural Neoprene smell, this smell fades on use).We are proud to say that this product is MADE IN INDIA! SUPPORT INDIAN GOODS!", "✔WHAT'S MORE? GET FREE EMPTY EARPHONE CASE: Keep earphone,charger, pen drive safely inside the bag with Free Earphone Case in smooth black color also this Product Comes with 12 MONTHS WARRANTY. (NOTE: Earphone case comes empty)For customer service and warranty related queries please contact us:+91-8178915719 email: marketing.trajectory@gmail.com ,available Monday to Saturday 10:30 AM to 6:00 PM except national holidays."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61YhLPuVJ-L._SL1200_.jpg"]},
{"title": "Woozik Stereo Earphone with Mic - Noise Isolation with Precise Bass, High Fidelity Sound, Universal 3.5mm Jack- Silver", "asin": ["B074TZTZ7T"], "rating": "2.5 out of 5 stars", "price": "₹ 499.00", "description": ["Premium headphone for high sound quality and high-resolution audio; Perfect for listening during exercise, travel or for everyday wear", "Fixed, in-ear design with soft outer silicone to keep earphones in place while listening; 3 Pairs of soft gel eartips included; The earbuds fit gently and safely in the ears", "Standard 3.5Mm auxiliary jack, ideal for all apple devices, android smartphones, windows phones and mp3/mp4 players", "Ultra thin earphone line and a y-symmetric interface design, with mic", "Both convenient and fashionable; Built-in microphone, make calls hands-free with a multi-function button 1 click to answer the call, second click to hand up and long press 3 seconds to talk", "6 Month Replacement Warranty"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61fCei-LBML._SL1200_.jpg"]},
{"title": "Cosmic Byte Cosmos Carbon in-Ear Vibration Gaming Earphone with Mic (Black)", "asin": ["B07TPDR9RT"], "rating": "3.1 out of 5 stars", "price": "₹ 1,341.00", "description": ["Gaming Earphones with Vibration Drivers", "Stronger Bass", "Inbuilt Microphone", "Functional and technical", "Lightweight form-factor", "Extremely comfortable, ergonomic design for sustained usage", "Widely Compatible with Mobile devices, Tablets, PS4, Xbox 1, Laptops & PCs"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61N-P-Ce9QL._SL1100_.jpg"]},
{"title": "FEDUS Stereo External Sound Card with 3.5 mm Headphone and Microphone Socket 7.1 Channel 5Hv2 USB Sound Card Audio Earphone Socket Adapter with Mic, USB to Sound, Compatible with Windows/Server 2003", "asin": ["B089SYBQPR"], "rating": "Previous page of related Sponsored Products", "price": "₹ 229.00", "description": ["Easy to set up: No driver required, just plug and play! USB bus-powered, no external power required for this convenient sound card.", "Perfect to bypass a faulty sound card, audio port, or as a replacement for a broken USB audio adapter. Leave connected to a USB hub or dock to avoid unplugging", "Applies to: 3.5mm jacks such as earphones, headphones or microphones the device stops working or the output cuts in. It also applies to computer / laptop / desktop sound card and motherboard connections. You can also use the microphone and headset with your iMac / Mac Mini device.", "Wide Compatibility: Windows 10/98SE/ME/2000/XP/Server 2003/Vista/7/8/Linux/Mac OSX/ PS4/ Google Chromebook/ Windows Surface Pro 3/ Raspberry Pi are ok with the usb to audio adapter. Please kindly note it only supports mono microphone TRS, it does not support TS, TRRS. Not compatible with PS3.", "Support 3d sound and virtual 7.1 sound track,the best entertainment for game, dvd music"], "image_urls": [null]},
{"title": "iBall yo Flute Powerful bass-Driven Sound (White)", "asin": ["B07MTF1R6B"], "rating": "3.1 out of 5 stars", "price": "₹ 349.00", "description": ["Angular earbud design for comfort fit", "Significant powerful sound & Bass effect", "Built-in mic for calling", "Universal 3.5mm audio jack", "Light-weight", "Available in 2 colors: Black & White"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/41r4YWxnU1L._SL1000_.jpg"]},
{"title": "FINGERS F2.0 USB Computer/Laptop Multimedia 2.0 Speaker", "asin": ["B07YFZNX7G"], "rating": "3.8 out of 5 stars", "price": "₹ 810.00", "description": ["【F2.0 speakers】 Is the perfect companion for your PCs and will look great in every home and office. A sleek space saving design complemented by a rich black piano finish makes this a visual treat.", "【 2 speakers rolled into one】 With the versatile F2.0 speakers - You get two speakers in a single form factor that provides immersive sound at any given volume.", "【 Use either vertically or horizontally】 Place it vertically or horizontally or even mount it as needed.", "【 USB Powered for simple Plug-n-Play setup】 Simply plug it into the USB port of your computer/laptop and enjoy crystal clear room-filling sound instantly.", "【 Crystal Clear Room filling Sound】  Equipped with anti-magnetic design that is magnetically shielded, F2.0 ensures seamless listening experience without any distortion. Means you no longer have to worry about any interference that can be caused by other peripherals connected in a PC setup."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61xZ%2BmO2xSL._SL1200_.jpg"]},
{"title": "iBall Nano Earwear Ring-Dock B10 - Wireless Bluetooth Earphones with in-Built Mic (Black) in a Charging Pod", "asin": ["B07TWWPYPC"], "rating": "3.3 out of 5 stars", "price": "₹ 1,493.00", "description": ["Bluetooth Wireless In-ear Headset with Mic: Wireless is the way forward", "Charging pod – less dependency on wired chargers", "Ergonomic design for the “fitting” fit", "Go hands-free while conversing – those ones are of the best type", "Multi-point technology for connecting 2 BT devices simultaneously"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51masnfXMEL._SL1000_.jpg"]},
{"title": "Rolgo1 External Stereo Sound Card with 3.5 mm Headphone and Microphone Socket 7.1 Channel 5Hv2 USB Sound Card Audio Earphone Socket Adapter with Mic, USB to Sound, Compatible with Windows", "asin": ["B089QPBPSM"], "rating": "Back", "price": "₹ 179.00", "description": ["USB audio adapter is to replace your faulty sound card or audio port, it adds a mono microphone-in and a stereo audio-out port to your computer through a USB port, which enables you to connect your existing headphones, headset, speakers, or microphone with 3.5mm jack to your PC through a USB interface.", "Practical Stereo Sound Adapter: It protects against electromagnetic interference and enjoy the stable and best sound quality. additionally,", "suitable as a second sound source for simultaneous operation of loudspeakers and headphones. The USB Virtual 7.1 Channel Sound Adapter is a highly flexible audio interface which can be used either with desktop or notebook systems", "Plug the Sound Adapter into your USB port, no driver required, just plug and play! USB bus-powered, no external power required for this convenient sound card."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/41oahHStazL._SL1024_.jpg"]},
{"title": "THRUMM Buster Avenger Endgame Captain America +Iron Man Wired in-Ear with Mic Earphone", "asin": ["B078W54QW4"], "rating": "2.6 out of 5 stars", "price": "₹ 400.00", "description": ["Made to fit you and your lifestyle, providing a smooth grip for an extra secure and comfortable fit for your ears", "Wired Earphone with amazing look and sound. Built-in microphone for calling", "Great Microphone for clear conversation, not just music makes this headphone a great choice.", "1 Year Manufactruring Warranty"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/6161nddlGcL._SL1400_.jpg"]},
{"title": "Zebronics Zeb-Protect Wired Earphone with Call Function(Blue)", "asin": ["B07XFXB4XL"], "rating": "3.1 out of 5 stars", "price": "₹ 229.00", "description": ["Zeb-Protect is a Wired Earphone With Stylish design", "It is Lightweight", "It has Strong and long lasting cable", "Impedance 16Ω", "Frequency response 20Hz-20kHz", "Connector 3.5mm Jack", "6 months -from the date of purchase", "Customer Care-9360942527"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71XRiCovCYL._SL1500_.jpg"]},
{"title": "Zebronics Zeb-Temptation Standard Earphone", "asin": ["B07NQM2VR8"], "rating": "3.3 out of 5 stars", "price": "₹ 168.00", "description": ["In-line microphone and Stylish design", "Tangle free cable and Travel pouch", "Strong and long lasting cable", "Features: In-line microphone, Stylish design, Tangle free cable, Travel pouch & Strong and long lasting cable", "Frequency response 20Hz-20kHz", "Available in Black and White color", "Warranty - 6 months from the date of purchase"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71OGyYVci4L._SL1500_.jpg"]},
{"title": "Xmate Gusto Lite in-Ear True Wireless Bluetooth Headphones (TWS) - (Black)", "asin": ["B083LY3TGZ"], "rating": "3.3 out of 5 stars", "price": "₹ 1,799.00", "description": ["Binaural Earbuds; Passive Noise Cancelation; 400mAh Magnetic Charging Case; Micro USB Charging Cable included; 180 Hours Standby-time", "Xmate Gusto Lite is an In-ear True Wireless Earbuds with Hi-Fi Sound & Bass", "On-the-earbud multi-function button helps to manage phone calls & music", "Bluetooth v5.0; Ultra-Mini Size; Comfort-fit; 10m Wireless Range; 3 hours music/talk time (Earbuds); Extended Playtime up to 12 Hours using Charging Case; 50mAh Battery in each Earbud; 1.5 Hours Charging Time", "1 year warranty provided by the manufacturer from date of purchase"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61zFcKaSVvL._SL1100_.jpg"]},
{"title": "GoFree Orb Case for Earphones, Pen Drives, SD Memory Cards, Keys, Coins Etc. (Multi Purpose Case) Shock Proof Ballistic Nylon (Orchid Purple)", "asin": ["B07CXZKWT5"], "rating": "4.3 out of 5 stars", "price": "₹ 299.00", "description": ["Optimal shape: the gofree orb shape is spherical in shaped with tapered top, the case has a small foot print", "However, the case has a lot of room in the inside to keep a lot more contents one would think is possible", "Truly multi-purpose: the gofree orb case is a truly multipurpose case with enough space to store large earphone with ear buds, multiple pen drives, multiple memory cards, charger cables and connectors", "Rigid shell: the gofree orb case is made from a tough semi-rigid shell covered with 1680d ballistic nylon which makes the case tough and shock resistant", "Mesh compartment: a handy mesh compartment on the inside of the lid to store small accessories and connectors and hold them on to place", "Gofree promise: all gofree products come with excellent after sales support and are made with the best materials, excellent workmanship, finish and gofree warranty"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/911la0PSL5L._SL1500_.jpg"]},
{"title": "TKM Gaming Earphones with Mic Wire Gaming (Black) for Comfort pubg and All Games", "asin": ["B07Y1T9826"], "rating": "3.7 out of 5 stars", "price": "₹ 290.00", "description": ["with 10 pcs. earbuds free", "Extra Deep Bass & comfort for Gaming", "One-Button Universal Remote with Mic", "Anti Noise Earphones & Specially Designed Cable and Earphone shape", "6 months manufacturer’s warranty"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71wR%2BcVokVL._SL1500_.jpg"]},
{"title": "TULMAN Gold Plated 3.5mm Headphone Earphone 2 Male to 1 Female mic Audio Y Splitter Cable for Laptop - Black", "asin": ["B07PPVBT1R"], "rating": "3.9 out of 5 stars", "price": "₹ 339.00", "description": ["3.5mm audio Y splitter cable provide maximum conductivity and durability, Compact design for maximum portability - a great solution to have on hand in your laptop bag. Size : 20cm.", "3.5mm stereo splitter cable allows you to easily connect your stereo headset Mic to a PC audio port and mic port at the same time.", "Dual 3 position 3.5mm jack, ideal for connecting two headsets on one audio source, let you enjoy your cellphone music together with your friend easily.", "3.5mm Speaker and headphone Splitter with two male ports: one for Headphone Jack on your PC/Laptop, the other for Mic Jack on your PC/Laptop.", "Compact design for maximum portability - a great solution to have on hand in your laptop bag."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61MB6OhcZeL._SL1500_.jpg"]},
{"title": "HiFuture J3 Metal Gaming Earphones with Noise Cancelling Microphone, Deep Bass with Hi-Fi Stereo Sound for Mobile Phones, Tablets, Laptop, PS4, Xbox and Nintendo Switch (Black)", "asin": ["B081CR1NP6"], "rating": "4.2 out of 5 stars", "price": "₹ 390.00", "description": ["The 10mm dynamic drivers produces crystal clear sound and deep bass so that you can experience in-game battles and hear sounds such as footsteps and gunshots so you know your enemies location", "In-line Noise Cancelling Mic J3 has an integrated microphone and smart remote for easy usability making it compatible with almost all 3.5mm devices", "Includes 1.2m TPE Cable Our cable is made of TPE material to provide strong durability and is soft anti-winding to avoid getting it tangled", "Comfort Fit These earphones are extremely light weight at just 15 grams; you can easily game for hours with maximum comfort. Also, included are three sets of different sized ear buds (S/m/L)", "Warranty: 1 year warranty"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51u8VAlBNwL._SL1000_.jpg"]},
{"title": "pTron Bassbuds Lite V2 in-Ear True Wireless Bluetooth Headphones (TWS) with Mic - (Black)", "asin": ["B081QXQVFM"], "rating": "3.6 out of 5 stars", "price": "₹ 999.00", "description": ["In-ear True Wireless Bluetooth Earbuds (TWS) with Stereo Sound & Bass", "On-the earbuds multi-function buttons allow calls & music control for a hands-free experience", "1 year manufacturer warranty, customer care number: 040-67138888", "Bluetooth 5.0; 6 Hours Playback Time (Earbuds) & Extended Playtime up to 20 Hours using Charging Case; 5 Hours of Talk-time; 1.5 Hours Charging Time; 100 Hours of Standby-time", "10m Wireless range; Voice Assistant Support; 400mAh Compact & Portable Charging Case, Micro USB Charging Cable Provided; Up to 2 to 3 Charge Cycles", "Ergonomic and lightweight design fit comfortably and snugly in your ear, provide perfect fit and comfort for all-day wearing with no distractions"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51KM0EyQKNL._SL1100_.jpg"]},
{"title": "iBall Earwear Gem in Ear Wired Earphones with Mic (Black)", "asin": ["B07SJ65GTH"], "rating": "4.7 out of 5 stars", "price": "₹ 399.00", "description": ["QUALITY SOUND - Delivers quality sound to a young and connected audience who listens to music on the go A superior crystal-clear sound, rolling out a thumping bass", "BUILT-IN MIC - In-Line push button control with Mic to easily answer and end calls", "PERFECT FIT- Angular earbuds, custom-made for superior fit", "EVERYDAY USE- Perfect for everyday use - Running, jogging, gymming, walking, sleeping – your music will stay with you, come what may!", "UNIQUE DESIGN- EarWear Gem is forged with a metallic lustre Soft Silicon ear buds fits perfectly in ear", "WARRANTY- 1 year warranty"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51nNaQaK1hL._SL1000_.jpg"]},
{"title": "WOXOT USB Type C to 3.5mm Adapter Headphone Earphone Jack Aux Adapter for Type C Mobile 7/7 Pro / 1+6/1+6T 7T/7T pro 8 7T Pro McLaren Edition etc.", "asin": ["B08CMZ6VZ7"], "rating": "Previous page of related Sponsored Products", "price": "₹ 199.00", "description": ["☑️🎧Features 3.5mm female to type-c male: End to end is a inche long. Convert your 3.5mm headset to type-c headset with this adapter.", "☑️🎧Also supports 3.5mm AUX in the car.Built with the same grade materials as premium headphone brands,", "☑️🎧Small and light and easy to carry. Plug and play.", "☑️🎧Gently insert your headphone/earphone pin completely into the 3.5 mm jack", "☑️🎧1 YEAR WARRANTY"], "image_urls": [null]},
{"title": "pTron BassFest Evo Intunes Magnetic in-Ear Wireless Bluetooth Headphones with Mic - (Grey and Black)", "asin": ["B07S23Z9GF"], "rating": "3.8 out of 5 stars", "price": "₹ 649.00", "description": ["In-ear Wireless Earphones with Stereo Sound, Bass, & Magnetic Earbuds", "In-line remote control allow calls & music control for a hands-free experience", "1 year manufacturer warranty, customer care number: 040-67138888", "Bluetooth 5.0; 10m wireless range; 3-4 Hours Music & Talk-time; 1.5 Hours Charging Time; 80 Hours of Standby-time; Micro USB Charging Cable included", "Ergonomic Flexible Design; Passive Noise Cancellation; 10mm Dynamic Drivers; 70mAh Li-Polymer Battery; Universal Bluetooth Headphones", "Wireless Magnetic Earphones with Mic; Music & Volume Control; Sports Lightweight; Dual Phone Connectivity"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51eWush-p3L._SL1100_.jpg"]},
{"title": "GROFL® Mini K1 Universal Wireless Bluetooth Earpiece with mic, Smart Call Answering Earphone Support All Android Device for Running Workout Gym Truck Driver Noise Cancelling for All Smartphones", "asin": ["B08D58R5CB"], "rating": "Previous page of related Sponsored Products", "price": "₹ 249.00", "description": ["✔️Compatible With All Models And Versions Of The Specified Brand Available In Market Like Mi Redmi, Iphone, Samsung, Vivo, Oppo, Honor, Nokia, Lenovo Etc", "✔️Voice Reminding Function: To Make You Remind About Any Pop Up Notifications Wireless Device,Small And Light, Stealth Design", "✔️Built In Rechargeable Battery,Up To 2-3 Hours Of Talk/Play Time, Bulit For Superior Comfort", "✔️Built-in high-performance Microphone and Speaker, offering you high-quality Stereo sound effect (Perfect Sound Quality and clear communication effect.).", "✔️Integrated Multi-point Technology: Can simultaneously connect two smarts phone. So you can seamlessly switch between your business and personal phones."], "image_urls": [null]},
{"title": "Noise Shots Rush True Bluetooth Wireless Earbuds with Low Latency Gaming Mode & 3 Equaliser Sound Presets (Charcoal Grey)", "asin": ["B0881T571S"], "rating": "3.7 out of 5 stars", "price": "₹ 3,799.00", "description": ["Bluetooth 5.0: The latest Bluetooth standard enables better wireless range and more stable connections on Shots Rush.", "12mm Speaker Drivers: are tuned for punchy, satisfying bass.", "Extended Ear Hooks: on the earbuds for secure fit that that can withstand even the hardest workouts.", "Low Latency Gaming Mode: lets you game with Noise Shots Rush", "3 EQ Modes: Choose from Rock, Pop and Classic EQ modes.", "Full Touch Controls: let your control playtime, adjust volume and manage calls without pressing buttons.", "Offers playback time of up to 6 hours for every charge. Carrying case can give 3 additional charges to the earbuds making total play-time of up to 24 Hours.", "IPX5 Water Resistant: so no amount of rain or sweat can damage your Shots Rush earphones.", "Voice Assistant Support: For Siri & Google Assistant on iOS & Android with just a touch & hold on your Shots Rush earphones.", "For support, Contact_us on: +91 8882132132, Email: help@nexxbase.com or support.gonoise.in"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61mvQucgoNL._SL1500_.jpg"]},
{"title": "Samsung Original Level U Bluetooth Wireless in-Ear Headphones (Black and Sapphire)", "asin": ["B01A31SHF0"], "rating": "3.7 out of 5 stars", "price": "₹ 2,780.00", "description": ["Multi-point access", "Provides active pairing", "Bluetooth Profile: 3.0", "Neckband design", "1 Year Manufacturer warranty from date of purchase"], "image_urls": [null]},
{"title": "Zebronics Zeb-Ease Wired Earphone with in-line Mic", "asin": ["B07ZHLZT8H"], "rating": "3.6 out of 5 stars", "price": "₹ 199.00", "description": ["Unwind to your music with our Zeb-Ease stereo earphone that comes in an in-ear design with a 14 mm driver", "It comes with a flat cable and an L shaped connector", "Impedance 16Ω", "Frequency response 20Hz-20kHz", "Sensitivity 114dB±3dB", "Connector 3.5 mm Jack", "6 months warranty-from the date of purchase", "Customer care-9360942527"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71EM-uw6JzL._SL1500_.jpg"]},
{"title": "Smile Pick Colorful Girls Favourite Spring Protective sleeve USB Mobile Tablet TPU Spiral Cord Protector for iPhone/Android Charger Earphone Cords.3 Pieces(each as 50 cm covers 1.5 M Length Aprox)", "asin": ["B078V8939V"], "rating": "Previous page of related Sponsored Products", "price": "₹ 199.00", "description": ["For More Cable Spiral Models Click on our Store Smile Pick,The Package contains 3 pieces of random colorful wire spiral.its protect charger&earphone cable cord wire", "3 PCs can make up one data cable and 4 to 6 PCs can make up one earphone cord(which is depends on cable or headphone length)", "Let your cord different than others, show your style", "Durable,Colorful and useful cord protector, decorate your life", "Random colors will be shipped,Size is each Piece as 50 cm covers 1.5 M Length approximately"], "image_urls": [null]},
{"title": "BLDM 3.5mm Audio Jack to Headphone Microphone Splitter Connector Converter Adaptor 2 Male 1 Female/Dual Headphone Jack/Multi Headphone Splitter for All Smartphones, Laptop and Tablets", "asin": ["B08DFYN2M9"], "rating": "Previous page of related Sponsored Products", "price": "₹ 149.00", "description": ["Top Quality Product.", "Lightweight, compact and flexible design, easy to use,connect to 3.5mm audio jack for universal earphones or headphones", "3.5mm stereo splitter cable allows you to easily connect your stereo headset Mic to a PC audio port and mic port at the same time", "2 Way 3.5 mm stereo headset hub splitter, connect up to 2 headphones for music sharing"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/41zctDgAIsL._SL1100_.jpg"]},
{"title": "iBall Nano Earwear Ring-Dock B10 - Wireless Bluetooth Earphones with in-Built Mic (Black) in a Charging Pod", "asin": ["B07TWWPYPC"], "rating": "3.3 out of 5 stars", "price": "₹ 1,493.00", "description": ["Bluetooth Wireless In-ear Headset with Mic: Wireless is the way forward", "Charging pod – less dependency on wired chargers", "Ergonomic design for the “fitting” fit", "Go hands-free while conversing – those ones are of the best type", "Multi-point technology for connecting 2 BT devices simultaneously"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51masnfXMEL._SL1000_.jpg"]},
{"title": "Oraima USB External Sound Card 7.1 ChannelAudio Adapter with mic and 3.5mm Microphone Earphone Socket 2.0 Speaker Virtual 3D Support", "asin": ["B08CH19FWM"], "rating": "Previous page of related Sponsored Products", "price": "₹ 220.00", "description": ["Comes bundled with Xear 3D Sound simulation software, and turns your stereo speaker or earphones into a 7.1 channel environment! USB2.0 Full-Speed (12Mbps) Specification USB HID Class Specification 1.1 USB Audio Device Class Specification 1.0. Support Mac OS and Linux", "The USB Virtual 7.1 Channel Sound Adapter is a highly flexible audio interface which can be used either with desktop or notebook systems.", "Plug the sound adapter into your usb port, and then plug your headphones into the adapter", "Connectors: USB Type-A, stereo output jack, Mono microphone input jack", "No driver required for Windows 98SE/ME/2000/XP/Server 2003/Vista/Windows7.Linux,Macos"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51T%2BKFRCElL._SL1100_.jpg"]},
{"title": "GOODFEEL and Strong Waterproof School Back Pack + Latest MI Earphone Compatible for MI 4, MI 5,", "asin": ["B089YVDDGZ"], "rating": "Previous page of related Sponsored Products", "price": "₹ 565.00", "description": ["2 Large compartments and 1 front easy access pocket", "Laptop for use 15.6 inches", "Outer fabric: durable hd coated 100% polyester water resistance fabric", "Laptop compartment, back padding, padded handles, zip closure", "Warranty : 1 year warranty against manufacturing defects"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61v1TCJb%2BjL._SL1469_.jpg"]},
{"title": "CONEKT ACE + Type C Charging Cable for Samsung S8, Type-C, USB Charging Connector Cord 6.6 Feet 2 Meter 6.6 feet for New MacBook Chromebook Pixel Google Nexus 6P 5X Microsoft Lumia 950 XL Lumia 950 OnePlus 2 Nokia N1 Tablet Asus Zenpad S 8.0 Huawei P20 USB Cable (Grey Black)", "asin": ["B07H8HVJDF"], "rating": "Previous page of related Sponsored Products", "price": "₹ 499.00", "description": ["STURDY AND DURABLE: Making the charger cable has more longer working life", "Built-to-last - It's flat tangle free design makes it more resistant to tangles compared to the common round cable", "10x More Durable, 10000 Bend Test Ultra flexibility, 2 meter long cable ensures that you can simply use and carry it anywhere", "FASTER CHARGE: Great performance on charging, Support quick charge, without waiting for long time to charge the phone. Made with high quality, extra thick solid copper wire, which provides fastest charging up to 3.0A and smooth data transmission 2 year warranty", "SUPER COMPATIBILITY: Works with Samsung S8, HTC, LG, OnePlus Two, OnePlus Three,Google, Nexus 5X, Nexus 6P, MI, Oppo, Vivo and more devices"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61k0ySzGtEL._SL1100_.jpg"]},
{"title": "Noise Shots Rush True Bluetooth Wireless Earbuds with Low Latency Gaming Mode & 3 Equaliser Sound Presets (Charcoal Grey)", "asin": ["B0881T571S"], "rating": "3.7 out of 5 stars", "price": "₹ 3,799.00", "description": ["Bluetooth 5.0: The latest Bluetooth standard enables better wireless range and more stable connections on Shots Rush.", "12mm Speaker Drivers: are tuned for punchy, satisfying bass.", "Extended Ear Hooks: on the earbuds for secure fit that that can withstand even the hardest workouts.", "Low Latency Gaming Mode: lets you game with Noise Shots Rush", "3 EQ Modes: Choose from Rock, Pop and Classic EQ modes.", "Full Touch Controls: let your control playtime, adjust volume and manage calls without pressing buttons.", "Offers playback time of up to 6 hours for every charge. Carrying case can give 3 additional charges to the earbuds making total play-time of up to 24 Hours.", "IPX5 Water Resistant: so no amount of rain or sweat can damage your Shots Rush earphones.", "Voice Assistant Support: For Siri & Google Assistant on iOS & Android with just a touch & hold on your Shots Rush earphones.", "For support, Contact_us on: +91 8882132132, Email: help@nexxbase.com or support.gonoise.in"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61mvQucgoNL._SL1500_.jpg"]},
{"title": "Saco mp3 Player Case Pouch for Transcend MP330 8GB USB MP3 Player (Black) Multi-Purpose Pocket Storage Travel Organizer Holder with Keeper Keychain", "asin": ["B077VMXVST"], "rating": "3.0 out of 5 stars", "price": "₹ 231.00", "description": ["Multi-Purpose Pocket Storage Case Is Designed To Keep You Earphones Clean And Safe", "You Can Hold Like Earphone, Pen Drives, and mp3 player", "Hook It Up - Easily With Bags, Belts, And Loops", "Easily Carry To Travel Earphones Bag, Card Bag, Multi-Function Of The Small Box", "Best Quality and Lightweight. High-Quality Material"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81v6exD09sL._SL1500_.jpg"]},
{"title": "Epresent 15.6 inch Laptop Sleeve Bag Case Pouch Reversible Bag for Dell Laptops", "asin": ["B00JWMJVGQ"], "rating": "4.1 out of 5 stars", "price": "₹ 190.00", "description": ["High quality neoprene material to protect the laptop from scratches and dust", "Attractive red and black color", "Safe and attractive packing", "Type: Sleeves and slip cases", "Soft lining for protecting the laptop", "Lightweight structure keep the shape of the bag"], "image_urls": [null]},
{"title": "Gofree Earphone Multi Purpose Semi Rigid Shock Proof Case Cover Pouch (Black)", "asin": ["B01G6L4JJE"], "rating": "4.1 out of 5 stars", "price": "₹ 399.00", "description": ["Spacious and versatile: the inside of the cover is very spacious and can hold any earphone, multiple pen drives, sd memory cards and other small objects easily", "Multi purpose hook: comes with a multipurpose hook which allows the case to be attached to belts, bags, loops or just be easily carried in the hand, this carabiner hook is useful for day to day use", "Shock proof: the exterior of the case is semi rigid and absorbs shocks and does not transfer impact to the contents inside", "Long lasting zipper, perfect fit and finish all this makes the gofree earphone carrying case the best in the market slim and compact: slim and compact design allows you to easily carry the case around"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71g6I9FT%2BKL._SL1500_.jpg"]},
{"title": "TEQNEQ Type C to 3.5 mm Jack Audio Connector, Noise Cancelling Headphones Jack Converter Audio Adapter for OnePlus 8/8 Pro / 1+7/1+7T (Pack of 1) (3.5mm Audio Jack)", "asin": ["B08CB3DS5K"], "rating": "Previous page of related Sponsored Products", "price": "₹ 199.00", "description": ["☑️🎧Features 3.5mm female to type-c male: End to end is a inche long. Convert your 3.5mm headset to type-c headset with this adapter.", "Designed For OnePlus 6,OnePlus 5,5T,3,3T & various Type C Sported Devices", "No software required. Just plug your existing headphones / earphones into the jack", "Support Listening and Speaking and Charging at the Same Time", "Exquisite design: A small line, convenient and easy to carry, can be in your pocket or in your case, occupying almost no space, so you will not have to worry about many lines in your pocket annoying."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51V8x2CHInL._SL1000_.jpg"]},
{"title": "THRUMM Buster Avenger Endgame Captain America +Iron Man Wired in-Ear with Mic Earphone", "asin": ["B078W54QW4"], "rating": "2.6 out of 5 stars", "price": "₹ 400.00", "description": ["Made to fit you and your lifestyle, providing a smooth grip for an extra secure and comfortable fit for your ears", "Wired Earphone with amazing look and sound. Built-in microphone for calling", "Great Microphone for clear conversation, not just music makes this headphone a great choice.", "1 Year Manufactruring Warranty"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/6161nddlGcL._SL1400_.jpg"]},
{"title": "pTron BassFest Evo Intunes Magnetic in-Ear Wireless Bluetooth Headphones with Mic - (Grey and Black)", "asin": ["B07S23Z9GF"], "rating": "3.8 out of 5 stars", "price": "₹ 649.00", "description": ["In-ear Wireless Earphones with Stereo Sound, Bass, & Magnetic Earbuds", "In-line remote control allow calls & music control for a hands-free experience", "1 year manufacturer warranty, customer care number: 040-67138888", "Bluetooth 5.0; 10m wireless range; 3-4 Hours Music & Talk-time; 1.5 Hours Charging Time; 80 Hours of Standby-time; Micro USB Charging Cable included", "Ergonomic Flexible Design; Passive Noise Cancellation; 10mm Dynamic Drivers; 70mAh Li-Polymer Battery; Universal Bluetooth Headphones", "Wireless Magnetic Earphones with Mic; Music & Volume Control; Sports Lightweight; Dual Phone Connectivity"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51eWush-p3L._SL1100_.jpg"]},
{"title": "FINGERS F2.0 USB Computer/Laptop Multimedia 2.0 Speaker", "asin": ["B07YFZNX7G"], "rating": "3.8 out of 5 stars", "price": "₹ 810.00", "description": ["【F2.0 speakers】 Is the perfect companion for your PCs and will look great in every home and office. A sleek space saving design complemented by a rich black piano finish makes this a visual treat.", "【 2 speakers rolled into one】 With the versatile F2.0 speakers - You get two speakers in a single form factor that provides immersive sound at any given volume.", "【 Use either vertically or horizontally】 Place it vertically or horizontally or even mount it as needed.", "【 USB Powered for simple Plug-n-Play setup】 Simply plug it into the USB port of your computer/laptop and enjoy crystal clear room-filling sound instantly.", "【 Crystal Clear Room filling Sound】  Equipped with anti-magnetic design that is magnetically shielded, F2.0 ensures seamless listening experience without any distortion. Means you no longer have to worry about any interference that can be caused by other peripherals connected in a PC setup."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61xZ%2BmO2xSL._SL1200_.jpg"]},
{"title": "Hi-Lite Essentials Gold Plated 2 Male to 1 Female 3.5 mm Headphone Earphone Mic Audio Y Splitter Cable for PC Laptop (Black)", "asin": ["B08D8BH5V6"], "rating": "Previous page of related Sponsored Products", "price": "₹ 250.00", "description": ["Gold Plated", "Compatible with PC Laptop", "Colour: Black"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61ahFz%2Br59L._SL1500_.jpg"]},
{"title": "Baal Spiral Protection Wire for Earphone, Data Cable and Charger Cable", "asin": ["B089STTF6L"], "rating": "Previous page of related Sponsored Products", "price": "₹ 348.00", "description": ["Easy to use on your cables and makes them easily identifiable and completely unique", "MULTIPURPOSE: Protect your wire and cords from dirt, frays, tangles and knots", "Easy to be kept in your pocket, handbag, backpack or carry-on luggage. (compatible To Iphone 5,6,7)", "It will takes you about 20-30 minutes to finish twining round your USB cable and headset line"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71R8iTiWabL._SL1500_.jpg"]},
{"title": "pTron BassFest Evo Intunes Magnetic in-Ear Wireless Bluetooth Headphones with Mic - (Grey and Black)", "asin": ["B07S23Z9GF"], "rating": "3.8 out of 5 stars", "price": "₹ 649.00", "description": ["In-ear Wireless Earphones with Stereo Sound, Bass, & Magnetic Earbuds", "In-line remote control allow calls & music control for a hands-free experience", "1 year manufacturer warranty, customer care number: 040-67138888", "Bluetooth 5.0; 10m wireless range; 3-4 Hours Music & Talk-time; 1.5 Hours Charging Time; 80 Hours of Standby-time; Micro USB Charging Cable included", "Ergonomic Flexible Design; Passive Noise Cancellation; 10mm Dynamic Drivers; 70mAh Li-Polymer Battery; Universal Bluetooth Headphones", "Wireless Magnetic Earphones with Mic; Music & Volume Control; Sports Lightweight; Dual Phone Connectivity"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51eWush-p3L._SL1100_.jpg"]},
{"title": "PTron Solero Type C Cable 2.4A Fast Charging Cable 1.2 Meter Long USB Cable - (Blue)", "asin": ["B07FTJBJZQ"], "rating": "3.9 out of 5 stars", "price": "₹ 249.00", "description": ["Designed to Excel – Our smartphones have become an integral part of our lives lately and we need all means to keep it going without any interruption. So choose your charging cable wisely", "Quality Charging Cable – Durable and stylish, this nylon braided Type-C USB cable has aluminum alloy connector shells. pTron Solero is full nylon braided charging and data transfer USB cable.", "5V/2.4A Fast Charging Speed – Designed to charge your phone 30% faster than ordinary charging cables, the tin-plated wires enable you to charge your smartphone at a steady pace", "Tried and Tested – All our innovations are tried and tested before we carefully pass them on to you. All PTron Solero cables pass through scientific quality tests like 10,000 times USB insert, 10,000+ bend life span, and 24 hours salt spray", "Fast and Stable Data Transfer Speed – This cable will do much more than just your devices. You can use them to sync smartphone using our USB data cable capable of 480mbps speed. Transfer all your data from one device to the other without any hassle", "12 months warranty from the date of purchase by end customer. Contact_us on: [040 - 67138888]"], "image_urls": [null]},
{"title": "CONEKT ACE + Type C Charging Cable for Samsung S8, Type-C, USB Charging Connector Cord 6.6 Feet 2 Meter 6.6 feet for New MacBook Chromebook Pixel Google Nexus 6P 5X Microsoft Lumia 950 XL Lumia 950 OnePlus 2 Nokia N1 Tablet Asus Zenpad S 8.0 Huawei P20 USB Cable (Grey Black)", "asin": ["B07H8HVJDF"], "rating": "Previous page of related Sponsored Products", "price": "₹ 499.00", "description": ["STURDY AND DURABLE: Making the charger cable has more longer working life", "Built-to-last - It's flat tangle free design makes it more resistant to tangles compared to the common round cable", "10x More Durable, 10000 Bend Test Ultra flexibility, 2 meter long cable ensures that you can simply use and carry it anywhere", "FASTER CHARGE: Great performance on charging, Support quick charge, without waiting for long time to charge the phone. Made with high quality, extra thick solid copper wire, which provides fastest charging up to 3.0A and smooth data transmission 2 year warranty", "SUPER COMPATIBILITY: Works with Samsung S8, HTC, LG, OnePlus Two, OnePlus Three,Google, Nexus 5X, Nexus 6P, MI, Oppo, Vivo and more devices"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61k0ySzGtEL._SL1100_.jpg"]},
{"title": "Zebronics Sound Bomb Supporting Bluetooth 5.0 TWS Earphones with Touch Control,Call Function,Voice Assistant & Upto 18hrs Playback time with Portable Charging case(Black)", "asin": ["B081K32P8K"], "rating": "3.0 out of 5 stars", "price": "₹ 1,490.00", "description": ["Superior Design: ZEB-SOUNDMMBOMB wireless earbuds have a premium build and its superior design makes it not only stylish but elegant too .", "Water resistants: Get through the sweat and grime with music as the earphone come with a water resistant feature.", "18Hrs* playback time with portable charging case: Bob your head to the music with upto 18 hrs* of playback time with the portable and compact charging case.", "On the go charging: No hassles of carrying a charger as you can charge on the go with the portable and compact charging case.", "Touch Control: Media controls or voice assistance just do it with a touch sensor on the earphones.", "Deep Bass: Add a punch to your playlist. Get the ultimate bass experience when you listen to your favourite music", "Supports Voice assistance: Ask away all your queries and get instant replies from voice assistant for Android/iOS devices.", "Call function: ZEB-SOUNDBOMB comes with built in mic for you to communicate hands-free", "For feedback & Support, Call us on: 9360942527 or Write to us on: support@zebronics.com"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71ZYAix8g2L._SL1500_.jpg"]},
{"title": "FINGERS F2.0 USB Computer/Laptop Multimedia 2.0 Speaker", "asin": ["B07YFZNX7G"], "rating": "3.8 out of 5 stars", "price": "₹ 810.00", "description": ["【F2.0 speakers】 Is the perfect companion for your PCs and will look great in every home and office. A sleek space saving design complemented by a rich black piano finish makes this a visual treat.", "【 2 speakers rolled into one】 With the versatile F2.0 speakers - You get two speakers in a single form factor that provides immersive sound at any given volume.", "【 Use either vertically or horizontally】 Place it vertically or horizontally or even mount it as needed.", "【 USB Powered for simple Plug-n-Play setup】 Simply plug it into the USB port of your computer/laptop and enjoy crystal clear room-filling sound instantly.", "【 Crystal Clear Room filling Sound】  Equipped with anti-magnetic design that is magnetically shielded, F2.0 ensures seamless listening experience without any distortion. Means you no longer have to worry about any interference that can be caused by other peripherals connected in a PC setup."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61xZ%2BmO2xSL._SL1200_.jpg"]},
{"title": "CLAW G11 Dual Driver Gaming Earphones with Dual Microphone and 3D Stereo Sound for Mobile Phones, Tablets, PC, Laptop, PS4, Xbox, Nintendo Switch (Black)", "asin": ["B0825VQFTK"], "rating": "3.7 out of 5 stars", "price": "₹ 1,329.00", "description": ["[3D Stereo Sound]: The dual 6mm dynamic drivers produce powerful bass and crisp audio giving you an immersive surround sound field so you can hear footsteps, gunshots and other important sounds clearly knowing exactly where your enemy is located at all times.", "[Dual Noise Cancelling Microphone]: The detachable boom mic is 360 degree adjustable to pick up your voice clearly delivering accurate and smooth communication. Simply detach the boom mic to use the in-line microphone when not in gaming mode.", "[Robust and Rugged Cable]: The 1.2 m cable has been constructed with a rugged textured TPE material while the 3.5mm gold-plated plug has a 45 degree angle to increase its durability. Also, included is a 3.5 mm to 2 x 3.5 mm PC adapter.", "[Gamer Approved]: We’ve got local gamers to test the G11 and they approve it as a great choice of earphones for playing games such as PUBG, Call of Duty, Fortnite, CS, FIFA and many more.", "[We’ve got you covered]: The CLAW G11 Gaming Earphones are made with premium quality materials and comes with a 1 year warranty from date of purchase. Kindly register your product on www.myclaw.in"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51U7hwkP82L._SL1000_.jpg"]},
{"title": "BRANDSUN Dual Driver PUBG Gaming Earphones with Dual Microphone and 3D Stereo Sound for All Smartphones with Detachable Dual Noise Cancelling Mic & 3.5 MM Vertical Plug for Computers (Black/Red)", "asin": ["B08D6F8X78"], "rating": "Previous page of related Sponsored Products", "price": "₹ 1,099.00", "description": ["[3D Stereo Sound]: The dual 6mm dynamic drivers produce powerful bass and crisp audio giving you an immersive surround sound field so you can hear footsteps, gunshots and other important sounds clearly knowing exactly where your enemy is located at all times.", "[Dual Noise Cancelling Microphone]: The detachable boom mic is 360 degree adjustable to pick up your voice clearly delivering accurate and smooth communication. Simply detach the boom mic to use the in-line microphone when not in gaming mode.", "[Robust and Rugged Cable]: The 1.2 m cable has been constructed with a rugged textured TPE material while the 3.5mm gold-plated plug has a 45 degree angle to increase its durability. Also, included is a 3.5 mm to 2 x 3.5 mm PC adapter.", "[Gamer Approved]: We’ve got local gamers to test the G11 and they approve it as a great choice of earphones for playing games such as PUBG, Call of Duty, Fortnite, CS, FIFA and many more.", "[We’ve got you covered]: The BRANDSUN G11 Gaming Earphones are made with premium quality materials and comes with a 1 year warranty from date of purchase. Kindly register your product on www.myclaw.in"], "image_urls": [null]},
{"title": "TIZUM Multi Purpose Earphone Carrying Case (Grey)", "asin": ["B076GXN8VX"], "rating": "4.3 out of 5 stars", "price": "₹ 299.00", "description": ["TRIPLE SHOCK PROTECTION - The Ultimate Protection with three layers AntiShock EVA HardShell + Extremely soft velveteen lining protects your headphones against all impacts. Ideal for Travelling, best travel Organizer for your headphones.", "SUPERIOR QUALITY - Your Headphones fit like a glove and will be perfectly protected against typical banging that comes with transporting.", "HOOK IT UP - Easily with Bags, Belts, Loops. This carbine hook is extremely useful for day to day use.", "HIGH QUALITY ZIPPER - High quality material, long lasting rubber zipper, perfect fit and that is unbreakable.", "COMFORTABLE CARRY - It can put a lot of little things, for easily carry to travel headphones bag, card bag, multi-function of the small box. COMFORTABLE CARRY - It can put a lot of little things, for easily carry to travel headphones bag, card bag, multi-function of the small box. Product dimension: 11 x 10.8 x 4 (l x w x h in cm)"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/7175UfygLhL._SL1500_.jpg"]},
{"title": "Mivi ThunderBeats Bluetooth Earphones Wireless with Mic, HD Sound, Powerful Bass, Long Battery Life. Bluetooth Headset with Magnetic Buds and Sweat Proof", "asin": ["B07VNL73FF"], "rating": "3.9 out of 5 stars", "price": "₹ 1,399.00", "description": ["Designed to let nothing get in-between you and your music, experience HD sound with powerful highs and clear lows with the Thunder Beats wireless earphones.", "Work it out: Sweat or shine, this wireless bluetooth earphone pushes you further and handle tough training; The sweat proof earphones lock around your neck when not in use for ease of handling", "Travel ready: The Thunderbeats Bluetooth earphones wireless give 7 hours of battery life for when you are on the go", "Hands-free calling: This wireless earphones with mic features a 3-button inline remote that lets you take calls, adjust volume or skip a track all hands-free with the press of a button", "Seamless connectivity and dual pairing: Latest Bluetooth allows up to a 30 feet range of connection and the ear phones are designed to pair with 2 devices at once", "Metallic Body: Rugged, metallic exterior body of Thunder Beats magnetic buds looks stylish and beautiful and made from premium materials that is sure to withstand most conditions", "For connectivity issue press the MFB button for 5 seconds and release the button when you see LED Blue & Red light. After turning on the Bluetooth on the phone, you will notice Mivi T-Beats. Tap on Mivi T-Beats to connect."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/613kmqxVDJL._SL1500_.jpg"]},
{"title": "Cosmic Byte CB-EP-03 Gaming Earphone with Detachable Microphone for PC, PS4, Mobiles, Tablets (Black)", "asin": [], "rating": "5.0 out of 5 stars", "price": "999.00", "description": ["Dual microphone design, convenient for gaming and communicating", "In-line microphone can be activated by removing the external microphone", "10mm diver unit with clear high, medium & low frequency sound", "Ergonomic, small & exquisite design with soft earbud to ensure comfort while wearing the earphone", "Light weight & portable"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61efts-7iHL._SL1500_.jpg"]},
{"title": "Mobile/Tablet Stand for Table with Bluetooth Earphones Combo, Perfect Combo for Netflix Hotstar Stands for Your Phones/Tablets, Tablet Stand & Bluetooth Earphones for Mobile", "asin": ["B07Z84ZHTS"], "rating": "4.0 out of 5 stars", "price": "₹ 280.00", "description": ["Product 1: Shining silver / Shining black phone stand: Shining silver phone stand, with lightweight and the iPad stand is portable and edgy, it perfectly work with all phones", "Product 2 : Ionix VX-50 bluetooth Eraphones , Compatible with all Android & Apple Smartphones", "Product 1 :- Perfect for watching movies and reading: Cell phone stand perfect for desk or table to watch movies, read, sync charging your phone", "Product 2 : Aluminum alloy sound chamber. Colour based on stock availability. Black, Blue or Gold.", "Package contains : 1 Metal Mobile Stand , 1 Bluetooth earphones (Charging cable & charger are not included)"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61WDNrPq1nL._SL1500_.jpg"]},
{"title": "pTron BassFest Evo Intunes Magnetic in-Ear Wireless Bluetooth Headphones with Mic - (Grey and Black)", "asin": ["B07S23Z9GF"], "rating": "3.8 out of 5 stars", "price": "₹ 649.00", "description": ["In-ear Wireless Earphones with Stereo Sound, Bass, & Magnetic Earbuds", "In-line remote control allow calls & music control for a hands-free experience", "1 year manufacturer warranty, customer care number: 040-67138888", "Bluetooth 5.0; 10m wireless range; 3-4 Hours Music & Talk-time; 1.5 Hours Charging Time; 80 Hours of Standby-time; Micro USB Charging Cable included", "Ergonomic Flexible Design; Passive Noise Cancellation; 10mm Dynamic Drivers; 70mAh Li-Polymer Battery; Universal Bluetooth Headphones", "Wireless Magnetic Earphones with Mic; Music & Volume Control; Sports Lightweight; Dual Phone Connectivity"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51eWush-p3L._SL1100_.jpg"]},
{"title": "Cratly™ Assorted Multipurpose Taco Cable Holder Clips Organizer/Cable Wire Holder/Made of Pure Leather Having Brass Button Made of Leather Set of 2, Size 3x3 (LXB) Inches", "asin": ["B07NNRRP9S"], "rating": "3.0 out of 5 stars", "price": "₹ 299.00", "description": ["Size : 3x3( LXB ) Inches, Color : Assorted ( Any 2 Color PC)", "EASY TO USE: The Cord Keepers are simple to use. Just wrap up your cables, place them in the Dog or Cat’s mouth, and clip it closed with the sturdy, brass metal snaps that resembles its nose. Using only the finest heavy duty metal, these attractive snaps are firm and tight, ensuring no accidental release or flimsiness.", "Purpose : Hold Cable and Cover it. Compact and Classic Design, Fashion and Practical, Soft and Flexible, Convenient to Carry", "FUN CORD MANAGEMENT: Add a touch of fun and style to your messy cables with these easy to use Furry Friends Cord Keepers. Perfect for tidying up your cables on your travels, reducing desk clutter at work, storage in your car or at home. Made with Full Grain Suede Leather and heavy duty, attractive metal, these are fun and stylish ways to keep your cables neat and tidy. Perfect for phone chargers, headphones, your everyday cables.", "MADE WITH HIGH QUALITY FULL GRAIN LEATHER: These Furry Friends Cord Keepers are hand-made using only the best material, 100% full grain leather. Together with heavy duty, attractive, metal snaps, the combination of such quality materials ensures a long lasting, durable yet lightweight home for your cables. Compact enough to fit snugly in your pocket, too."], "image_urls": [null]},
{"title": "iBall Musi Sporty Wireless Sports Headset (Black and Red)", "asin": ["B07BLYPGM8"], "rating": "Previous page", "price": "₹ 1,380.00", "description": ["Angular Ear Buds, designed for the cozy fit", "Dual Tone Flat Cables, minus the tangles", "Supreme Sound Quality with rich acoustic experience on-the-go", "Awe-inspiring design ; Working Time: About 6 hrs, Standby Time: About 150 hours, Battery Charging Time: About 2 hours ; Cord length: 64 cm ; Bluetooth: 4.1V", "Flat Cable - Minus the hassles of Wires and Tangles", "Talk, Listen to music - ALL wireless. It gives maximum of 3 Hrs to 3 Hrs and 15 Mins of backup on Full volume of Music", "Magnetic earbuds to allow for a firm hold for greater ease", "For connecting headset Press and hold power button for 3~4 seconds and you will see Red and Blue light flashing.Search for iBall MusiSporty in your mobile connect to the same Contact us for any issues (186030042255) for any issues related to the product or connection problems"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/516XYvNSx9L._SL1000_.jpg"]},
{"title": "HyperX Cloud HX-HSCEB-RD Earbuds Gaming Headphones with Mic (Red)", "asin": ["B07GW283KL"], "rating": "4.1 out of 5 stars", "price": "₹ 4,490.00", "description": ["Optimized for handheld mode", "Immersive in-game audio", "In-line mic for game chat", "Signature HyperX comfort", "Frequency response: 20Hz–20,000Hz ; Impedance: 65 Ω ; Sound pressure level: 116dBSPL/mW at 1kHz ; Frequency response: 100Hz-6,300 Hz ; Sensitivity: -42dBV (0dB=1V/Pa,1kHz)", "For any product related issues, please contact_us on: [1860-233-4515]"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/6151ZBxilNL._SL1428_.jpg"]},
{"title": "iBall Earwear Night in Ear Wired Earphones with Mic", "asin": ["B07VNR1BMZ"], "rating": "2.5 out of 5 stars", "price": "₹ 349.00", "description": ["Unique angular design for a comfortable fit", "Earcups with a metallic coating – Flaunt it like an accessory", "In-Line push button control with Mic to easily Answer and End calls", "Enjoy crisp and detailed sound quality", "Contact_us on: [ 18002666409 ]"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51PJMZju3NL._SL1000_.jpg"]},
{"title": "Xmate Gusto Lite in-Ear True Wireless Bluetooth Headphones (TWS) - (Black)", "asin": ["B083LY3TGZ"], "rating": "3.3 out of 5 stars", "price": "₹ 1,799.00", "description": ["Binaural Earbuds; Passive Noise Cancelation; 400mAh Magnetic Charging Case; Micro USB Charging Cable included; 180 Hours Standby-time", "Xmate Gusto Lite is an In-ear True Wireless Earbuds with Hi-Fi Sound & Bass", "On-the-earbud multi-function button helps to manage phone calls & music", "Bluetooth v5.0; Ultra-Mini Size; Comfort-fit; 10m Wireless Range; 3 hours music/talk time (Earbuds); Extended Playtime up to 12 Hours using Charging Case; 50mAh Battery in each Earbud; 1.5 Hours Charging Time", "1 year warranty provided by the manufacturer from date of purchase"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61zFcKaSVvL._SL1100_.jpg"]},
{"title": "pTron Bassbuds Lite V2 in-Ear True Wireless Bluetooth Headphones (TWS) with Mic - (Black)", "asin": ["B081QXQVFM"], "rating": "3.6 out of 5 stars", "price": "₹ 999.00", "description": ["In-ear True Wireless Bluetooth Earbuds (TWS) with Stereo Sound & Bass", "On-the earbuds multi-function buttons allow calls & music control for a hands-free experience", "1 year manufacturer warranty, customer care number: 040-67138888", "Bluetooth 5.0; 6 Hours Playback Time (Earbuds) & Extended Playtime up to 20 Hours using Charging Case; 5 Hours of Talk-time; 1.5 Hours Charging Time; 100 Hours of Standby-time", "10m Wireless range; Voice Assistant Support; 400mAh Compact & Portable Charging Case, Micro USB Charging Cable Provided; Up to 2 to 3 Charge Cycles", "Ergonomic and lightweight design fit comfortably and snugly in your ear, provide perfect fit and comfort for all-day wearing with no distractions"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51KM0EyQKNL._SL1100_.jpg"]},
{"title": "Mivi ThunderBeats Bluetooth Earphones Wireless with Mic, HD Sound, Powerful Bass, Long Battery Life. Bluetooth Headset with Magnetic Buds and Sweat Proof", "asin": ["B07VNL73FF"], "rating": "3.9 out of 5 stars", "price": "₹ 1,399.00", "description": ["Designed to let nothing get in-between you and your music, experience HD sound with powerful highs and clear lows with the Thunder Beats wireless earphones.", "Work it out: Sweat or shine, this wireless bluetooth earphone pushes you further and handle tough training; The sweat proof earphones lock around your neck when not in use for ease of handling", "Travel ready: The Thunderbeats Bluetooth earphones wireless give 7 hours of battery life for when you are on the go", "Hands-free calling: This wireless earphones with mic features a 3-button inline remote that lets you take calls, adjust volume or skip a track all hands-free with the press of a button", "Seamless connectivity and dual pairing: Latest Bluetooth allows up to a 30 feet range of connection and the ear phones are designed to pair with 2 devices at once", "Metallic Body: Rugged, metallic exterior body of Thunder Beats magnetic buds looks stylish and beautiful and made from premium materials that is sure to withstand most conditions", "For connectivity issue press the MFB button for 5 seconds and release the button when you see LED Blue & Red light. After turning on the Bluetooth on the phone, you will notice Mivi T-Beats. Tap on Mivi T-Beats to connect."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/613kmqxVDJL._SL1500_.jpg"]},
{"title": "AirCase Earphone Case Pouch Travel Organizer for Earphone, Pen Drives, Memory Card, Data Cable (Red)", "asin": ["B07XZ7YX9M"], "rating": "4.3 out of 5 stars", "price": "₹ 225.00", "description": ["EXCELLENT QUALITY: Remarkably Protective Case is designed for Earphone. Made from Enduring, strong, hard and reinforced Hard Shell this Case is shock proof and water repellent protecting your headphones inside from external shocks, dings & bumps.", "PREMIUM BUILD: This Earphone Case is lightweight and compact to fit in your bag, backpack or luggage and convenient to take anywhere. The inside of the case is made of smooth, lint-free, luxurious mink which is premium & protects the headphone from scratches.", "ERGONOMIC DESIGN: The Case can accommodate most of the Earphone and its tappers on the bottom to comfortably accommodate the headphones.", "COMPATIBLE WITH: Perfect size to fit most models of Earphone and also has a small pocket inside which store all you’re belonging.", "DIMENSIONS: Dimension: 11-cm X 6.5-cm X 4-cm, Weight: 34 Grams. Comes with 1 Year Warranty for all manufacturing defects and workmanship."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71Bi15QKLeL._SL1500_.jpg"]},
{"title": "Cosmic Byte CB-EP-03 Gaming Earphone with Detachable Microphone for PC, PS4, Mobiles, Tablets (Black)", "asin": [], "rating": "5.0 out of 5 stars", "price": "999.00", "description": ["Dual microphone design, convenient for gaming and communicating", "In-line microphone can be activated by removing the external microphone", "10mm diver unit with clear high, medium & low frequency sound", "Ergonomic, small & exquisite design with soft earbud to ensure comfort while wearing the earphone", "Light weight & portable"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61efts-7iHL._SL1500_.jpg"]},
{"title": "Tizum Z13 Earphone Carrying Case for Earphones, Bluetooth Headset, Pen Drives, SD Cards (Black)", "asin": ["B07DLMTX7Z"], "rating": "4.5 out of 5 stars", "price": "₹ 279.00", "description": ["Triple shock protection - the ultimate protection with three layers antishock eva hardshell + extremely soft velveteen lining protects your headphones against all impacts, ideal for travelling, best travel organizer for your headphones", "Superior quality - your headphones fit like a glove and will be perfectly protected against typical banging that comes with transporting", "High quality zipper - high quality material, long lasting rubber zipper, perfect fit and that is unbreakable", "Comfortable carry - it can put a lot of little things, for easily carry to travel headphones bag, card bag, multi-function of the small box"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71HbYK80iKL._SL1500_.jpg"]},
{"title": "iBall Focal in Ear Wired Earphones with Mic (Black)", "asin": ["B07VBNKXRM"], "rating": "3.7 out of 5 stars", "price": "₹ 418.00", "description": ["QUALITY SOUND - Delivers quality sound to a young and connected audience who listens to music on the go A superior crystal-clear sound, rolling out a thumping bass", "BUILT-IN MIC - 3-button remote control with omnidirectional microphone", "ANTI-TANGLE CABLE - The iBall Focal comes with an anti - tangle cable so you can listen to fantastic quality music without having to deal with the mess of tangling wires", "COMPATIBILITY - Universal 35 mm jack is compatible with most of your devices", "WARRANTY - 1 year warranty", "Contact_us on: [ 18002666409 ]"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51jlk3eN%2BtL._SL1000_.jpg"]},
{"title": "Gizga Essentials G11 Earphone Carrying Case for Earphones, Headset, Pen Drives, SD Cards (Blue)(Carry case only)", "asin": ["B07DL53BGQ"], "rating": "4.3 out of 5 stars", "price": "₹ 149.00", "description": ["Superior Quality: Gizga Essentials Earphone Carrying Case (Headphone Case) is spherical in shape with tapered top, Ergonomically the inside to keep a lot more contents one would think is possible. Excellent for Earphones, Pen Drive, Coins, SD Cards, Connectors etc.", "Secure and Durable: When you carry your earphones in your purses and your pockets; when you leave them on your tables they have a tendency of getting entangled, dirty or lost. It guards, carries, stores and protects your earphones from dirt and grime, and keeps them untangled", "Build Strong: Build Strong with Semi-rigid shell covered with 1680d ballistic nylon which makes the case tough and shock resistant and does not transfer impact to the contents inside", "Mesh Compartment: A handy mesh compartment on the inside of the lid to store small accessories and connectors and hold them on to place", "Gizga Essentials Assurance: All Gizga/Gizga-Essentials products come with excellent after sales support and are made with the best materials, excellent workmanship, finish. Building trust since 2010", "Manufacturer Detail: Bhav Technology China Limited Add: Unit-B, 1/F, Mau Lam Comm Bldg.,Mau Lam Street, Jordan,Kowloon,Hong Kong.?"], "image_urls": [null]},
{"title": "Gizga Essentials Earphone Case - Multi Purpose Pocket Storage Travel Organizer Case for Earphone, Pen Drives, Memory Card, Data Cable - Carbon Fibre (Black)", "asin": ["B078XZQM7J"], "rating": "4.2 out of 5 stars", "price": "₹ 175.00", "description": ["Unrivaled styling: - the exterior of the case is made of carbon fiber pu, the styling is just got sophisticated", "Exceptional quality - your headphones fit like a glove and will be perfectly protected against typical banging that comes with transporting", "High quality zipper - high quality material, long lasting rubber zipper, perfect fit and that is unbreakable", "Comfortable carry - it can put a lot of little things, for easily carry to travel headphones bag, card bag, multi-function of the small box", "Hook it up - easily with bags, belts, loops. This carabiner hook is extremely useful for day to day use"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61DSEM0i9kL._SL1500_.jpg"]},
{"title": "pTron Bassbuds Lite V2 in-Ear True Wireless Bluetooth Headphones (TWS) with Mic - (Black)", "asin": ["B081QXQVFM"], "rating": "3.6 out of 5 stars", "price": "₹ 999.00", "description": ["In-ear True Wireless Bluetooth Earbuds (TWS) with Stereo Sound & Bass", "On-the earbuds multi-function buttons allow calls & music control for a hands-free experience", "1 year manufacturer warranty, customer care number: 040-67138888", "Bluetooth 5.0; 6 Hours Playback Time (Earbuds) & Extended Playtime up to 20 Hours using Charging Case; 5 Hours of Talk-time; 1.5 Hours Charging Time; 100 Hours of Standby-time", "10m Wireless range; Voice Assistant Support; 400mAh Compact & Portable Charging Case, Micro USB Charging Cable Provided; Up to 2 to 3 Charge Cycles", "Ergonomic and lightweight design fit comfortably and snugly in your ear, provide perfect fit and comfort for all-day wearing with no distractions"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51KM0EyQKNL._SL1100_.jpg"]},
{"title": "TIZUM Travel Organizer Case for Earphones, Pen Drives, Memory Card, Data Cable (Black)", "asin": ["B076H1HDZM"], "rating": "4.3 out of 5 stars", "price": "₹ 299.00", "description": ["TRIPLE SHOCK PROTECTION - The Ultimate Protection with three layers AntiShock EVA HardShell + Extremely soft velveteen lining protects your headphones against all impacts. Ideal for Travelling, best travel Organizer for your headphones.", "SUPERIOR QUALITY - Your Headphones fit like a glove and will be perfectly protected against typical banging that comes with transporting.", "HOOK IT UP - Easily with Bags, Belts, Loops. This carbine hook is extremely useful for day to day use.", "HIGH QUALITY ZIPPER - High quality material, long lasting rubber zipper, perfect fit and that is unbreakable.", "COMFORTABLE CARRY - It can put a lot of little things, for easily carry to travel headphones bag, card bag, multi-function of the small box. Product dimension: 11 x 10.8 x 4 (l x w x h in cm)"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71J8YBIviGL._SL1500_.jpg"]},
{"title": "Zebronics Zeb-Calyx Wired Earphone with Deep Bass and Call Function (White)", "asin": ["B07X9T2L6L"], "rating": "3.2 out of 5 stars", "price": "₹ 235.00", "description": ["Zeb-Calyx is a Wired Earphone With Stylish design", "It is Lightweight", "It has Strong and long lasting cable", "Impedance 32Ω", "Frequency response 20Hz-20kHz", "Connector 3.5mm Jack", "6 months -from the date of purchase", "Customer Care-9360942527"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71GlipX99IL._SL1500_.jpg"]},
{"title": "Zebronics Zeb-Calyx, Wired Earphone Comes with 10mm Drivers, 3.5mm connectivity, in-line Microphone & 1.2 Meter Strong & Long Lasting Cable(Black)", "asin": ["B07XCX1P4P"], "rating": "2.9 out of 5 stars", "price": "₹ 209.00", "description": ["Stylish design: Listen to music in style with Zeb-Calyx wired earphone that sports a glossy design.", "Light Weight: Loop it, roll it and carry it around in your pocket, wallet or backpack easily with a super lightweight design.", "Mobile/Tablet compatibility: The earphone comes with a 3.5mm jack which is compatibile with most mobile/tablets.", "Deep Bass: enjoy your music with a punch of deep bass.", "Strong & long lasting cable: Long and strong cables that outlast the daily wear and tear.", "In-Line microphone for calls: You don't have to take out your phone for answering your call. The earphone comes with a multi function button & in-line mic that helps you answer your phone call effortlessly.", "For feedback & Support: Call us on: 9360942527 or Write to us on: support@zebronics.com"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71AUNLjgcEL._SL1500_.jpg"]},
{"title": "Xmate Gusto Lite in-Ear True Wireless Bluetooth Headphones (TWS) - (Black)", "asin": ["B083LY3TGZ"], "rating": "3.3 out of 5 stars", "price": "₹ 1,799.00", "description": ["Binaural Earbuds; Passive Noise Cancelation; 400mAh Magnetic Charging Case; Micro USB Charging Cable included; 180 Hours Standby-time", "Xmate Gusto Lite is an In-ear True Wireless Earbuds with Hi-Fi Sound & Bass", "On-the-earbud multi-function button helps to manage phone calls & music", "Bluetooth v5.0; Ultra-Mini Size; Comfort-fit; 10m Wireless Range; 3 hours music/talk time (Earbuds); Extended Playtime up to 12 Hours using Charging Case; 50mAh Battery in each Earbud; 1.5 Hours Charging Time", "1 year warranty provided by the manufacturer from date of purchase"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61zFcKaSVvL._SL1100_.jpg"]},
{"title": "PTron Quinto Bluetooth Speaker 10W Wireless Mini Speaker Portable Bluetooth Dual BT Speaker with Mic (Gold)", "asin": ["B07FT699TP"], "rating": "4.0 out of 5 stars", "price": "₹ 1,149.00", "description": ["The whole body of this retro ptron quinto bluetooth speaker is beautifully finished and made of wood, this portable wireless speaker is a perfect musical companion at home or at work", "Ultra-portable - lightweight yet rugged, it is the best wood speaker for home, dorm room, kitchen, office, small parties, camping, creates a one-of-a-kind portable music experience", "Long lasting lithium battery - built in rechargeable 1200mah lithium battery can be charged by micro usb cable (charging cable included) and it also support charging while playing", "It offer 3-4 hours (at normal volume) of playtime with full battery on a single charge", "12 months warranty from the date of purchase by end customer. Contact_us on: [040 - 67138888]"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51AnOt07JlL._SL1100_.jpg"]},
{"title": "Xmate Gusto Lite in-Ear True Wireless Bluetooth Headphones (TWS) - (Black)", "asin": ["B083LY3TGZ"], "rating": "3.3 out of 5 stars", "price": "₹ 1,799.00", "description": ["Binaural Earbuds; Passive Noise Cancelation; 400mAh Magnetic Charging Case; Micro USB Charging Cable included; 180 Hours Standby-time", "Xmate Gusto Lite is an In-ear True Wireless Earbuds with Hi-Fi Sound & Bass", "On-the-earbud multi-function button helps to manage phone calls & music", "Bluetooth v5.0; Ultra-Mini Size; Comfort-fit; 10m Wireless Range; 3 hours music/talk time (Earbuds); Extended Playtime up to 12 Hours using Charging Case; 50mAh Battery in each Earbud; 1.5 Hours Charging Time", "1 year warranty provided by the manufacturer from date of purchase"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61zFcKaSVvL._SL1100_.jpg"]},
{"title": "FINGERS F2.0 USB Computer/Laptop Multimedia 2.0 Speaker", "asin": ["B07YFZNX7G"], "rating": "3.8 out of 5 stars", "price": "₹ 810.00", "description": ["【F2.0 speakers】 Is the perfect companion for your PCs and will look great in every home and office. A sleek space saving design complemented by a rich black piano finish makes this a visual treat.", "【 2 speakers rolled into one】 With the versatile F2.0 speakers - You get two speakers in a single form factor that provides immersive sound at any given volume.", "【 Use either vertically or horizontally】 Place it vertically or horizontally or even mount it as needed.", "【 USB Powered for simple Plug-n-Play setup】 Simply plug it into the USB port of your computer/laptop and enjoy crystal clear room-filling sound instantly.", "【 Crystal Clear Room filling Sound】  Equipped with anti-magnetic design that is magnetically shielded, F2.0 ensures seamless listening experience without any distortion. Means you no longer have to worry about any interference that can be caused by other peripherals connected in a PC setup."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61xZ%2BmO2xSL._SL1200_.jpg"]}
]