[
{"product_name": "Fire TV Stick streaming media player with Alexa built in, includes all-new Alexa Voice Remote, HD, easy set-up, released 2019", "stores": [{"storeProductId": [], "storeLink": "https://www.amazon.in/Amazon-FireTVStick-Alexa-Voice-Remote-Streaming-Player/dp/B0791YHVMK/ref=sr_1_1?dchild=1&keywords=tv+stick&qid=1597359277&sr=8-1", "storeName": "amazon", "storePrice": "3999"}], "category": "Electronics", "subcategory": "Others", "description": "#1 best-selling streaming media player, with all-new Alexa Voice Remote (2nd Gen, released 2019)., Fire TV Stick is easy to setup and comes pre-registered to your Amazon account so you can just plug it in to your HDTV and enjoy favourite titles., Use the dedicated power, volume and mute buttons to control compatible TVs., Watch favourites from Prime Video, Hotstar, Netflix, Zee5, Sony LIV, Apple TV and others. Subscription fees may apply., The official YouTube app is now available on Fire TV. Mirror your content from phone, tablet or laptop to your TV with the Fire TV stick., The most comprehensive voice experience of any streaming media player. Simply say. \"Alexa, find comedies\", \"Alexa, watch Mirzapur\"\" or \"Alexa, play music videos on YouTube\", Experience tens of thousands of channels, apps, and Alexa skills, plus browse millions of websites using Firefox or Silk., Amazon Prime members get unlimited access to thousands of movies and TV episodes on Prime Video, as well as ad-free listening to millions of songs with Prime Music., Control what your kids view with Parental Control. Get more storage for apps and games than any other streaming media stick. Pair with compatible Bluetooth headphones to listen to movies, TV shows, and music.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61Jfoyb-kjL._SL1000_.jpg"]},
{"product_name": "Fire TV Stick 4K with All-New Alexa Voice Remote | Streaming Media Player", "stores": [{"storeProductId": [], "storeLink": "https://www.amazon.in/Amazon-FireTV-Stick-4K-Alexa-Voice-Remote-Streaming-Player/dp/B079QQZZJK/ref=sr_1_2?dchild=1&keywords=tv+stick&qid=1597359277&sr=8-2", "storeName": "amazon", "storePrice": "5999"}], "category": "Electronics", "subcategory": "Others", "description": "Our most powerful streaming media stick —over 80% more powerful than the best-selling Fire TV Stick., Launch and control content with the next-gen Alexa Voice Remote. Use the dedicated power, volume, and mute buttons to control your TV., Enjoy brilliant picture and immersive sound with access to 4K Ultra HD, Dolby Vision, Dolby Atmos, HDR, HDR-10, HLG, and HDR-10+. Choose from thousands of movies and TV episodes. Enjoy favorites from Prime Video, Hotstar, Netflix, Zee5, Sony LIV, Apple TV and others., The official YouTube app is now available on Fire TV. Use your voice to find, launch and play content on YouTube. Simply say \"Alexa, open YouTube\" or \"Alexa, find movie trailers on YouTube\", Experience thousands of apps, Alexa skills, and millions of websites like Facebook, and Twitter., Do more with Alexa—view live camera feeds, check cricket scores, order food, and stream music., Amazon Prime members get unlimited access to thousands of movies and TV episodes, plus ad-free listening to millions of songs with Amazon Prime Music.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61RfMDdt-iL._SL1000_.jpg"]},
{"product_name": "Brain Freezer Silicone Protector Cover Case Compatible with Amazon Fire Tv Stick/Voice Remote 5. 9inch (1st Gen) Dark Blue (Remote Not Included)", "stores": [{"storeProductId": "B08DM2PYRD", "storeLink": "https://www.amazon.in/Brain-Freezer-Silicone-Protector-Compatible/dp/B08DM2PYRD/ref=sr_1_17?dchild=1&keywords=tv+stick&qid=1597359277&sr=8-17", "storeName": "amazon", "storePrice": "249"}], "category": "Electronics", "subcategory": "Others", "description": "Not includes Fire TV Stick Alexa Voice Remote (only Remote case), Compatible with Alexa Voice Remote (5.9 inch) for Fire TV and Fire TV Stick (1st Gen)., High-Quality & Ergonomic Design, Extreme damage resistance, Environmental material: Durable and soft silicone adds great grip", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61Q0hBiJWTL._SL1500_.jpg"]},
{"product_name": "Marvain WiFi Wireless Display Dongle | DLNA Airplay | Wireless HDMI Mirroring WiFi Dongle Display, TV Dongle Receiver Easy Sharing Wireless Streaming Compatible with Android and iOS.", "stores": [{"storeProductId": "B08DN1ZR94", "storeLink": "https://www.amazon.in/Marvain-Wireless-Mirroring-Streaming-Compatible/dp/B08DN1ZR94/ref=sr_1_12?dchild=1&keywords=tv+stick&qid=1597359277&sr=8-12", "storeName": "amazon", "storePrice": "1099"}], "category": "Electronics", "subcategory": "Others", "description": "An ideal dongle with HDMI output. Now cast pictures, music, videos from your iOS, Android or Windows device to your big screen by using HDMI Dongle, Mirror Function: Project and mirror your smart device without any restrictions. Users can mirror pictures, music, camera, and documents from phones, tablets, laptops, and desktops onto a TV screen or projector., WiFi Display Receiver - WiFi, DLNA, AirPlay and Miracast, Installation: Please follow the instruction provided in the User Manual into the package. Easy handling and configuration - just follow the instructions shown on the start screen on TV, once you connect., Supported Formats: The HDMI Dongle WiFi TV-Stick supports multiple video and audio formats, which include: MP1/MP2/MP3/WMA/OGG/ADPCM-WAV/PCM-WAV/AAC.", "image_urls": [null]},
{"product_name": "5 O'Clock Sports Gym Gloves for Men with Wrist Support Band for Weight Training Gym & Fitness Gloves (Red)", "stores": [{"storeProductId": "B08FCHWRG5", "storeLink": "https://www.amazon.in/OClock-Sports-Support-Training-Fitness/dp/B08FCHWRG5/ref=sr_1_53?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-53", "storeName": "amazon", "storePrice": "199"}], "category": "Electronics", "subcategory": "Others", "description": "", "image_urls": [null]},
{"product_name": "Amazon 5ft USB to Micro-USB Cable for Kindle E-readers", "stores": [{"storeProductId": [], "storeLink": "https://www.amazon.in/Staging-Product-Not-Retail-Sale/dp/B07CJNHY9Z/ref=sr_1_10?dchild=1&keywords=tv+stick&qid=1597359277&sr=8-10", "storeName": "amazon", "storePrice": "499"}], "category": "Electronics", "subcategory": "Others", "description": "Official replacement for the USB cable that comes in-box with Kindle E-readers, 5-ft cable length, Micro-USB to USB heads, For use with all Kindle, Kindle Paperwhite, Kindle Voyage and Kindle Oasis", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61jPjYgSEtL._SL1500_.jpg"]},
{"product_name": "Frittle TR07 116 Smart Fitness Band with Blood Pressure Monitoring | Heart Beat Counter | Step Counter & Many Other Mobile Activity Compatible with All Devices", "stores": [{"storeProductId": "B08CZC6C5Q", "storeLink": "https://www.amazon.in/Frittle-TR07-Pressure-Monitoring-Compatible/dp/B08CZC6C5Q/ref=sr_1_52?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-52", "storeName": "amazon", "storePrice": "359"}], "category": "Electronics", "subcategory": "Others", "description": "Adapt to support mobile for IOS8.0 or above, for Android 4.4 or higher, built-in optical sensor, pay attention to your heart rate changes 24 hours a day, outline your heart rate, present your health and beauty., High-resolution color touch screen]: 1.3TFT touch color screen, high-resolution large color touch screen, sensitive touch keys provide quick and easy operation., Unique design]: USB plug-in charging design, you can plug in the USB or charging head interface directly after removing the wrist strap. It is easy and convenient, plug and play., ip67 Waterproof smart watch]: Effectively protects the device from cold rain and splashes, you can't use it while showering or swimming., Multi-function: Shake the camera, pedometer, calorie counter, distance counter, sleep monitor (sleep time, sleep quality), heart rate monitor, multiple sports modes, and keep an eye on your health.", "image_urls": [null]},
{"product_name": "boka LXCN All Android and iOS Mobile Phones Universal Waterproof Hand Fitness Armband Pouch/Arm Belt/Case for Running Hiking Jogging Sports and Gym Activities, Up to 6.5inch", "stores": [{"storeProductId": "B07VPWQZRJ", "storeLink": "https://www.amazon.in/LXCN%C2%AE-Sports-Armband-Pouch-Belt/dp/B07VPWQZRJ/ref=sr_1_56?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-56", "storeName": "amazon", "storePrice": "285"}], "category": "Electronics", "subcategory": "Others", "description": "【 SPORT DESIGN 】 In order to make sport more freely, we moved the band up that leaving more arm space. There is no obstacle whenever your arm is bent or straight., 【 EXCELLENT COMPATIBILITY 】Two sizes of armbands, fit most cellphones even if with the slim case. Velcro band fits the arm girth from 10” to 16”. Flip pocket and the all-around headphone holes designed to store Android smartphone., 【 QUALITY MATERIAL 】 We adopt 3 layers of high quality Lycra material, This makes it more durable along with with other benefits such as comfort, flexibility, light, thin, breath, sweat absorbing and water resistant., 【 FULL TOUCH HD SCREEN 】 Adopt safe and environmental protection TPU material to achieve barrier-free operation of smartphones, including call, sending messages, browsing web and using App. (Note: Fingerprint unlock is not possible, but you can typ the password to unlock), 【 HIGH QUALITY SERVICE 】 If you have any question or doubt about the product, please feel free to contact us, we will give you the most satisfactory answer.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61%2BFTGcH2mL._SL1000_.jpg"]},
{"product_name": "Whole Body Exerciser THERA - Latex Band Fitness Band Resistance Band (Blue, Pack of 1)", "stores": [{"storeProductId": "B07JJXSNRG", "storeLink": "https://www.amazon.in/Whole-Body-Exerciser-THERA-Resistance/dp/B07JJXSNRG/ref=sr_1_55?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-55", "storeName": "amazon", "storePrice": "280"}], "category": "Electronics", "subcategory": "Others", "description": "Material- latex, Fitness resistance band, Colour- blue and red", "image_urls": [null]},
{"product_name": "Health Sense PD-102 Smart 3D Pedometer Watch (Black)", "stores": [{"storeProductId": [], "storeLink": "https://www.amazon.in/Health-Sense-PD-102-Smart-Pedometer/dp/B00O45B0HO/ref=sr_1_51?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-51", "storeName": "amazon", "storePrice": "1299"}], "category": "Electronics", "subcategory": "Others", "description": "Smart 3D rri-axis technology, Features: counts steps, distance, calories burnt, activity time, speed, goal stopwatch, timer, alarm, 7 days memory, Pedometer might be in off condition when deliverd. press and hold ADJ/EL + reset button together for 3-4 sec to turn on, Option to switch Peodmeter On/OFF , option to shuffle between run/walk, SERVICE & WARRANTY: 1 year HealthSense India offsite service warranty on manufacturing defects to ensure quality customer support. Please contact us for warranty claims", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61OSoy8aQ7L._SL1200_.jpg"]},
{"product_name": "Honor Watch Magic (Lava Black) 9.8mm Thickness & Lightweight Smart Watch, Personal Fitness Mentor, Watch Faces Store, 7 Days Battery Life, GPS,11 Workout Modes, Scientific Sleep & Heart Rate Monitor", "stores": [{"storeProductId": "B07MTKF77H", "storeLink": "https://www.amazon.in/Honor-Watch-Magic-Lava-Black/dp/B07MTKF77H/ref=sr_1_50?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-50", "storeName": "amazon", "storePrice": "7800"}], "category": "Electronics", "subcategory": "Others", "description": "1.2-inch AMOLED colmor screen: multiple watch faces with ALS ambient light monitoring allows automatic screen brightness adjusting, Use Huawei Health App to connect the phone. Connectivity - Bluetooth 4.2, Battery life: lasts up to 1 week on a single charge, Honor Watch Magic comes with 9.8mm thickness and It is backed by 178 mAh battery which can deliver up to 7-day battery life; It is compatible with both Android and iOS devices, 24/7 continuous heart rate monitoring: supports resting, single continuous heart rate and other measuring features, Scientific sleep tracking: automatic sleep recognition and data statistics (validated by the CDB center at harvard medical school), 5ATM water-resistance;For any queries please contact_us on: [1800-209-6555], High precision tracking: supports US-GPS, Russia-GLONASS, Europe-GALILEO satellite to provide accurate and precise location information, Various exercise types: supports exercise statistics on various types of exercises, including outdoor and indoor run, outdoor walk, outdoor and indoor cycling, mountain climbing, pool swim stoke recognition etc, Notification reminders: supports caller ID, SMS, e-mail, calendar, social app notification, Fitness interactions: tracks, monitors and identifies types of daily activities, provides step, calories, activity intensity, activity time and standing statistics; firstbeat professional running guidance; create and manage groups, initiate friendly competitions, view daily activity rankings and friendly competition rankings and more, Other cool features: find my phone, displays time, altitude barometer, compass, weather, stopwatch, timer, flashlight alarm clock, For more Product Information or Support Kindly contact our Hotline Number- 1800-210-9999, Country of Origin: China", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81wWxtlyb6L._SL1500_.jpg"]},
{"product_name": "Meya Happy M4 C01Plus India's No.1 Smart Fitness Band Smart Watch Under 500, 120 Hours Battery Life, Color Touch Screen, Water Resistant Body with 25+ Use Functions", "stores": [{"storeProductId": "B08CDY93KR", "storeLink": "https://www.amazon.in/Meya-Happy-C01Plus-Resistant-Functions/dp/B08CDY93KR/ref=sr_1_49?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-49", "storeName": "amazon", "storePrice": "595"}], "category": "Electronics", "subcategory": "Others", "description": "֎ 𝐇𝐨𝐰 𝐎𝐮𝐫 𝐏𝐫𝐨𝐝𝐮𝐜𝐭 𝐢𝐬 𝐃𝐢𝐟𝐟𝐞𝐫𝐞𝐧𝐭 𝐅𝐫𝐨𝐦 𝐎𝐭𝐡𝐞𝐫 𝐒𝐞𝐥𝐥𝐞𝐫𝐬 -This Unisex Smart Fitness Band For Men / Women Delivers 100% Accurate Heart Rate Readings ( Other Low Price Models Have Incorrect Readings ) , 90 MaH Battery ( Most other models have 60 Mah Battery ), 4 Days Stand By Time ( Most other models have 1-2 Days ) , 4 Themes ( Most Others Have 2-3 Themes ). Best Smart Watch Under 500, ֎ 𝐒𝐭𝐚𝐲 𝐢𝐧 𝐓𝐨𝐮𝐜𝐡 𝐖𝐢𝐭𝐡 𝐘𝐨𝐮𝐫 𝐇𝐞𝐚𝐥𝐭𝐡 𝐀𝐥𝐥 𝐭𝐡𝐞 𝐓𝐢𝐦𝐞 - Live Heart Rate Monitor, Blood Pressure Monitor ( Non Medical Use ), Blood Oxygen Monitor, Steps Counter, Calories Counter , Distance Measure , Stopwatch, Sleep quality measurement,, ֎ 𝐌𝐚𝐧𝐲 𝐅𝐮𝐧𝐜𝐭𝐢𝐨𝐧𝐬 𝐚𝐭 𝐲𝐨𝐮𝐫 𝐖𝐫𝐢𝐬𝐭 𝐚𝐧𝐝 𝐅𝐢𝐧𝐠𝐞𝐫 𝐓𝐢𝐩𝐬 - This M4 Smart Fitness Band Watch Has Even More Functions like Calls/text reminder: It will vibrate to alert you if your phone receives a phone call, Message, Alarm clock, Message calls notifications, Remote camera control, Anti-lost, Find the phone App , Social Platform Support : Facebook, Whatsapp, Linkedin, Instagram, and Twitter Notifications on Display. Best Low Price Smart Watch for Boys and Girls, ֎ 𝐂𝐡𝐚𝐧𝐠𝐞 𝐃𝐢𝐬𝐩𝐥𝐚𝐲 𝐒𝐭𝐲𝐥𝐞 𝐀𝐬 𝐏𝐞𝐫 𝐘𝐨𝐮𝐫 𝐌𝐨𝐨𝐝 - This M4 Smart Watch Has High Resolution Dust Resistant Hd LCD Touch Screen, This M4 Has Four Different Display Themes to Choose From Polymer Lithium Battery, Standby Time up to 3 - 4 Days After 1.5 Hours Fully Charged, ֎ 𝟏𝟎𝟎% 𝐐𝐮𝐚𝐥𝐢𝐭𝐲 𝐂𝐡𝐞𝐜𝐤𝐞𝐝 / 𝐎𝐤 𝐓𝐞𝐬𝐭𝐞𝐝, 𝐆𝐫𝐞𝐚𝐭 𝐐𝐮𝐚𝐥𝐢𝐭𝐲 𝐏𝐫𝐨𝐝𝐮𝐜𝐭 𝐟𝐫𝐨𝐦 Meya Happy 𝐁𝐫𝐚𝐧𝐝.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/5165N4RfG-L._SL1001_.jpg"]},
{"product_name": "WellWell Activity Tracker, Bluetooth - Black", "stores": [{"storeProductId": "B07S22Q47B", "storeLink": "https://www.amazon.in/Fitness-Calorie-Pressure-Activity-Trackers/dp/B07S22Q47B/ref=sr_1_59_sspa?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-59-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzR082QVpPU05SOEtOJmVuY3J5cHRlZElkPUEwNDk5NDg2MUZTSE83VUZVSkhVQSZlbmNyeXB0ZWRBZElkPUEwODY2OTk5Mk5ZMVRSUlA2RElYUiZ3aWRnZXROYW1lPXNwX2J0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU=", "storeName": "amazon", "storePrice": "694"}], "category": "Electronics", "subcategory": "Others", "description": "Excellent Fitness Band M3+ Soft skin-friendly material, comfortable to wear Drip-like one black screen design, fantastic streamline Lift Wrist to View Instant Message or Real-time Sports Data, Wide compatibility, Find Phone, Alarm Clock, Water Clock, Sedentary Alert to make your life more Convenient and Smart. Long Standby Time Compatibility: All Android smart phones with Bluetooth 4.0 and Android 4.4 or above system & iOS 7.0 and above system., Activity data is visible in real time, Whether you are running, riding, walking, you can always know your heart rate, speed, etc; Heart rate sensor accurately reads 24-hour heart rate changes., Large OLED Colored Touch Screen, Instant Notifications, Incredible Battery Life, Daily Step Count and Heart Rate Monitoring, Monitor Sleep Quality, Real-Time Activity Tracking, Secure Design, Weather Forecast, Events and Alarms, Goal Reminders, Idle Alert, Convenient Password-Free Unlock, The All-New Fitness Band, Soft, Skin-Friendly Strap, 30 Features Rolled Into One., More Accurate Fitness Tracker: More accurate in recording your activity levels, Heart Rate Monitoring, Sleep Monitoring, Pedometer, Distance, Pace, Calories Burned, Sleep Status, Active Minutes, Weather Forecast, Sedentary Reminder etc", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51oPm9zkB9L._SL1001_.jpg"]},
{"product_name": "Muzili Smart Fitness Band IPX7 Waterproof Fitness Tracker Watch with Heart Rate Sleep Monitor 14 Exercise Modes Activity Band GPS Route Tracking USB Quick Charge for Men Women", "stores": [{"storeProductId": "B07L1KHTWQ", "storeLink": "https://www.amazon.in/Muzili-Waterproof-Exercise-Activity-Tracking/dp/B07L1KHTWQ/ref=sr_1_60_sspa?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-60-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzR082QVpPU05SOEtOJmVuY3J5cHRlZElkPUEwNDk5NDg2MUZTSE83VUZVSkhVQSZlbmNyeXB0ZWRBZElkPUEwMzMwODg5MjU1SEY3MjFYVUozVCZ3aWRnZXROYW1lPXNwX2J0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU=", "storeName": "amazon", "storePrice": "1399"}], "category": "Electronics", "subcategory": "Others", "description": "♥ Heart Rate Monitoring & 14 Sports Mode: The fitness band will automatically tracks your real-time heart rate, sleep quality, 14 sports mode like mountaineering, badminton, fitness, dynamic cycling, treadmill, yoga, basketball, football, tennis, dancing, running, workout, hiking, and etc. and a map of your workout route; reminders you to move after long time of inactivity., ♥ Sleep Monitoring & 10 Alarm Clock: Muzili fitness tracker automatically tracks your sleep and analyze your sleep quality with light sleep, deep sleep and awake time. The humanized silent vibration alarm can wake you up without disturbing others. 10 alarms can be set at one time., ♥ Everyday Activity Tracking & GPS Connected: The smart band can tracks your everyday achievements such as your steps, calories burned, distance and more, helping you stay motivated and maintain a healthy lifestyle. And a map of your workout route, reminders you to move after long time of inactivity., ♥ Call & Message Notification: Connect the smart watch to the \"VeryFitPro\" app on your phone via Bluetooth, then the tracker will vibrate and display relevant information when calls and messages come in. You can see incoming calls or messages when you lift your wrist., ♥ More Other Functions: Screen is automatically lightened up when you turn your wrist towards you, built-in USB plug enables easy charging without charging cable, remote camera shooting, anti-lost and find phone.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71uiD2zckOL._SL1200_.jpg"]},
{"product_name": "Bilton Smartwatch Men & Women's Watch (Black Dial Black Colored Strap)", "stores": [{"storeProductId": "B0837X614N", "storeLink": "https://www.amazon.in/Bilton-Wristwatch-Waterproof-Smartwatch-TB-001/dp/B0837X614N/ref=sr_1_57_sspa?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-57-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzR082QVpPU05SOEtOJmVuY3J5cHRlZElkPUEwNDk5NDg2MUZTSE83VUZVSkhVQSZlbmNyeXB0ZWRBZElkPUEwMzkwNzU1MlRLTTY5UzMyVjlQRiZ3aWRnZXROYW1lPXNwX2J0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU=", "storeName": "amazon", "storePrice": "1449"}], "category": "Electronics", "subcategory": "Others", "description": "Dial Color: Black; Dial Material: Mineral, Dial Shape: Round; Strap Color: Black, Watch Movement Type: Automatic, Model: TB-001", "image_urls": [null]},
{"product_name": "Aerizo Drumstone M3 Smart Wristband Fitness Tracker Watch with Multi-Function Long Standby Time for All Smartphones (Assorted Colour)", "stores": [{"storeProductId": "B07KKBHKN7", "storeLink": "https://www.amazon.in/Aerizo-Drumstone-Wristband-Multi-Function-Smartphones/dp/B07KKBHKN7/ref=sr_1_58_sspa?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-58-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzR082QVpPU05SOEtOJmVuY3J5cHRlZElkPUEwNDk5NDg2MUZTSE83VUZVSkhVQSZlbmNyeXB0ZWRBZElkPUEwNDc3MTgwM1ZSTEJNMThKMFNRUyZ3aWRnZXROYW1lPXNwX2J0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU=", "storeName": "amazon", "storePrice": "259"}], "category": "Electronics", "subcategory": "Others", "description": "Water proof Smart fitness Band with Bluetooth or Heart Rate sensor, Activity Records, Sleep Monitor, Calore Burned, Rejected Calling, Alarm, Blood Pressure, Message, Calling function which enables you receive a call and disconnect it, you can also send and receive messages, Display Screen is a 0.78-inch, OLED panel with a resolution of 128x80P, which considering the size of this display and what you'll need from a fitness tracker should look great on your wrist, Long Battery Standby, Perfect for outdoor sports, travel, business", "image_urls": [null]},
{"product_name": "HUG PUPPY M4 Smart Fitness Tracker Waterproof Body Functions Like Steps Counter,", "stores": [{"storeProductId": [], "storeLink": "https://www.amazon.in/M4-Activity-Waterproof-Functions-Touchscreen/dp/B085NR2RRX/ref=sr_1_46?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-46", "storeName": "amazon", "storePrice": "489.00499"}], "category": "Electronics", "subcategory": "Others", "description": "It has features such as calling function which enables you receive a call and disconnect it, you can also send and receive messages through it but only supported to Android Phones for which you need to download app, Waterproof Smart fitness Band with Bluetooth or Heart Rate sensor, Activity Records, Sleep Monitor, Calorie Burned, Rejected Calling, Alarm, Blood Pressure, Message, USB Charging Supports smartphones, Tablets and PC's and also support Android and IOS, Compatibility: Requires Android 4.3 or above, iOS 7.1 or above, Bluetooth 4.0 or above, download APP \"Veryfit 2.0\" from iOS Store or Google Play, Battery Capacity: 70 mAh , Water proof Smart fitness Band with Bluetooth or Heart Rate sensor, Activity Records, Sleep Monitor, Calorie Burned, Rejected Calling, Alarm, Blood Pressure, Message, USB Charging Supports smartphones, Tablets and PC's and also support Android and IOS", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61X-Pq73TAL._SL1500_.jpg"]},
{"product_name": "HUAWEI Watch GT 2 Sport (Matte Black, 46mm, 2 Weeks Battery, Music Playback, Answer Calls (with Phone Connection), 5ATM Water Resistant, Heartrate Monitor, Accurate GPS,SpO2, Kirin A1, AMOLED)", "stores": [{"storeProductId": "B08158JDFK", "storeLink": "https://www.amazon.in/Huawei-Watch-Sport-Matte-Latona-B19S/dp/B08158JDFK/ref=sr_1_47?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-47", "storeName": "amazon", "storePrice": "14990"}], "category": "Electronics", "subcategory": "Others", "description": "1.39-inch AMOLED color screen, Super long battery life, lasts for up to 2 weeks on a single charge, Connectivity - Bluetooth 5.1. Compatible with Android 4.4 or later and iOS 9.0 or later, Continuous heart rate monitoring, supports resting heart rate, single heart rate, continuous heart rate, and other measuring features, Firstbeat professional running guidance, Water-resistance for shallow waters, including swimming pools or beachfront swimming, Supports GPS and GLONASS satellite positioning, Tracks, monitors, and identifies types of daily activities, and provides step, calories, and moderate and high intensity activity duration, Supports HUAWEI TruSleepTM, and automatic sleep recognition and data statistics, Notification reminders, including caller ID, SMS, email, calendar, social app notification, Find My Phone. Is able to detect whether it is being worn. If not, the watch automatically enters Power saving mode and will not display incoming calls or messages, Country of Origin: China", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61rmsUV7h%2BL._SL1000_.jpg"]},
{"product_name": "GOCART WITH G LOGO Stretch Loops for Unisex for Fitness Workout, Gymming, Stretching, Glutes, Strength Training, Yoga Mans & Woman Set of 4 Different Loops", "stores": [{"storeProductId": "B08CK6M8D7", "storeLink": "https://www.amazon.in/GOCART-LOGO-Stretching-Strength-Different/dp/B08CK6M8D7/ref=sr_1_44?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-44", "storeName": "amazon", "storePrice": "499"}], "category": "Electronics", "subcategory": "Others", "description": "Safe and Durable: premium quality natural latex material, Non-toxic and skin-friendly to the human body,the resistance bands offer a smooth and bright appearance and provide superior durability., Versatile Usage: Resistance Loop Bands for increasing mobility, strength and ideally suited to CrossFit, Yoga and Pilates. Use of resistance bands can help to strengthen stabilizing muscles which may help to prevent injury. It can help glutes and legs and arms exercises- Increasing body strength., Environmentally: the production of pure natural latex products, more safety, health, environmental protection, durable.Higt quality. All of our exercise resistance bands are thoroughly tested before we ship them out to you, Gym-in-your-pocket: The exercise bands take up little space so that you can use them at home or carry on the way, such as in office, on a vacation, even can squats while watching TV at home., Multiple uses. These resistance bands are often used for sports and fitness, physical therapists love these physical therapy bands to help them rehabilitate their patients. Our stretch bands work for people suffering from leg, knee and back injuries.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51HlGhDZMeL._SL1000_.jpg"]},
{"product_name": "Sketchfab Band Smart Fitness Band Activity Tracker with OLED Display Compatible with Android and iOS Devices.", "stores": [{"storeProductId": "B0848S3F92", "storeLink": "https://www.amazon.in/Sketchfab-Band-Smart-Activity-Compatible/dp/B0848S3F92/ref=sr_1_42?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-42", "storeName": "amazon", "storePrice": "499"}], "category": "Electronics", "subcategory": "Others", "description": "Real-Time Activity Tracking :-Band allows you to monitor your activity like running, biking or walking in real time. You can check your exercise duration, pace, heart rate and speed on the go., Instant Notifications? :- Now view incoming call and app notifications at a glance. You can also reject calls directly from the M4 Band. It also displays SMS, WhatsApp, Instagram and other messages., Monitor Sleep Quality? :-Accurately records information about your sleep quality every night, including data on deep and light sleep so that you can adjust your sleeping habits accordingly., Large OLED Touch Screen :-Band comes with a larger and clearer 0.78 inch OLED touch screen allowing you to do and view more., Blood Pressure & Heart Rate & Blood Oxygen Measurement & Sleep Monitoring: Tracks real-time heart rate automatically & continuously and automatically tracks your sleep duration & consistency with comprehensive analysis of sleep quality data, high-performance CPU to monitor blood pressure & blood oxygen", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61qx%2BhjdBPL._SL1100_.jpg"]},
{"product_name": "[2020 Upgrated] Arbily Smart Watch Fitness Band IPX67 Waterproof Sport Bracelet Touchscreen Fitness Tracker with Heart Rate Monitor for Men and Women (Blue+Black)", "stores": [{"storeProductId": "B08CH73RWN", "storeLink": "https://www.amazon.in/Upgrated-Arbily-Waterproof-Bracelet-Touchscreen/dp/B08CH73RWN/ref=sr_1_43?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-43", "storeName": "amazon", "storePrice": "1299"}], "category": "Electronics", "subcategory": "Others", "description": "【24Hrs Heart Rate Monitor with OLED Display】Arbily fitness band come with heart rate monitor will provide you with a continuous, precise and automatic heart rate tracking around the clock. By recording and analyzing the heart rate data, your personal healthy assistant helps you to make a suitable and reliable plan for your healthy life. Do exercise in a scientific way. Keep track of your heart rate on the 0.87 OLED screen with great joy., 【Sleep Tracker with Your Personal Alarm】Sleep fitness band and monitor will automatically record the sleep time and monitor the whole sleep progress by analyzing the deep sleep and light sleep hours to develop a better sleep habit. The alarm clock is the silent type, that gently vibrates your wrist to annoy you into consciousness with no need to wake your family., 【Daily Activity Tracker & Remote Control Camera】This activity tracker tracks the steps, distance traveled, calories burned for you every day. Do sports as you like, hug the healthier life. Various sport modes are waiting for you. Turn the camera shoot on in the app, it will be easy to control your phone camera by raising your hand or tapping the screen. Record the smiles of you and your loved ones moment by moment., 【SMS/Calls/Social Media/Sedentary Reminders】SMS notifications, incoming calls, WhatsApp notifications, Facebook, Twitter, Instagram and other social media notifications are all on your wrist. The activity tracker also notifies you if you’ve sat still for too long, encouraging you to get up and increase that step count! Remind you to have a sound lifestyle., 【Wider Compatibility&Longer Battery Life】 The activity tracker is widely compatible with iOS 7.0 and above, Android 4.4 and above and Bluetooth 4.0 and above with stable connection. Charge once for approximately 10-day-long using. We will also provide you with one free strap to change the look of the fitness band. You can choose the suitable one as you are in the different moods. Also one-year warranty will be provided for you. If you have any question, please feel free to contact us.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61shTTMhgWL._SL1500_.jpg"]},
{"product_name": "Sprinto GKM12 ID115 Bluetooth Smart Fitness Band Watch for Men/Women with Heart Rate ActivityTracker Waterproof Body | Steps and Calorie Counter, Blood Pressure, Distance Measure, OLED Touch Screen", "stores": [{"storeProductId": "B08DF4PDCG", "storeLink": "https://www.amazon.in/Sprinto-GKM12-Bluetooth-ActivityTracker-Waterproof/dp/B08DF4PDCG/ref=sr_1_40?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-40", "storeName": "amazon", "storePrice": "399"}], "category": "Electronics", "subcategory": "Others", "description": "DAILY ACTIVITY and 14 SPORTS fitness tracker tracks your daily stats: steps, distance, active minutes and calories burned; tracks workouts with 14 exercise modes and use your smartphone GPS to see real-time pace and distance, REAL TIME HEART RATE heart rate monitor adopts the latest HR sensor for accurate heart rate monitoring continuously and automatically. You can see your heart rate stats and adjust your lifestyle for better heart health, SLEEP fitness tracker automatically tracks your sleep and analyze your sleep quality with light sleep, deep sleep and awake time. The humanized silent vibration alarm can wake you up without disturbing others, CORDLESS CHARGING and CALL/MESSAGE NOTIFICATIONS Connect the activity tracker to your smartphone via \"VeryFitPro\" app and receive call and message notifications; Built-in USB plug, no charging cable is needed for activity trackers", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51shT2IHAnL._SL1050_.jpg"]},
{"product_name": "HolyHigh 115U HR Smart Fitness Band, Waterproof Fitness Tracker Watch for Men Women Kids Step Counter Claroie Counter Messages Call Alarm Reminder Cameral Shoot", "stores": [{"storeProductId": "B07FNQMG88", "storeLink": "https://www.amazon.in/HolyHigh-Fitness-Tracker-Digital-Unisex/dp/B07FNQMG88/ref=sr_1_41?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-41", "storeName": "amazon", "storePrice": "1199"}], "category": "Electronics", "subcategory": "Others", "description": "【Up to 7 Days Working Time】 This smart watchband supports 7 + days working after single fully charge 1-2Hours.All HolyHigh sports tracker are built-in USB dongle, please remove off the tracker both sides strap and plugin the usb dongle in your laptop or power bank USB port for charging 15minutes as soon as you received the item. Note:please first read the user guide before you charge it, 【 Smart Activities Tracker 】 This fitness Tracker will track your daily activities like steps, cycling, running, distance, calories burned and miles walked, activity minutes and more ; can work as a step counter and calories counter even if the tracker watch does connect with your mobile. Set a silent alarm and your tracker will wake you with a quiet vibration, 【Call/Messages Reminder】Getting phone calls, social app messages notifications on this activity tracker screen via Bluetooth ( suits for all ios and androids mobiles). Plus, this smart watch band is with alarm clock, sedentary reminder, remote control camera anti lost functions and gesture control functions.Note:these functions can be worked when the tracker band is connected with your smart phone by Bluetooth in the veryfitpro APP, 【Sleep Monitor 】 This fitness band can automatically record your sleep duration and consistency with comprehensive analysis of sleep quality data: including light sleep and deep sleep. Plus,this smart fitness band can wake you up peacefully with a silent vibrate alarm.(Note: you need to check the sleep data and turn on the vibrate alarm function in the app), 【 Wide Compatibility & after sale help】All ios 7.1 & above/Android 4.4 & above and Bluetooth 4.0 & above mobiles can work with this fitness watches. Note: it can only work with smartphones not conected with latop or tablets.If you need any product support,get help on amazon messages,we will help you within 24 hours.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71oXSn%2BT8IL._SL1500_.jpg"]},
{"product_name": "SKORIL Smart Band Fitness Tracker Watch Heart Rate with Activity Tracker Waterproof Body Functions Like Steps Counter, Calorie Counter, Blood Pressure, Heart Rate Monitor LED Touchscreen - Black", "stores": [{"storeProductId": "B0846JH5J3", "storeLink": "https://www.amazon.in/SKORIL-Activity-Waterproof-Functions-Touchscreen/dp/B0846JH5J3/ref=sr_1_39?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-39", "storeName": "amazon", "storePrice": "420"}], "category": "Electronics", "subcategory": "Others", "description": "Waterproof and durable, LED Touchscreen, Colour - Black", "image_urls": [null]},
{"product_name": "KTCOO M4 Smart Band Fitness Tracker Smart Watch for Mens Women Boys Girls Compatible with Android & iOS", "stores": [{"storeProductId": "B08F3TGHP6", "storeLink": "https://www.amazon.in/KTCOO-M4-Fitness-Tracker-Compatible/dp/B08F3TGHP6/ref=sr_1_38?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-38", "storeName": "amazon", "storePrice": "399"}], "category": "Electronics", "subcategory": "Others", "description": "0.96in color screen AMOLED display, clear to see even under sunlight, monitor your sports informations at all times, IP67 waterproof, you can wash hands when you wear it or wear in the rain, but it's better not wear it to swim., High sensitive touched screen, can achieve various operations, information content, step, calories, distance, weather, heart rate and other functions to quickly view, thus opening intelligent life., Automatically record the number of step, burn calories., Made of thermoplastic elastomer, it is more comfortable to wear, double-breasted design, let you exercise without falling off., Recording hearrt rate is nice for knowing your health and exercise status, using reflection. Photoelectric signal detection principle records your heart rate, 24h continuous detection your heart rate., You can choose the exercise program that suits your life rhythm, Nothing is more than sweating after exercise. Sweating can relax yourself, stick to exercise, and make yourself a nicer self. The bracelet automatically detects your sleep and generates a sleep report. With IP67 waterproof performance, rain, water environments completely fearless, let you enjoy the fun of life. When you forget the time, the bracelet will vibrate gently, remid you to get up and wake up.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51%2BaN9lSd2L._SL1000_.jpg"]},
{"product_name": "Universal Running Armband, Arm Cell Phone Holder Sports Armband for Running, Fitness and Gym Workouts, Compatible with iPhone X/8/7/6/Plus, Samsung Galaxy S9/S8/S7/S6/Edge/Plus & LG, Black", "stores": [{"storeProductId": "B081LMLSVF", "storeLink": "https://www.amazon.in/Universal-Running-Armband-Workouts-Compatible/dp/B081LMLSVF/ref=sr_1_36?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-36", "storeName": "amazon", "storePrice": "285"}], "category": "Electronics", "subcategory": "Others", "description": "1.【Fit for ALL Below 6” Cellphone】 The running arm phone holder fit iPhone 7 plus/7(5.5\")/6/6s (4.7\"), iPhone 5/5s/5c, Samsung s8 s7 s6 s5 s4, s3, s2, Moto,Google, Oneplus, ZTX and any phone with a screen up to 6 inches cellphone for our running., 2.【Perfect for All Activities】 The running armband case can be a gift for men or women, if he or she like exercise, when they in gym, high intensity workouts, extreme exercise, fitness, yoga, casual walking, running, cycling, hiking, fishing, cross training, mountaineering, camping, travelling, daily leisure, etc, 3.【Dual Pockets & Dual Zipper Heads】Dual pockets and zipper heads designed for closure safer and storage spaces larger for our cellphone, earphones,cable, charger, keys, ID cards,cash, and other accessories, prevent scratch for us phone., 4.【Environmental Material More Comfortable】Highly quality breathable fiber environmental spandex material easier absorbing sweat and comfortable for wearing, prevent for cellphone slip. The Velcro fastening is adjustable, base on your body shape, between with 9.5”-14”, 5.【Earphone Port Design】Special earphone port designed for our enjoying the music conveniently, provide more pleasure during your running. We will offer guarantee within 30days, If you have any question, please contact with us in your first time,we will help you soon.", "image_urls": [null]},
{"product_name": "FEGSY Resistance Tube Exercise Bands for Stretching, Workout, and Toning for Men, and Women (Multicolor)", "stores": [{"storeProductId": "B07PM7R877", "storeLink": "https://www.amazon.in/FEGSY-Resistance-Exercise-Stretching-Multicolor/dp/B07PM7R877/ref=sr_1_37?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-37", "storeName": "amazon", "storePrice": "599"}], "category": "Electronics", "subcategory": "Others", "description": "PERFECT FOR BUILDING MUSCLE: They are perfect for Muscle Building, Fat Burning, Weight Loss, Cross Fitness Training, Pilates, Yoga and Improving Fitness Levels, VERSATILE: The resistance tubes offer a surprisingly varied number of training exercises by simply changing your body position in order to change the tension on your muscles., QUALITY MATERIAL: The exercise resistance ropes are made from 100% free of Latex,highest quality rubber and TPR Foam for maximum strength and resistance., TRAIN WITH COMFORT: They have soft foam D-handles, pre-attached, for continued comfort during repetitive movements. Cushioned foam handles provide comfortable and slip-free grip., RESISTANCE: Resistance: 15 to 30 LBS (Only for Beginners) They are lightweight, easy to carry and great for home, gym and travel.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71ITrhLxoXL._SL1500_.jpg"]},
{"product_name": "Mi Band 3 (Black) + Additional Strap (Red)", "stores": [{"storeProductId": "B08BL6QTXZ", "storeLink": "https://www.amazon.in/Mi-Band-Black-Additional-Strap/dp/B08BL6QTXZ/ref=sr_1_32?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-32", "storeName": "amazon", "storePrice": "1698"}], "category": "Electronics", "subcategory": "Others", "description": "Up to 20 days of battery life (If Automatic Heart Rate feature is turned on then expected battery life will be 3-9 days). Compatible with Android 4.4 or later/iOS 9.0 or later, Use Mi-Fit App to connect the phone. Connectivity - Bluetooth 4.2, 0.78” OLED touch screen. The adjustable strap length is 155 - 216mm, Call and Notification Alert: Read messages and receive call notification and alerts from applications such as Uber, WhatsApp etc, Comfortable Fit, Single body design, Ultra soft, matte finish", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71P06zGG9VL._SL1500_.jpg"]},
{"product_name": "Sprinto WX02 Smart Wrist Band Intelligent Bracelet Waterproof Fitness Tracker Smart Watch Color Screen with Heart Rate Blood Pressure Calories Pedometer Sleep Monitor Etc. (Rendom Color)", "stores": [{"storeProductId": "B08DLPJVVF", "storeLink": "https://www.amazon.in/%E0%A4%87%E0%A4%82%E0%A4%9F%E0%A5%87%E0%A4%B2%E0%A5%80%E0%A4%9C%E0%A5%87%E0%A4%82%E0%A4%9F-%E0%A4%AC%E0%A5%8D%E0%A4%B0%E0%A5%87%E0%A4%B8%E0%A4%B2%E0%A5%87%E0%A4%9F-%E0%A4%B5%E0%A4%BE%E0%A4%9F%E0%A4%B0%E0%A4%AA%E0%A5%8D%E0%A4%B0%E0%A5%82%E0%A4%AB-%E0%A4%B8%E0%A5%8D%E0%A4%AE%E0%A4%BE%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A4%B5%E0%A5%89%E0%A4%9A-%E0%A4%AA%E0%A5%87%E0%A4%A1%E0%A5%8B%E0%A4%AE%E0%A5%80%E0%A4%9F%E0%A4%B0/dp/B08DLPJVVF/ref=sr_1_30?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-30", "storeName": "amazon", "storePrice": "459"}], "category": "Electronics", "subcategory": "Others", "description": "[Compatibility]: Adapt to support mobile for IOS8.0 or above, for Android 4.4 or higher, built-in optical sensor, pay attention to your heart rate changes 24 hours a day, outline your heart rate, present your health and beauty, Unique design]: USB plug-in charging design, you can plug in the USB or charging head interface directly after removing the wrist strap. It is easy and convenient, plug and play., High-resolution color touch screen]: 1.3TFT touch color screen, high-resolution large color touch screen, sensitive touch keys provide quick and easy operation, Multi-function]: Shake the camera, pedometer, calorie counter, distance counter, sleep monitor (sleep time, sleep quality), heart rate monitor, multiple sports modes, and keep an eye on your health., ip67 Waterproof smart watch]: Effectively protects the device from cold rain and splashes, you can't use it while showering or swimming", "image_urls": [null]},
{"product_name": "YUCO Double Resistance Band Toning Tube Exerciser Fitness Pulling Rope for Men (Multicolour)", "stores": [{"storeProductId": "B0899P2P77", "storeLink": "https://www.amazon.in/YUCO-Resistance-Exerciser-Fitness-Multicolour/dp/B0899P2P77/ref=sr_1_31?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-31", "storeName": "amazon", "storePrice": "425"}], "category": "Electronics", "subcategory": "Others", "description": "ideal for building and toning biceps,triceps, ideal for shoulder workout, ideal for men and women, portable to carry, latex tubes for comfort", "image_urls": [null]},
{"product_name": "Fitbit Inspire HR Health and Fitness Tracker with Heart Rate (Black)", "stores": [{"storeProductId": [], "storeLink": "https://www.amazon.in/Fitbit-Inspire-Health-Fitness-Tracker/dp/B07MSYTQNM/ref=sr_1_34?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-34", "storeName": "amazon", "storePrice": "9600"}], "category": "Electronics", "subcategory": "Others", "description": "Track all-day activity: Your hard-earned steps, distance, hourly activity, active minutes and calories burned, 24/7 heart rate more precisely tracks calorie burn, resting heart rate and heart rate zones, Automatically track sleep, plus get more insights into your light, deep and rem sleep stages, Enjoy up to 5 days of battery for daily progress without constant charging; Varies with use, Get call, text, calendar and smartphone app notifications right on your wrist, Automatically and conveniently record workouts like walks, swimming and bike rides in a snap with smart track, Connect inspire hr to your phone's gps and see real-time pace and distance on your wrist", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61fPdr7lutL._SL1088_.jpg"]},
{"product_name": "MevoFit Bold HR Fitness Band & Smart-Fitness-Watch for Athletes & Sports PRO with Color Display", "stores": [{"storeProductId": "B07G2K86Q7", "storeLink": "https://www.amazon.in/Mevofit-Bold-HR-Fitness-Band/dp/B07G2K86Q7/ref=sr_1_29?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-29", "storeName": "amazon", "storePrice": "1799"}], "category": "Electronics", "subcategory": "Others", "description": "Bold Fitness Tracker Watch is built especially for athletes and sports enthusiasts. It is a water resistant (IP 67) activity tracker which keeps a close track of your Steps, Distance, Running, Calories Burned and Active Minutes. Activity Tracker, Fitness Tracker with Heart Rate, Big Color Display and Gesture Control - Large Wireless Waterproof Fitness Tracker Monitor, Rugged Smart Watch with Sleep Tracker, Sedentary Alert, Alarms, Reminders and Weather Alerts, Best Fitness Tracker Watch for Athletes and Sports Enthusiasts which shows Call, SMS, FB, Twitter, Gmail, Skype, and other Notifications on the Bold Fitness, Bold is a Fitness Tracker with USB dongle - plug in the device in your LAPTOP'S/COMPUTER'S USB PORT for charging as soon as you get it. The battery might be drained drastically so we recommended to charge the band for 15 minutes before using it. Further, long press on the device screen to switch it on. Works on all popular phone like Samsung, Apple, Xiaomi Mi, Huawei, Motorola, Lenovo, Oppo, Vivo, One Plus, LG, 1 Year Warranty Claims", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61I%2Bw9d38JL._SL1500_.jpg"]},
{"product_name": "Bolditech Double Resistance Bands Toning Tube Exerciser with D Handle Fitness Rope Rubber Bands for Fitness Equipment Expander Exercise Tube Training (Multicolor)", "stores": [{"storeProductId": "B089NWR6BK", "storeLink": "https://www.amazon.in/Bolditech-Resistance-Exerciser-Equipment-Multicolor/dp/B089NWR6BK/ref=sr_1_27?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-27", "storeName": "amazon", "storePrice": "899"}], "category": "Electronics", "subcategory": "Others", "description": "Toning Tube With Dual Strings Large Handles For Comfortables Use 2 Removable Latex Cords Better Grip Strong Resistance Durable,Fine Quality, Comfortable - Cushioned Foam Handles Provide Comfortable And Slip-Free Grip., Versatile: Resistance Bands Are Extremely Versatile, Great For P90X, Insanity, Crossfit Training, Yoga, Pilates, Beachbody, Physical Therapy, Strengthening, Toning Upper And Lower Body. You Can Also Isolate And Target Glutes, Legs, Hips & Knees., 2 Adjustable Latex Cords. Ligthweight & Easy To Use, If You Have Any Question About The Product You Received, Please Contact Us Without Hesitation. We Will Try Our Best To Help You And Improve Your Shopping Experiences.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/619mbbmu6aL._SL1500_.jpg"]},
{"product_name": "Noise Colorfit Pro 2 Full Touch Control Smart Watch Jet Black", "stores": [{"storeProductId": "B07YY1BY5B", "storeLink": "https://www.amazon.in/Noise-Colorfit-Pro-Touch-Control/dp/B07YY1BY5B/ref=sr_1_26?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-26", "storeName": "amazon", "storePrice": "3499"}], "category": "Electronics", "subcategory": "Others", "description": "The brilliant 1.3\" colour display is now full capacitive touch, supporting taps and swipes, so it is easy to read and operate., The strong polycarbonate case makes the ColorFit Pro 2 featherlight on your wrist and is available in 4 beautiful colours with matching swappable straps., 24x7 heart rate monitoring with the built in optical HR monitor that measures your heart rate every five minutes., 9 sports modes to cover all your activities, whether you walk, run, hike, bike, treadmill, work-out, climb, spin, of perform yoga., You can sweat as much as you like and even wear the ColorFit Pro 2 in the rain, thanks to its IP68 waterproof rating., With up to ten day battery life, ColorFit Pro 2 can go for more than a week without needing to be charged via the included magnetic charger., Complete activity and health tracking with sleep monitoring, heart rate monitoring, step tracking, sedentary alarm and calories burned. , Optional menstrual tracking for women takes the guesswork out of cycle tracking., Track your health and fitness details for the past 2 weeks and see an overview for the last 30 days in the dedicated app, Noisefit – Android users & Noisefit Sport -iOS users., Customise your ColorFit Pro 2 with multiple watch faces that can be changed on the device itself., Control music playback on your smartphone with the remote function on your ColorFit Pro 2, Bluetooth v5.0 compatible with all smartphones running Android 4.4 or iOS 8.0 and above, Email | Support | Contact - help@nexxbase.com | support.gonoise.in | +91 8882132132", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/6113mS%2BxhyL._SL1500_.jpg"]},
{"product_name": "Sketchfab Smart Bracelet Tracker with Heart Rate Sensor Activity Tracker Waterproof Body Functions Like Steps and Calorie Counter, Blood Pressure V5.0 Bluetooth Fitness Band Smart Watch (Black)", "stores": [{"storeProductId": "B084DS6H81", "storeLink": "https://www.amazon.in/Sketchfab-Smart-Waterproof-Functions-Band/dp/B084DS6H81/ref=sr_1_25?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-25", "storeName": "amazon", "storePrice": "589"}], "category": "Electronics", "subcategory": "Others", "description": "water proof Smart fitness Band with Bluetooth And Heart Rate sensor, Activity Recorder, Sleep Monitor, Calorie Counter, Call Notifications, Alarm, Blood Pressure, Message, Usb Charging Supports smart phones, Tablets and PC's and also support Android and IOS., Unisex smart band for both women and men, Compatibility: Requires Android 4.3 or above, iOS 7.1 or above, Bluetooth 4.0 or above, download APP as mentioned in the product manual from Apple Store or Google Play., This smart wristband can record daily calories, distance, steps, Let you know your sports data, adjust your exercise program and get a healthier life, Waterproof level: IP67, Industry's Best. Charge the device fully before first use. Find my phone feature: Ring your phone, if it is misplaced , Phone Unlock feature (Android Only), Anti-lost", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61q2xYR5BOL._SL1100_.jpg"]},
{"product_name": "Generic A1 Bluetooth Smartwatch 4g Phone Watch with Camera/SIM Card Slot Sports Tracker Watch Compatible with All Android and iOS Smartphones, Black by Newton Plus", "stores": [{"storeProductId": "B089JY5VZ1", "storeLink": "https://www.amazon.in/Generic-Bluetooth-Smartwatch-Compatible-Smartphones/dp/B089JY5VZ1/ref=sr_1_56?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-56", "storeName": "amazon", "storePrice": "714"}], "category": "Electronics", "subcategory": "Others", "description": "FUNCTIONS: Bluetooth connectivity, Bluetooth Music Control, Voice Recorder, Sim-card (Micro) support, Calling function, Cellphone finder, Reminder for long time sitting, Battery with durable power, Pedometer, Anti-lost function, WORKING MODE: One is company mode (bluetooth), it enable to make phone or receive phone or send or get message etc via bluetooth. The other one is network mode (sim card inserted), DISPLAY: 1.54\" IPS LCD 2.5D Radian Capacitive Touch Screen for easy operation. Built-in SIM card slot and TF card slot, Support Compatable Smartwatch With Bluetooth connection., SYNC FUNCTION: qq,wechat, twitter, facebook, browser time, schedule, read text message, sport health: Pedometer, sleep monitoring, sedentary remind, COMPATIBILITY: All Android and iOS Mobile Phone & Android Tablet PC. Android Mobile Phone", "image_urls": [null]},
{"product_name": "HUG PUPPY ID116 Plus Bluetooth Fitness Smart Watch for Men Women and Kids Activity Tracker (Black)", "stores": [{"storeProductId": "B08FGZ7STS", "storeLink": "https://www.amazon.in/HUG-PUPPY-Bluetooth-Fitness-Activity/dp/B08FGZ7STS/ref=sr_1_53?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-53", "storeName": "amazon", "storePrice": "699"}], "category": "Electronics", "subcategory": "Others", "description": "This watch has USB Port you need to attach the USB port with your normal mobile charger or laptop to charge the watch, Kindly note this smart watch band is not a Xiaomi Redmi smart band it has many more features compared to mi smart watch band 3, Its Domestic use waterproof with Industry's Best Standards., Compatibility: All Android and iOS Mobile Phone & Android Tablet PC. Android Mobile Phone: Samsung, HTC, Sony, LG, HUAWEI, ZTE, OPPO, XIAOMI, and so on. iOS Mobile Phone: iPhone 6, iPhone 6 plus, iPhone 5, iPhone 5s , iPhone 4, iPhone 4s (This APP can' t be installed by iOS, Apple system can' t sync SMS and Bluetooth push information, but other functions can be used by iPhone), NOTE- For Any Product Issue Please Contact Us Through Buyer Massage Please Install Any One App From Play Store for the device App Name YOHO,FIT PRO,LEFUN HEALTH, NOTE Charger is not available with this watch Water proof Smart fitness Band with Bluetooth And Heart Rate sensor, Activity Recorder, Sleep Monitor, Calorie Counter, Call Notifications, Alarm, Blood Pressure, Message, Usb Charging Supports smart phones, Tablets and PC's and also support Android and IOS", "image_urls": [null]},
{"product_name": "HONOR Band 5i (Meteorite Black) Full Color Touchscreen, SpO2, In-Built USB Charging, Music Control, Watch Faces Store, Multiple Sports Modes, Scientific Sleep Monitor, HR Monitor, 50M Water Resistance", "stores": [{"storeProductId": "B082DZ8HQQ", "storeLink": "https://www.amazon.in/Meteorite-Touchscreen-Charging-Scientific-Resistance/dp/B082DZ8HQQ/ref=sr_1_51?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-51", "storeName": "amazon", "storePrice": "1799"}], "category": "Electronics", "subcategory": "Others", "description": "0.96-inch (2.43cms) TFT Color Full Touchscreen Display: Adjustable screen brightness, dynamic & vivid display; Home button control. Compatible with Android 4.4 or later/iOS 9.0 or later, Scientific Sleep Monitoring: TruSleep allows sleep status recognition, collection and analyzing data, Heart Rate Monitoring: TruSeen allows 24-hour accurate real-time heart rate monitoring and warnings. Connectivity Bluetooth 4.2, Special Features: Multiple Watch Faces; Remote Control Camera (only available on Huawei/Honor EMUI 8.1 devices or later), Multiple Sports Modes: Supports Outdoor & Indoor Run, Walking, Indoor & Outdoor Cycling & Training Various Exercises Types, 5ATM Water Resistant: 50 meters water resistant, Long Standby Time: Standby time up to 6 days & saves time on frequent charging, Daily Activities Tracking & Monitoring: Step count, calories burned, distance covered, moderate to high intensity activities duration & standing status, target setting & achievement reminder, Smart Assistant & Notification Reminders: Stopwatch & timer; Find your phone; Alarm reminder (including smart & event alarms); Caller ID, SMS, e-mail, Weather Reports, Calendar & Social Apps, For more Product Information or Support Kindly Contact_us on: [1800-210-9999], Country of Origin: China", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71AxeIwvfnL._SL1500_.jpg"]},
{"product_name": "NG FASHION M4 Bluetooth Wireless Smart Fitness Band for Boys/Men/Kids/Women | Sports Watch Compatible with Mobile Phone | Heart Rate and BP Monitor, Calories Counter (M4 Band)(BLACK01)", "stores": [{"storeProductId": "B08DYD9NTL", "storeLink": "https://www.amazon.in/NG-FASHION-M4-Bluetooth-Compatible/dp/B08DYD9NTL/ref=sr_1_50?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-50", "storeName": "amazon", "storePrice": "577"}], "category": "Electronics", "subcategory": "Others", "description": "", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61JOw0SebnL._SL1500_.jpg"]},
{"product_name": "BEARDO BEARDO Smartwatch Men's & Boys' Watch (Multicolor Dial Assorted Colored Strap) (Pack of 4)", "stores": [{"storeProductId": [], "storeLink": "https://www.amazon.in/Foxter-Combo-Analogue-Multicolor-Stylish/dp/B07LG9QTWS/ref=sr_1_49?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-49", "storeName": "amazon", "storePrice": "399"}], "category": "Electronics", "subcategory": "Others", "description": "Dial Color: Multicolor, Dial Shape: Round, Watch Movement Type: Quartz", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/712YsMzhM8L._UL1500_.jpg"]},
{"product_name": "ACUTAS 22mm Classic Silicone Strap Band for Fossil Q Explorist Gen 3 / Fossil Q Wander, Marshal, Founder Gen 2 Smart Watch Strap (Black)", "stores": [{"storeProductId": "B07KWW1Q8G", "storeLink": "https://www.amazon.in/ACUTAS-Classic-Silicone-Explorist-Marshal/dp/B07KWW1Q8G/ref=sr_1_52?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-52", "storeName": "amazon", "storePrice": "529"}], "category": "Electronics", "subcategory": "Others", "description": "Compatible model This Silicone Band perfectly fit for 22mm smart watch, such as Fossil Q 22mm Smart Watch: for Fossil Q Explorist Gen 3/Fossil Q Wander, Marshal, Founder Gen 2, Product Material -Silicone Band made of silicone and feel good on you wrist, Product Features Strap for Fossil Q 22mm smart watch, the length adjustable for various wrist, all fits well, Durable and Sturdy Perfect band, different color with different mood when you working and travelling, EASY PINS -No need loading and unloading tools. Features quick release pins for fast and easy tool-free installation and removal of straps to change up your look", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51FHlqZdjbL._SL1000_.jpg"]},
{"product_name": "GOQii Smart Vital Fitness SpO2, body temperature and blood pressure tracker with 3 months personal Coaching", "stores": [{"storeProductId": "B0877MB5HN", "storeLink": "https://www.amazon.in/GOQii-temperature-pressure-personal-Coaching/dp/B0877MB5HN/ref=sr_1_48?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-48", "storeName": "amazon", "storePrice": "5999"}], "category": "Electronics", "subcategory": "Others", "description": "Monitoring your blood oxygen levels by intelligently monitoring your (SpO2) blood oxygen levels., GOQii smart vital comes with 1.3 inches color display with full touch screen, Track all day activity like steps, distance, calories burned, active time, 24x7 heart monitoring  and Auto Sleep tracking, Multiple customize watch faces, find my phone, music control, camera, stopwatch, timer, raise to wake, alarms, inactivity alerts, Smart notification: reading phone notification such WhatsApp, Facebook, calls, SMS on watch, Battery charger: 2 pin magnetic charger- remove the strap and put the core on it to charge, Up to 7 days of battery life under normal usage, In GOQii family care plan, you get a personal coach and doctor for the 3 months subscription period - this purchase of GOQii family care plan can be claimed as tax benefit under section 80D/one year warranty - the user can connect with GOQii in case of any troubleshooting on the 24/7 Live chat and also call on toll Free number on 1800-3130-3930 between 10AM-7PM/disclaimer: this is not a medical device and not a replacement to a sphygmomanometer (an instrument for measuring blood, In-box Contents: In-Box Contents: 1 GOQii smart vital fitness band, 1 smart vital fitness watch core, 1 Activation code scratch card for the subscription, 1 user Manual, 2 pin magnetic charger", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51IZKRKNGdL._SL1000_.jpg"]},
{"product_name": "Frittle M762 Fitness Tracker Smart Band with Heart Rate Monitor | Calorie Counter | Foot Steps Counter | Blood Pressure & More Features Compatible with All Smartphones,iOS & Windows Device (Black)", "stores": [{"storeProductId": "B07RD9NBYS", "storeLink": "https://www.amazon.in/Frittle-Pressure-Features-Compatible-Smartphones/dp/B07RD9NBYS/ref=sr_1_24_sspa?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-24-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzR082QVpPU05SOEtOJmVuY3J5cHRlZElkPUEwNDk5NDg2MUZTSE83VUZVSkhVQSZlbmNyeXB0ZWRBZElkPUExMDI4MzcxU1RLRE1ITUNYQTlMJndpZGdldE5hbWU9c3BfbXRmJmFjdGlvbj1jbGlja1JlZGlyZWN0JmRvTm90TG9nQ2xpY2s9dHJ1ZQ==", "storeName": "amazon", "storePrice": "269"}], "category": "Electronics", "subcategory": "Others", "description": "Monitor your sleep :-Set the sleep mode when you go to bed to track the of your rest, nudging you toward a healthier lifestyle., Keep you informed :-You can get SMS message, incoming calls and calendar alerts when you are working out. You can also set the drinking or sedentary reminder., Find my phone feature :- Ring your phone, if it is misplaced , Phone Unlock feature (Android Only)., Sensors: gravity acceleration sensor Display: 0.96inch screen Power consumption: normal use for a week, standby for three months., Compatiblity:- With all the device with bluetooth connectivity. Compatible with Android, IOS & Windows Devices.", "image_urls": [null]},
{"product_name": "KTCOO M4 Pro Heart Rate & Sleep Monitor Smart Band Messages Alert Digital Watch Step Counter Smart Band Fitness Tracker Smart Watch for Mens Women Boys Girls Compatible with Android & iOS", "stores": [{"storeProductId": "B08F5F34K8", "storeLink": "https://www.amazon.in/KTCOO-Monitor-Messages-Digital-Compatible/dp/B08F5F34K8/ref=sr_1_20?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-20", "storeName": "amazon", "storePrice": "449"}], "category": "Electronics", "subcategory": "Others", "description": "0.96in color screen AMOLED display, clear to see even under sunlight, monitor your sports informations at all times, IP67 waterproof, you can wash hands when you wear it or wear in the rain, but it's better not wear it to swim., High sensitive touched screen, can achieve various operations, information content, step, calories, distance, weather, heart rate and other functions to quickly view, thus opening intelligent life., Automatically record the number of step, burn calories., Made of thermoplastic elastomer, it is more comfortable to wear, double-breasted design, let you exercise without falling off., Recording hearrt rate is nice for knowing your health and exercise status, using reflection. Photoelectric signal detection principle records your heart rate, 24h continuous detection your heart rate., You can choose the exercise program that suits your life rhythm, Nothing is more than sweating after exercise. Sweating can relax yourself, stick to exercise, and make yourself a nicer self. The bracelet automatically detects your sleep and generates a sleep report. With IP67 waterproof performance, rain, water environments completely fearless, let you enjoy the fun of life. When you forget the time, the bracelet will vibrate gently, remid you to get up and wake up.", "image_urls": [null]},
{"product_name": "SBA A003 M4 Plus Bluetooth Wireless Smart Fitness Band for Boys/Men/Kids/Women | Sports Watch Compatible with Xiaomi, Oppo, Vivo Mobile | Heart Rate and BP Monitor, Calories Counter", "stores": [{"storeProductId": "B08CVJW446", "storeLink": "https://www.amazon.in/SBA-Bluetooth-Wireless-Compatible-Calories/dp/B08CVJW446/ref=sr_1_19?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-19", "storeName": "amazon", "storePrice": "399"}], "category": "Electronics", "subcategory": "Others", "description": "☑️The New M4 Band Comes With A 0.96inch HD Screen and Sleek Light Weight Yet Durable Design Which Makes It Very Comfortable To Wear And Carry Around. Comes With Flexible And Solid Silicon Straps For More Comfort., ☑️Waterproof Sweat-proof Design --Waterproof/ Sweat-proof Smart Bracelet - IP67 waterproof allow you washing hands, getting caught in the rain. You can wash hands when you wear it or wear in the rain, but it's better not wear it to swim or bath., ☑️It has features such as calling function which enables you receive a call and disconnect it, you can also send and receive messages through it but only supported to android Phones, ☑️Sedentary Reminder--Sometimes you may sit for a long time, which is not good for your health., ☑️Sports and health: Sports step (3D sensor), calorie consumption, exercise distance, pedometer ,Support Dynamic Heart rate, Blood Pressure, Blood Oxygen monitoring, Support call reminder and message reminder", "image_urls": [null]},
{"product_name": "Adlynlife ID117 Plus Bluetooth Smart Fitness Band Watch for Men/Women with Heart Rate Activity Tracker Waterproof Body | Steps and Calorie Counter, Blood Pressure, Distance Measure, OLED Touch Screen", "stores": [{"storeProductId": "B08DJF37LS", "storeLink": "https://www.amazon.in/Adlynlife-Bluetooth-Activity-Waterproof-Pressure/dp/B08DJF37LS/ref=sr_1_16?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-16", "storeName": "amazon", "storePrice": "649"}], "category": "Electronics", "subcategory": "Others", "description": "IPX4 Water proof ( not for swimming ) Smart fitness Band with Bluetooth And Heart Rate sensor, Activity Recorder, Sleep Monitor, Calorie Counter, Call Notifications, Alarm, Blood Pressure, Message, Usb Charging Supports smart phones, Tablets and PC's and also support Android and IOS, Unisex smart band for both women and men, Compatibility: Requires Android 4.3 or above, iOS 7.1 or above, Bluetooth 4.0 or above, download APP as mentioned in the product manual from Apple Store or Google Play, Kindly note this smart watch band is not a Xiaomi Redmi smart band it has many more features compared to mi smart watch band 3, Its Domestic use waterproof with Industry's Best Standards., Compatibility: All Android and iOS Mobile Phone & Android Tablet PC. Android Mobile Phone: Samsung, HTC, Sony, LG, HUAWEI, ZTE, OPPO, XIAOMI, and so on. iOS Mobile Phone: iPhone 6, iPhone 6 plus, iPhone 5, iPhone 5s , iPhone 4, iPhone 4s (This APP can' t be installed by iOS, Apple system can' t sync SMS and Bluetooth push information, but other functions can be used by iPhone), Waterproof level: IPX4, Industry's Best. Charge the device fully before first use. Find my phone feature: Ring your phone, if it is misplaced , Phone Unlock feature (Android Only", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61lICXHc2%2BL._SL1200_.jpg"]},
{"product_name": "Teconica GHN925 M4 Intelligence Bluetooth Wrist Smart Band Watch/Health Bracelet/Smart Watch/Activity Tracker/Bracelet Watch/Smart Fitness Band/", "stores": [{"storeProductId": "B08DHGHG9K", "storeLink": "https://www.amazon.in/Teconica-GHN925-Intelligence-Bluetooth-Bracelet/dp/B08DHGHG9K/ref=sr_1_14?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-14", "storeName": "amazon", "storePrice": "349"}], "category": "Electronics", "subcategory": "Others", "description": "Blood Pressure & Heart Rate & Blood Oxygen Measurement & Sleep Monitoring: Tracks real-time heart rate automatically & continuously and automatically tracks your sleep duration & consistency with comprehensive analysis of sleep quality data, high-performance CPU to monitor blood pressure & blood oxygen, See Calls & Messages on Your Wrist: Receive/Rejection call, calendar, SMS and SNS (Facebook, WhatsApp, LinkedIn, Instagram, and Twitter) notifications on display, fitness tracker band let you never miss the messages that matter., Water resistance upto 10 meters, All-day activity tracking: Track steps, distance, calories burned, active minutes, you can check daily activity and time on OLED display or APP", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61neYqDBxkL._SL1000_.jpg"]},
{"product_name": "Fastrack Reflex 2.0 Unisex Activity Tracker -SWD90059PP04", "stores": [{"storeProductId": [], "storeLink": "https://www.amazon.in/Fastrack-Reflex-Digital-Black-Watch-SWD90059PP04/dp/B07DQHTB9N/ref=sr_1_18?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-18", "storeName": "amazon", "storePrice": "1495"}], "category": "Electronics", "subcategory": "Others", "description": "Dial Color: Black, Case Shape: Rectangular, Dial Glass Material: AcrylicT ; Gender: Unisex ; Lock Mechanism: Buckle, It is compatible with all iOS versions 8.0 and above and android versions 5.0 and above except the following phone models :Samsung Galaxy A9 Pro, Samsung Galaxy C9 Pro, Moto G5 series - all phones, Samsung Galaxy J2 Pro, Band Color: Grey, Band Material: TPU. The case thickness is 12.5 mm, Watch Movement Type: processor, Watch Display Type: Digital, Case Material: Plastic, Case Diameter: 50 millimeters, Touch screen ; Bluetooth: 4.0v ; Battery life: Up to 10 Days, 24 Months manufacturer warranty on manufacturing defects, It tracks the number of steps you have taken, the total distance you have travelled and the number of calories that you have burned, It helps you to have an active lifestyle with an inbuilt sedentary reminder which you can customise as per your lifestyle, It helps you track your sleep patterns, in the bed and off it, It acts as a remote control to click pictures on your phone, after all who doesn’t love to take the perfect selfie, Remove plastic at crown to start the watch, For technical issues kindly contact_us on : [080-61160711] or [080-61160712]", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71EFa8Vpk4L._UL1500_.jpg"]},
{"product_name": "Reflex Beat Purple Smart Unisex Activity Tracker with Active Heart Rate Monitor -SWD90066PP02", "stores": [{"storeProductId": [], "storeLink": "https://www.amazon.in/Reflex-Activity-Tracker-Monitor-SWD90066PP02/dp/B08299TLN2/ref=sr_1_23_sspa?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-23-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzR082QVpPU05SOEtOJmVuY3J5cHRlZElkPUEwNDk5NDg2MUZTSE83VUZVSkhVQSZlbmNyeXB0ZWRBZElkPUEwNzg3ODg5MkY3SjZXVzFTTDRRRSZ3aWRnZXROYW1lPXNwX210ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU=", "storeName": "amazon", "storePrice": "1975"}], "category": "Electronics", "subcategory": "Others", "description": "Dial Color: Black, Case Shape: Rectangular, Dial Glass Material: Plastic, Band Color: Purple, Band Material: PU, Watch Movement Type: Processor, Watch Display Type: Digital, Case Material: Plastic, Case Diameter: 23.7 millimeters, Water Resistance: IPX6, Touch Button, Active Heart Rate Monitor", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/617p0412c%2BL._UL1500_.jpg"]},
{"product_name": "SClout M4 Bluetooth Wireless Smart Fitness Band for Boys/Men/Kids/Women | Sports Watch Compatible with Xiaomi, Oppo, Vivo Mobile Phone | Heart Rate and BP Monitor, Calories Counter (M4 Band)", "stores": [{"storeProductId": "B08BG3JKDT", "storeLink": "https://www.amazon.in/Bluetooth-Wireless-Fitness-Compatible-Calories/dp/B08BG3JKDT/ref=sr_1_17?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-17", "storeName": "amazon", "storePrice": "564"}], "category": "Electronics", "subcategory": "Others", "description": "", "image_urls": [null]},
{"product_name": "HONOR Band 5 (CoralPink)- Waterproof Full Color AMOLED Touchscreen, SpO2 (Blood Oxygen), Music Control, Watch Faces Store, up to 14 Day Battery Life", "stores": [{"storeProductId": "B07WRCFHLM", "storeLink": "https://www.amazon.in/HONOR-Band-5-Coral-Pink/dp/B07WRCFHLM/ref=sr_1_15?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-15", "storeName": "amazon", "storePrice": "2199"}], "category": "Electronics", "subcategory": "Others", "description": "0.95 Inch (2.41 cms) AMOLED Touch Large Color Screen: Adjustable screen brightness, dynamic and vivid display; home button control, Belt clip design makes band firmly attached to your wrist. Compatible with Android 4.4 or later/iOS 9.0 or later, Scientific Sleep Monitoring: TruSleep allows sleep status recognition, collection and analyzing data. Storage: RAM 384 KB |ROM 1 MB|PSRAM 8M |Flash 32 MB, SpO2 Monitor for Everyone: HONOR Band 5's SpO2 Monitor tracks oxygen saturation levels in the bloodstream so you can assess how your body is adapting during workouts or at high altitudes. Connectivity Bluetooth 4.2, Smart Music & Volume Controls: Don't stop your workout for anything. Change the song, adjust the volume from your HONOR Band 5 effortlessly, Heart Rate Monitoring: TruSeen allows 24-hour accurate real-time heart rate monitoring and warnings, Special Features & Battery Life: Multiple Watch Faces; Remote Control Camera (only available on Huawei/Honor EMUI 8.1 devices or later). Long standby time up to 14 days and saves time on frequent charging, Multiple Sports Modes: Supports Outdoor and Indoor Run, Walking, Indoor and Outdoor Cycling, Pool Swim and Training Various Exercises Types, 5ATM 50 meters water-resistant. Swimming Posture Recognition: 6-Axis sensor recognizes main strokes, Records speed, distance, number of turns, calories, average SWOLF, and other data, Daily Activities Tracking and Monitoring: Step count, calories burned, distance covered, moderate to high-intensity activities duration and standing status, target setting and achievement reminder, Smart Assistant and Notification Reminders: Stopwatch and timer; Find your phone; Alarm reminder (including smart and event alarms); Caller ID, SMS, e-mail, Weather Reports, Calendar and Social Apps, For any queries, please contact_us on: [1800-210-9999], Country of Origin: China", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81vJU3attxL._SL1500_.jpg"]},
{"product_name": "Suunto 3 Activity Tracker with Wrist HR", "stores": [{"storeProductId": "B07DG4BT84", "storeLink": "https://www.amazon.in/Suunto-Fitness-Watch-All-Black/dp/B07DG4BT84/ref=sr_1_22_sspa?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-22-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzR082QVpPU05SOEtOJmVuY3J5cHRlZElkPUEwNDk5NDg2MUZTSE83VUZVSkhVQSZlbmNyeXB0ZWRBZElkPUEwNzQ2ODMyMjhCRjZaN1BYVkhSUSZ3aWRnZXROYW1lPXNwX210ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU=", "storeName": "amazon", "storePrice": "17951"}], "category": "Electronics", "subcategory": "Others", "description": "Adaptive Training Guidance, Activity Tracking, Sleep Quality And Tracking, Stress And Recovery, Heart Rate Zones, Wrist HR, Connected GPS, Water Resistance 30M, In time mode up to 10 days, For any product related queries, Please call +91 9667306868 during business hours.", "image_urls": [null]},
{"product_name": "Dronean DAS123 116 Smart Band Fitness Tracker, Color Screen Smart Wristband Fitness Bracelet Blood Pressure Heart Rate Monitor Compatible for All Device (Assorted Colour)", "stores": [{"storeProductId": "B08DK7ZCGW", "storeLink": "https://www.amazon.in/Dronean-DAS123-Wristband-Bracelet-Compatible/dp/B08DK7ZCGW/ref=sr_1_11?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-11", "storeName": "amazon", "storePrice": "389"}], "category": "Electronics", "subcategory": "Others", "description": "All-in-one Smart Watch Fitness Tracker : All-day activities tracker,waterproof smart bracelet, automatic heart rate,blood pressure and monitor,Notifications reminder,intelligent sleep tracker,camera remote and music control,steps,reminders to move,training helper,alarm,quick view,etc, Personal Health Tracker : Built-in latest optical sensors,measure heart rate effectively,blood pressure and blood oxygen levels,records them for you in the LEFUN app.Get a better understanding of your health,towards a healthy lifestyle, IP67 Waterproof Wrist Watch : Protects your watch when washing your hands,swimming or getting caught in the rain.Track and share your daily activity,and get the motivation you need to hit your goals, Keeping You Stay in Touch : Mobile notifications keep you aware of important events.View notifications from email,SMS,caller ID and your favorite apps (Facebook, Twitter, Skype, WhatsApp, etc) on your wrist,so you never miss a beat", "image_urls": [null]},
{"product_name": "MAGBOT M4 Smart Fitness Band for Boys/Men/Kids/Women | Waterproof Bluetooth Sports Watch Compatible with Mi, Xiaomi, Oppo, Vivo Mobile Phone | Activity Tracker Heart Rate BP Step Calorie Counter Touch screen", "stores": [{"storeProductId": "B081K8SG39", "storeLink": "https://www.amazon.in/MAGBOT-Smart-Band-Fitness-Bluetooth/dp/B081K8SG39/ref=sr_1_9?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-9", "storeName": "amazon", "storePrice": "599"}], "category": "Electronics", "subcategory": "Others", "description": "Heart rate monitor.Time, Pedometer, Distance monitor Calorie monitor, Alarm clock, Sleep monitor, Camera remote, Calculate heart rate accurately by PPG sensor Touch key and press key operated., It has features such as calling function which enables you receive a call and disconnect it, you can also send and receive messages through it but only supported to android Phones for which you need to download app, Compatibility: Requires Android 4.3 or above, iOS 7.1 or above, Bluetooth 4.0 or above, download APP \"Veryfit 2.0\" from iOS Store or Google Play, Waterproof: TPU material waterproof, not afraid of washing hands/ doing housework/ walking under rain., NOTE - Kindly charge the device for atleast 30 Min before first use.", "image_urls": [null]},
{"product_name": "realme Band (Green) - Full Colour Screen with Touchkey, Real-time Heart Rate Monitor, in-Built USB Charging, IP68 Water Resistant", "stores": [{"storeProductId": "B088L1QLM1", "storeLink": "https://www.amazon.in/realme-Band-Green-Real-time-Built/dp/B088L1QLM1/ref=sr_1_12?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-12", "storeName": "amazon", "storePrice": "1462"}], "category": "Electronics", "subcategory": "Others", "description": "Large Color Display - 2.4cm (0.96 inch) large color screen can display a vast range of more than 65,000 colors, Touch Button - The touch button make the display simple and intuitive to operate. Single tap to go to the next and long-press to access different levels within an option, Install the App by searching and downloading “realme Link” on the Google Play Store, Long Battery Life - Get a long standby time of up to 10 days on a single charge with heart rate monitor, Heart Rate Monitor - Accurately monitor your heart rate in real-time with the built-in optical heart rate monitor, 9 Sport Modes - Track your favorite activity with the realme Band. It supports tracking for 9 sports such as Walking, Running, Yoga, Cricket, and more, App Notifications - Get instant notifications about Calls, SMS, WhatsApp, YouTube, Gmail, Instagram and much more, right on your wrist", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61n-IAVPCeL._SL1500_.jpg"]},
{"product_name": "HONOR Band 5i (Meteorite Black) Full Color Touchscreen, SpO2, In-Built USB Charging, Music Control, Watch Faces Store, Multiple Sports Modes, Scientific Sleep Monitor, HR Monitor, 50M Water Resistance", "stores": [{"storeProductId": "B082DZ8HQQ", "storeLink": "https://www.amazon.in/Meteorite-Touchscreen-Charging-Scientific-Resistance/dp/B082DZ8HQQ/ref=sr_1_13?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-13", "storeName": "amazon", "storePrice": "1799"}], "category": "Electronics", "subcategory": "Others", "description": "0.96-inch (2.43cms) TFT Color Full Touchscreen Display: Adjustable screen brightness, dynamic & vivid display; Home button control. Compatible with Android 4.4 or later/iOS 9.0 or later, Scientific Sleep Monitoring: TruSleep allows sleep status recognition, collection and analyzing data, Heart Rate Monitoring: TruSeen allows 24-hour accurate real-time heart rate monitoring and warnings. Connectivity Bluetooth 4.2, Special Features: Multiple Watch Faces; Remote Control Camera (only available on Huawei/Honor EMUI 8.1 devices or later), Multiple Sports Modes: Supports Outdoor & Indoor Run, Walking, Indoor & Outdoor Cycling & Training Various Exercises Types, 5ATM Water Resistant: 50 meters water resistant, Long Standby Time: Standby time up to 6 days & saves time on frequent charging, Daily Activities Tracking & Monitoring: Step count, calories burned, distance covered, moderate to high intensity activities duration & standing status, target setting & achievement reminder, Smart Assistant & Notification Reminders: Stopwatch & timer; Find your phone; Alarm reminder (including smart & event alarms); Caller ID, SMS, e-mail, Weather Reports, Calendar & Social Apps, For more Product Information or Support Kindly Contact_us on: [1800-210-9999], Country of Origin: China", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71AxeIwvfnL._SL1500_.jpg"]},
{"product_name": "Fastrack Reflex 2.0 Unisex Activity Tracker - SWD90059PP05", "stores": [{"storeProductId": [], "storeLink": "https://www.amazon.in/Fastrack-Reflex-Digital-Black-Watch-SWD90059PP05/dp/B07DQN5B3G/ref=sr_1_10?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-10", "storeName": "amazon", "storePrice": "1495"}], "category": "Electronics", "subcategory": "Others", "description": "Dial Color: Black, Case Shape: Rectangular, Dial Glass Material: Acrylic; Case Thickness:12.5 mm; Case Length(6H-12H):50 mm, It is compatible with all iOS versions 8.0 and above and android versions 5.0 and above except the following phone models :Samsung Galaxy A9 Pro, Samsung Galaxy C9 Pro, Moto G5 series - all phones, Samsung Galaxy J2 Pro, Band Color: Black, Band Material: TPU; Watch Movement Type: processor, Watch Display Type: Digital, Case Material: Plastic, Touch screen; Note: Please charge the device completely before use, It tracks the number of steps you have taken, the total distance you have travelled and the number of calories that you have burned, It helps you to have an active lifestyle with an inbuilt sedentary reminder which you can customise as per your lifestyle, It helps you track your sleep patterns, in the bed and off it, It acts as a remote control to click pictures on your phone, after all who doesn’t love to take the perfect selfie, Remove plastic at crown to start the watch, 12 Months Manufacturer Warranty on manufacturing defects For technical issues kindly contact_us on : [ 1800-266-0123 ]", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/814d7DPCPfL._UL1500_.jpg"]},
{"product_name": "HONOR Band 5 (MeteoriteBlack)- Waterproof Full Color AMOLED Touchscreen, SpO2 (Blood Oxygen), Music Control, Watch Faces Store, up to 14 Day Battery Life", "stores": [{"storeProductId": "B07WTHFBQS", "storeLink": "https://www.amazon.in/HONOR-Band-5-Meteorite-Black/dp/B07WTHFBQS/ref=sr_1_8?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-8", "storeName": "amazon", "storePrice": "2199"}], "category": "Electronics", "subcategory": "Others", "description": "0.95 Inch (2.41 cms) AMOLED Touch Large Color Screen: Adjustable screen brightness, dynamic and vivid display; home button control, Belt clip design makes band firmly attached to your wrist. Compatible with Android 4.4 or later/iOS 9.0 or later, Scientific Sleep Monitoring: TruSleep allows sleep status recognition, collection and analyzing data. Storage: RAM 384 KB |ROM 1 MB|PSRAM 8M |Flash 32 MB, SpO2 Monitor for Everyone: HONOR Band 5's SpO2 Monitor tracks oxygen saturation levels in the bloodstream so you can assess how your body is adapting during workouts or at high altitudes. Connectivity Bluetooth 4.2, Smart Music & Volume Controls: Don't stop your workout for anything. Change the song, adjust the volume from your HONOR Band 5 effortlessly, Heart Rate Monitoring: TruSeen allows 24-hour accurate real-time heart rate monitoring and warnings, Special Features & Battery Life: Multiple Watch Faces; Remote Control Camera (only available on Huawei/Honor EMUI 8.1 devices or later). Long standby time up to 14 days and saves time on frequent charging, Multiple Sports Modes: Supports Outdoor and Indoor Run, Walking, Indoor and Outdoor Cycling, Pool Swim and Training Various Exercises Types, 5ATM 50 meters water-resistant. Swimming Posture Recognition: 6-Axis sensor recognizes main strokes, Records speed, distance, number of turns, calories, average SWOLF, and other data, Daily Activities Tracking and Monitoring: Step count, calories burned, distance covered, moderate to high-intensity activities duration and standing status, target setting and achievement reminder, Smart Assistant and Notification Reminders: Stopwatch and timer; Find your phone; Alarm reminder (including smart and event alarms); Caller ID, SMS, e-mail, Weather Reports, Calendar and Social Apps, For any queries, please contact_us on: [1800-210-9999], Smart Assistant and Notification Reminders: Stopwatch and timer; Find your phone; Alarm reminder (including smart and event alarms); Caller ID, SMS, e-mail, Weather Reports, Calendar and Social Apps, Country of Origin: China", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81CwFEsrQUL._SL1500_.jpg"]},
{"product_name": "realme Band (Black) - Full Colour Screen with Touchkey, Real-time Heart Rate Monitor, in-Built USB Charging, IP68 Water Resistant", "stores": [{"storeProductId": "B087QDJ9XL", "storeLink": "https://www.amazon.in/realme-Band-Black-Real-time-Built/dp/B087QDJ9XL/ref=sr_1_6?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-6", "storeName": "amazon", "storePrice": "1450"}], "category": "Electronics", "subcategory": "Others", "description": "Large Color Display - 2.4cm (0.96 inch) large color screen can display a vast range of more than 65,000 colors, Touch Button - The touch button make the display simple and intuitive to operate. Single tap to go to the next and long-press to access different levels within an option, Install the App by searching and downloading “realme Link” on the Google Play Store, Long Battery Life - Get a long standby time of up to 10 days on a single charge with heart rate monitor, Heart Rate Monitor - Accurately monitor your heart rate in real-time with the built-in optical heart rate monitor, 9 Sport Modes - Track your favorite activity with the realme Band. It supports tracking for 9 sports such as Walking, Running, Yoga, Cricket, and more, App Notifications - Get instant notifications about Calls, SMS, WhatsApp, YouTube, Gmail, Instagram and much more, right on your wrist", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61-%2BzVZL4LL._SL1500_.jpg"]},
{"product_name": "HONOR Band 5 (MidnightNavy)- Waterproof Full Color AMOLED Touchscreen, SpO2 (Blood Oxygen), Music Control, Watch Faces Store, up to 14 Day Battery Life", "stores": [{"storeProductId": "B07WQX8JL4", "storeLink": "https://www.amazon.in/HONOR-Band-5-Midnight-Navy/dp/B07WQX8JL4/ref=sr_1_7?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-7", "storeName": "amazon", "storePrice": "2199"}], "category": "Electronics", "subcategory": "Others", "description": "0.95 Inch (2.41 cms) AMOLED Touch Large Color Screen: Adjustable screen brightness, dynamic and vivid display; home button control, Belt clip design makes band firmly attached to your wrist. Compatible with Android 4.4 or later/iOS 9.0 or later, Scientific Sleep Monitoring: TruSleep allows sleep status recognition, collection and analyzing data. Storage: RAM 384 KB |ROM 1 MB|PSRAM 8M |Flash 32 MB, SpO2 Monitor for Everyone: HONOR Band 5's SpO2 Monitor tracks oxygen saturation levels in the bloodstream so you can assess how your body is adapting during workouts or at high altitudes. Connectivity Bluetooth 4.2, Smart Music & Volume Controls: Don't stop your workout for anything. Change the song, adjust the volume from your HONOR Band 5 effortlessly, Heart Rate Monitoring: TruSeen allows 24-hour accurate real-time heart rate monitoring and warnings, Special Features & Battery Life: Multiple Watch Faces; Remote Control Camera (only available on Huawei/Honor EMUI 8.1 devices or later). Long standby time up to 14 days and saves time on frequent charging, Multiple Sports Modes: Supports Outdoor and Indoor Run, Walking, Indoor and Outdoor Cycling, Pool Swim and Training Various Exercises Types, 5ATM 50 meters water-resistant. Swimming Posture Recognition: 6-Axis sensor recognizes main strokes, Records speed, distance, number of turns, calories, average SWOLF, and other data, Daily Activities Tracking and Monitoring: Step count, calories burned, distance covered, moderate to high-intensity activities duration and standing status, target setting and achievement reminder, Smart Assistant and Notification Reminders: Stopwatch and timer; Find your phone; Alarm reminder (including smart and event alarms); Caller ID, SMS, e-mail, Weather Reports, Calendar and Social Apps, For any queries, please contact_us on: [1800-210-9999], Country of Origin: China", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/810jwmTfQML._SL1500_.jpg"]},
{"product_name": "Mi Smart Band 4- India's No.1 Fitness Band, Up-to 20 Days Battery Life, Color AMOLED Full-Touch Screen, Waterproof with Music Control and Unlimited Watch Faces", "stores": [{"storeProductId": "B07WLL998K", "storeLink": "https://www.amazon.in/Mi-Smart-Band-Waterproof-up/dp/B07WLL998K/ref=sr_1_5?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-5", "storeName": "amazon", "storePrice": "2299"}], "category": "Electronics", "subcategory": "Others", "description": "The Mi Smart Band 4 features a 39.9% larger (than Mi Band 3) AMOLED color full-touch display with adjustable brightness, so everything is clear as can be. Compatible with Android 4.4 or later/iOS 9.0 or later, With music control on the band you can change the song, increase/decrease the volume and groove on without even touching your phone, With a sturdy 5ATM waterproof built, you can now take your band for a swim. It auto detects your swim style and captures 12 detailed data points for tracking. Connectivity - Bluetooth 5.0, Health and wellness tracking at its best with 24/7 automatic heart rating monitoring and alerts to warn you when the heart rate is high, Style the band display as per your mood with unlimited watch faces. Simply pick a photo from your gallery and set it as your watch face, With the band on your wrist, you can receive text messages, silence or reject calls, and get social media notifications instantly, Up to 20 days of long lasting battery life for uninterrupted performance, Start your day right by understanding your sleep pattern with accurate light and deep sleep monitoring, 30+ features rolled into one band, your perfect companion, Customer care number: Call 18001036286 or Reach Out to Nearest Authorized Service Center of Xiaomi for any after sales support, Country of Origin: China", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71ZSpNjEl0L._SL1500_.jpg"]},
{"product_name": "Acko Smart Activity Fitness Watch (Black)", "stores": [{"storeProductId": "B07TM37QRX", "storeLink": "https://www.amazon.in/Acko-Smart-Activity-Fitness-Watch/dp/B07TM37QRX/ref=sr_1_44?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-44", "storeName": "amazon", "storePrice": "1999"}], "category": "Electronics", "subcategory": "Others", "description": "Heart rate and systolic blood pressure sports bracelet, 1.3 inch color screen, monitor your body features, track your all-day activities, fantastic wearing experience. More accurate body features data, smarter life, brilliant and unique adventure., Waterproof Wrist Watch: Protects your watch when washing your hands, swimming or getting caught in the rain. Track and share your daily activity, and get the motivation you need to hit your goals, Keep You Stay in Touch: Mobile notifications keep you aware of important events. View notifications from email, SMS, caller ID and your favorite apps (Facebook, Twitter, Skype, WhatsApp, etc) on your wrist, so you never miss a beat with this Amazefit Acko Smart Watch, Music/Remote Camera Control: Tap screen to switch next song, music play, pause and control the phone shutter to take pictures from your wrist. Bring you pleasure time anywhere", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61o6Cz7usGL._SL1000_.jpg"]},
{"product_name": "Ambrane 15000mAh Li-Polymer Powerbank with Type C and USB Ports | Fast Charging for Smartphones, Smart Watches, Neckbands & Other Devices (PP-150, Black)", "stores": [{"storeProductId": "B07MHMKSXZ", "storeLink": "https://www.amazon.in/Ambrane-PP-150-15000mAH-Lithium-Polymer/dp/B07MHMKSXZ/ref=sr_1_47?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-47", "storeName": "amazon", "storePrice": "949"}], "category": "Electronics", "subcategory": "Others", "description": "15000 mAh Lithium Polymer Power Bank, Can charge iPhone 8 - 4.9 Times, Samsung Galaxy J7 - 2.8 Times, MI A2 : 2.5 Times, Dual USB output at 5V/2.1A , Dual USB Input via Type C / Micro USB at 5V/2.1A , Full recharge of power bank takes upto 10 hours with 2A wall charger., Stylish U Shape Design with Premium Rubberized Scratch Less Finish & Durable Body makes it a perfect blend of style and performance, Equipped with High Quality Chipsets with 9 Layer of Advanced Protection , What you get: 1 Power Bank, 1 Cable, 1 User Manual and 6 months warranty", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61LDA7qg9-L._SL1500_.jpg"]},
{"product_name": "Noise NoiseFit Evolve Sport Full Touch Control Smart Watch with AMOLED Display", "stores": [{"storeProductId": "B07ZT775FL", "storeLink": "https://www.amazon.in/Noise-NoiseFit-Evolve-Sport-Control/dp/B07ZT775FL/ref=sr_1_46?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-46", "storeName": "amazon", "storePrice": "5999"}], "category": "Electronics", "subcategory": "Others", "description": "1.2’’ round AMOLED Full Touch Screen with multiple watch faces so you can swipe, tap, read & notifications and other updates with ease., The Aluminium Alloy case with easily swappable straps makes for the perfect style statement for your wrist, Equipped with Sleep Tracker, Step Counter, Calorie Counter, so you can get complete health updates, 24/7 Heart Rate Monitoring that measures your heart rate, manually and automatically at an interval of 10 minutes and see and analyze the trends over the past year., Get in shape comes with a dedicated 9 sports mode that tracks your daily activities like Walking, Running, Mountain Climbing, Yoga and more., Go up to 3 days without charging your watch or use it as a normal analog clock for 10 days on a single charge, Head out and push your limits without worrying about sweat or little rain damaging the watch, thanks to the IP68 sweatproof, Now control your music and camera remotely with the Bluetooth Camera and Music Control, Stay in touch with the world with call, message and call notifications on your wrist., Compatible with Bluetooth v5.0 and Android & iOS & Customize your everyday look with 5 watch faces, For any queries, please contact_us on: [8882132132]", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71R5Az8rZyL._SL1500_.jpg"]},
{"product_name": "Casio Youth Digital Black Small Dial Unisex Watch - F-91W-1DG (D002)", "stores": [{"storeProductId": [], "storeLink": "https://www.amazon.in/Casio-Vintage-Digital-Black-Watch/dp/B00HFPIIOI/ref=sr_1_45?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-45", "storeName": "amazon", "storePrice": "895"}], "category": "Electronics", "subcategory": "Others", "description": "Dial Color: Black, Case Shape: Rectangular, Band Color: Black, Band Material: Resin, Watch Movement Type: Quartz, Watch Display Type: Digital, Case Diameter: 38.2 × 35.2 × 8.5 millimeter, Water Resistence Depth: 10 meters, Warranty type:Manufacturer; 2 Years Domestic Warranty, Recommended for customers looking for a small dial sized watches", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61lIqh7l1vL._UL1200_.jpg"]},
{"product_name": "LionBolt D13 Smart Watch Intelligent Bracelet, ip6 Fitness Tracker Smart Watch,Color Screen Smart Watch with Heart Rate Blood Pressure Calories Pedometer Sleep Monitor Smart Wristband", "stores": [{"storeProductId": "B08CCBFLXV", "storeLink": "https://www.amazon.in/LionBolt-Intelligent-Bracelet-Pedometer-Wristband/dp/B08CCBFLXV/ref=sr_1_43?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-43", "storeName": "amazon", "storePrice": "879"}], "category": "Electronics", "subcategory": "Others", "description": "[Compatibility]: Adapt to support mobile for IOS8.0 or above, for Android 4.4 or higher, built-in optical sensor, pay attention to your heart rate changes 24 hours a day, outline your heart rate, present your health and beauty, High-resolution color touch screen]: 1.3TFT touch color screen, high-resolution large color touch screen, sensitive touch keys provide quick and easy operation, ip67 Waterproof smart watch]: Effectively protects the device from cold rain and splashes, you can't use it while showering or swimming, Unique design]: USB plug-in charging design, you can plug in the USB or charging head interface directly after removing the wrist strap. It is easy and convenient, plug and play. Multi-function]: Shake the camera, pedometer, calorie counter, distance counter, sleep monitor (sleep time, sleep quality), heart rate monitor, multiple sports modes, and keep an eye on your health., For any query please feel free to contact us at - Lionbolt.enterprises@gmail.com we will get back to you as soon we got an email from your side", "image_urls": [null]},
{"product_name": "SBA A003 M4 Plus Bluetooth Wireless Smart Fitness Band for Boys/Men/Kids/Women | Sports Watch Compatible with Xiaomi, Oppo, Vivo Mobile | Heart Rate and BP Monitor, Calories Counter", "stores": [{"storeProductId": "B08CVJW446", "storeLink": "https://www.amazon.in/SBA-Bluetooth-Wireless-Compatible-Calories/dp/B08CVJW446/ref=sr_1_40?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-40", "storeName": "amazon", "storePrice": "399"}], "category": "Electronics", "subcategory": "Others", "description": "☑️The New M4 Band Comes With A 0.96inch HD Screen and Sleek Light Weight Yet Durable Design Which Makes It Very Comfortable To Wear And Carry Around. Comes With Flexible And Solid Silicon Straps For More Comfort., ☑️Waterproof Sweat-proof Design --Waterproof/ Sweat-proof Smart Bracelet - IP67 waterproof allow you washing hands, getting caught in the rain. You can wash hands when you wear it or wear in the rain, but it's better not wear it to swim or bath., ☑️It has features such as calling function which enables you receive a call and disconnect it, you can also send and receive messages through it but only supported to android Phones, ☑️Sedentary Reminder--Sometimes you may sit for a long time, which is not good for your health., ☑️Sports and health: Sports step (3D sensor), calorie consumption, exercise distance, pedometer ,Support Dynamic Heart rate, Blood Pressure, Blood Oxygen monitoring, Support call reminder and message reminder", "image_urls": [null]},
{"product_name": "LCARE Watch Smart Activity Tracker with Blood Pressure, Heart Rate Monitor, Alert for Android and iPhone (Black), 1 Year Warranty", "stores": [{"storeProductId": "B07X5GS54Y", "storeLink": "https://www.amazon.in/LCARE-Pressure-Monitor-Activity-Tracker/dp/B07X5GS54Y/ref=sr_1_42?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-42", "storeName": "amazon", "storePrice": "3395"}], "category": "Electronics", "subcategory": "Others", "description": "", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71F7TkzLL4L._SL1500_.jpg"]},
{"product_name": "KTCOO M4 Smart Band Fitness Tracker Smart Watch for Mens Women Boys Girls Compatible with Android & iOS", "stores": [{"storeProductId": "B08F3TGHP6", "storeLink": "https://www.amazon.in/KTCOO-M4-Fitness-Tracker-Compatible/dp/B08F3TGHP6/ref=sr_1_3_sspa?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-3-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzR082QVpPU05SOEtOJmVuY3J5cHRlZElkPUEwNDk5NDg2MUZTSE83VUZVSkhVQSZlbmNyeXB0ZWRBZElkPUEwOTg2MDU1SlNRUjc3Nkg2SDhOJndpZGdldE5hbWU9c3BfYXRmJmFjdGlvbj1jbGlja1JlZGlyZWN0JmRvTm90TG9nQ2xpY2s9dHJ1ZQ==", "storeName": "amazon", "storePrice": "399"}], "category": "Electronics", "subcategory": "Others", "description": "0.96in color screen AMOLED display, clear to see even under sunlight, monitor your sports informations at all times, IP67 waterproof, you can wash hands when you wear it or wear in the rain, but it's better not wear it to swim., High sensitive touched screen, can achieve various operations, information content, step, calories, distance, weather, heart rate and other functions to quickly view, thus opening intelligent life., Automatically record the number of step, burn calories., Made of thermoplastic elastomer, it is more comfortable to wear, double-breasted design, let you exercise without falling off., Recording hearrt rate is nice for knowing your health and exercise status, using reflection. Photoelectric signal detection principle records your heart rate, 24h continuous detection your heart rate., You can choose the exercise program that suits your life rhythm, Nothing is more than sweating after exercise. Sweating can relax yourself, stick to exercise, and make yourself a nicer self. The bracelet automatically detects your sleep and generates a sleep report. With IP67 waterproof performance, rain, water environments completely fearless, let you enjoy the fun of life. When you forget the time, the bracelet will vibrate gently, remid you to get up and wake up.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51%2BaN9lSd2L._SL1000_.jpg"]},
{"product_name": "Mevofit Bold Fitness Band and Fitness Smartwatch with Color Display, Heart Rate for Athletes and Sports Pro", "stores": [{"storeProductId": "B07K5B8T8X", "storeLink": "https://www.amazon.in/Mevofit-Bold-HR-Fitness-Black/dp/B07K5B8T8X/ref=sr_1_2_sspa?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-2-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzR082QVpPU05SOEtOJmVuY3J5cHRlZElkPUEwNDk5NDg2MUZTSE83VUZVSkhVQSZlbmNyeXB0ZWRBZElkPUEwOTUyMTMwMkZFOEpRRDFINlBNSyZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU=", "storeName": "amazon", "storePrice": "1999"}], "category": "Electronics", "subcategory": "Others", "description": "Bold Fitness Tracker Watch is made specially for athletes and sports enthusiasts. It is a water resistant (IP 67) activity tracker which keeps a close track of your Steps, Distance, Running, Calories Burned and Active Minutes. Activity Tracker, Fitness Tracker with Heart Rate, Big Color Display and Gesture Control - Large Wireless Waterproof Fitness Tracker Monitor, Rugged Smart Watch with Sleep Tracker, Sedentary Alert, Alarms, Reminders and Weather Alerts, Best Fitness Tracker Watch for Athletes and Sports Enthusiasts which shows Call, SMS, , FB, Twitter, Gmail, Skype, and other Notifications on the Bold Fitness Band, Bold is a Fitness Tracker with USB dongle - plug in the device in your LAPTOP'S/COMPUTER'S USB PORT for charging as soon as you get it. The battery might be drained drastically so we recommended to charge the band for at least 15 min before using it. Further, long press on the device screen to switch it on. Works on all popular phone like Samsung, Apple, Xiaomi Mi, Huawei, Motorola, Lenovo, Oppo, Vivo, One Plus, LG, 1 Year Warranty", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61KWpBPowwL._SL1500_.jpg"]},
{"product_name": "SYL PLUS Bluetooth Smart Watch Touchscreen Multi Function TF Card Support with Camera, Sim Card Compatible with All Smartphones - White", "stores": [{"storeProductId": "B083Y1XD56", "storeLink": "https://www.amazon.in/SYL-PLUS-Touchscreen-Compatible-Smartphones/dp/B083Y1XD56/ref=sr_1_39?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-39", "storeName": "amazon", "storePrice": "999"}], "category": "Electronics", "subcategory": "Others", "description": "Kindly charge the A1 smartwatch for 6-7 hours before first use,Go through user manual before use the product install SD card, The A1 Bluetooth Smart watch built-in speaker allows you to listen to your favorite music anywhere. This smartwatch for mens women kids boys ., Features & Functions - Bluetooth Dialer , BT Notification , Remote Camera , Anti- Lost , Security Settings , Pedometer , Sleep monitor , Sedentary Remind, Compatible With :- Samsung Galaxy M20 M30 S9 Plus A8 Plus A6+ Note 8 S8 C7 Pro A9 M10 J8 J7 J7 Pro S7 Edge , Vivo V15 Pro V12 Pro V15 Y93 , Xiaomi Redmi Note 7 Pro Mi A2 Note 7 Note 3 Note 4 Note 5 Pro Note 6 Pro , Motorola Moto G5 Plus Moto G4 Plus HTC Desire 728G Lenovo K8 Note OnePlus 7 OnePlus 6T Honor 7A Honor 10 Lite Honor Play 7 Honor 9i Realme 2, 3 Pro Realme C1 iPhone 6 Plus 6s iPhone SE iPhone 7 Plus iPhone 8 Plus iPhone X iPhone XR iPhone XS Max iPhone 7Plus iPhone 8Plus iPhone XSMax, Best in segment Display, Touch, Chipset and Working memory (Compared to all products in this segment)", "image_urls": [null]},
{"product_name": "Huami Amazfit Bip S Smart Watch with Built -in GPS, Long Battery Life, Always-on Display, 5ATM Water Resistance (Carbon Black)", "stores": [{"storeProductId": "B0892SF2MJ", "storeLink": "https://www.amazon.in/Amazfit-Battery-Always-Display-Resistance/dp/B0892SF2MJ/ref=sr_1_38?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-38", "storeName": "amazon", "storePrice": "4999"}], "category": "Electronics", "subcategory": "Others", "description": "31g ULTRA LIGHTWEIGHT & THIN DESIGN, 40-DAY BATTERY LIFE, 5 ATM WATER RESISTANT, Huami-PAI (PERSONAL ACTIVITY INTELLIGENCE), BioTracker PPG HEART RATE SENSOR, 10 SPORTS MODES, TRANSFLECTIVE ALWAYS-ON COLOR DISPLAY, Built-in GPS + GLONASS", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61CH%2B9X%2BynL._SL1500_.jpg"]},
{"product_name": "Noise ColorFit NAV Smart Watch with Built-in GPS and High Resolution Display (Camo Green)", "stores": [{"storeProductId": "B08D1L4YWQ", "storeLink": "https://www.amazon.in/Noise-ColorFit-NAV-Resolution-Display/dp/B08D1L4YWQ/ref=sr_1_35?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-35", "storeName": "amazon", "storePrice": "4499"}], "category": "Electronics", "subcategory": "Others", "description": "Full Touch: Swipe and tap on the display, with full touch controls., Built-in GPS: Track runs and other outdoor activities with accuracy, view GPS maps for completed activities., Large 1.4\" LCD Screen: ColorFit NAV has a high resolution of 320x320 pixels., Customisable & Cloud-Based Watch faces: Now personalise the look of your ColorFit NAV., 4 day battery life and 30 day standby, IP68 Water Resistant: ColorFit NAV is rain-proof and sweat-proof for worry-free usage., 10 Sports Modes: Track your indoor and outdoor fitness activities and get detailed report on the progress made., 6 Axis Sensors: Now track steps and calorie burn with high precision and accuracy., Smart notifications: For calls, texts and social media, supported on iOS and Android phones download the NoiseFit X App., Reminders: Stay on the right track of fitness with sedentary alerts and hand wash reminders, For support, Contact_us on: +91 8882132132 Email: help@nexxbase.com or support.gonoise.in", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61%2B6J7wk2%2BL._SL1500_.jpg"]},
{"product_name": "Ambrane 10000mAh Li-Polymer Powerbank with Compact Size & Fast Charging for Smartphones, Smart Watches, Neckbands & Other Devices (Capsule 10K, Black)", "stores": [{"storeProductId": "B07S88FHN6", "storeLink": "https://www.amazon.in/Ambrane-10000mAh-Lithium-Polymer-Capsule-10K/dp/B07S88FHN6/ref=sr_1_37_mod_primary_lightning_deal?dchild=1&keywords=smart+watch&qid=1597359277&smid=A14CZOWI0VEHLG&sr=8-37", "storeName": "amazon", "storePrice": "699"}], "category": "Electronics", "subcategory": "Others", "description": "10,000 mAh Lithium Polymer Battery charges charges iPhone 8 - 4.6 times, Samsung Galaxy J7 - 2.8 times, MI A2 : 2 times , MI Redmi 6A - 2.1 Times, Vivo V3 - 2.16 Times, Full recharge of power bank takes 5 to 7 hours with 2A wall charger, What you get: 1 Power Bank, 1 Cable, 1 User Manual and 180 days warranty , Item Weight:- 188.7 gms, Dual USB port output at 5V/2.4A, for any defect related issues please reach out to brand customer care 01145911111 working Hrs-10am to 6PM (Monday to Saturday), Portable ergonomic design with hard ABS Plastic exterior , High quality chipsets with 9 layer of advanced protection", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/714kahV60VL._SL1500_.jpg"]},
{"product_name": "KTCOO M4 Pro Heart Rate & Sleep Monitor Smart Band Messages Alert Digital Watch Step Counter Smart Band Fitness Tracker Smart Watch for Mens Women Boys Girls Compatible with Android & iOS", "stores": [{"storeProductId": "B08F5F34K8", "storeLink": "https://www.amazon.in/KTCOO-Monitor-Messages-Digital-Compatible/dp/B08F5F34K8/ref=sr_1_31?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-31", "storeName": "amazon", "storePrice": "449"}], "category": "Electronics", "subcategory": "Others", "description": "0.96in color screen AMOLED display, clear to see even under sunlight, monitor your sports informations at all times, IP67 waterproof, you can wash hands when you wear it or wear in the rain, but it's better not wear it to swim., High sensitive touched screen, can achieve various operations, information content, step, calories, distance, weather, heart rate and other functions to quickly view, thus opening intelligent life., Automatically record the number of step, burn calories., Made of thermoplastic elastomer, it is more comfortable to wear, double-breasted design, let you exercise without falling off., Recording hearrt rate is nice for knowing your health and exercise status, using reflection. Photoelectric signal detection principle records your heart rate, 24h continuous detection your heart rate., You can choose the exercise program that suits your life rhythm, Nothing is more than sweating after exercise. Sweating can relax yourself, stick to exercise, and make yourself a nicer self. The bracelet automatically detects your sleep and generates a sleep report. With IP67 waterproof performance, rain, water environments completely fearless, let you enjoy the fun of life. When you forget the time, the bracelet will vibrate gently, remid you to get up and wake up.", "image_urls": [null]},
{"product_name": "SKMEI Digital Black Dial Men's Watch", "stores": [{"storeProductId": [], "storeLink": "https://www.amazon.in/SKMEI-Digital-Dial-Watch-1251-Black/dp/B0733GM3CK/ref=sr_1_36?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-36", "storeName": "amazon", "storePrice": "499"}], "category": "Electronics", "subcategory": "Others", "description": "Dial color: black, case shape: round, dial glass material: mineral, Band color: black, band material: plastic, Shock Resistant, Watch movement type: watch movement type: , watch display type: digital, Case material: plastic, case diameter: 49 millimeters, Water resistance depth: 50 meters, buckle clasp, Alarm; light; Weight : 0.2 kg, 6 months manufacturer warranty on manufacturing defects", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71HG4moOe4L._UL1500_.jpg"]},
{"product_name": "HolyHigh Fitness Band Smart Band with Heart Rate & Sleep Monitor for Mens Women Smart Digital Watch", "stores": [{"storeProductId": "B083FQD5LY", "storeLink": "https://www.amazon.in/HolyHigh-Fitness-Tracker-Smart-Band/dp/B083FQD5LY/ref=sr_1_32?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-32", "storeName": "amazon", "storePrice": "899"}], "category": "Electronics", "subcategory": "Others", "description": "❤ IPX68 waterproof tracker watch & colorful led screen & directly reject call ❤ IP68 super water resistance allows you to wear this smart watch band when swimming and taking shower (avoid exposing to hot water).Featured with the newest colorful LED screen offers excellent HD image quality,looks cool and stylish.Support with reject call via fitness band and 130c fitness trackers will track your all-day activities like steps,distance, calories burned,and activities time even if it is not connected, ❤Real time heart rate monitor & sleep tracking & ❤Equipped with the advanced heart rate sensor, 130C activity tracker watches can accurately track your heart rate automatically manually and continuously(no need connect with your phone). It will comprehensively analyze your sleep and offer a precise sleep quality data :Deep & Light & Awake Sleep, ❤Calls messages alarm reminder &camera shoot ❤ This tracker band supports silent alarm alert, daily target achieved/sedentary reminder, Call-in number/name displays, call/messages reminder(facebook, whatsapp, instagram, wechat messages etc.), wrist sense, time format,screen brightness adjustment and supports multi-language.Plus, you can use camera shoot function that makes you take photos without other people's help, ❤8+ days battery life & wider compatibility ❤ All HolyHigh smart watches are built-in USB plug which makes it easy to be charged with any devices with USB port, no cable needed. One single charge gives you up to 8+ days of working time.Also,this fit band can connect with the mobiles:operation system is iOS 7.1, Android 4.4 or above and Bluetooth 4.0 or above, ❤14 sports types & warranty ❤ Plus,the sports tracker watch can track 14 sports modes like running, walking, riding, yoga, football,you need to choose 3 modes from 14 sports mode in the app.Dear, if you have any question, free to contact us by clicking ask a question,we will offer you a satisfactory revert within 12hours", "image_urls": [null]},
{"product_name": "AQFIT Multifunction Smart Watch W8 (Gray Black)", "stores": [{"storeProductId": "B07NJMZP46", "storeLink": "https://www.amazon.in/AQFIT-Multifunction-Smart-Watch-W8/dp/B07NJMZP46/ref=sr_1_34?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-34", "storeName": "amazon", "storePrice": "2499"}], "category": "Electronics", "subcategory": "Others", "description": "1.33 Inch IPS full color screen display with a single touch Anti- Scratch toughened glass with over 9H as sapphire formed with 2.5D curved surface and metallic unibody design with an international standard rating of IP68, 5 ATM waterproof class., Real-time monitoring of Blood Pressure, Blood Oxygen, 24-hrs continues Heart Rate, Sleep tracking, Monitors your activity levels and calculate steps taken, distance covered and calories burnt., Multi Sports Mode-With Training Mode get detailed information for steps taken, distance covered, calories burned, real time heart rate while walking, running, swimming, cycling, skipping, badminton, basketball or football, all on your wrist., Customization of watch face according to your mood and style through mobile app. Equipped with latest Nordic chipset NFR52832 and BOSCH BMA21 sensor., Sedentary Reminder || Smart Notifications || Lift Wrist Bright Screen || Weather || App Movement Trajectory || Music Control || Remote shutter || Stop Watch || Reading Type- Digital Dial ||Shape- Rectangle|| Material- Zinc Magnesium & Silicon || Indicator Type-Vibration & Display ||150 Mah Battery and can last up to 5-7days with charge time of 2 Hours", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71IA9dyAm7L._SL1500_.jpg"]},
{"product_name": "Arbily Smart Watch for Men Women One Touch Control IP68 Waterproof Fitness Tracker Watch with Heart Rate/Blood Pressure/Sleep Monitor Female Health Tracker (R1-Black)", "stores": [{"storeProductId": "B08C2H6KWD", "storeLink": "https://www.amazon.in/Arbily-Control-Waterproof-Pressure-R1-Black/dp/B08C2H6KWD/ref=sr_1_30?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-30", "storeName": "amazon", "storePrice": "2699"}], "category": "Electronics", "subcategory": "Others", "description": "♥【Heart Rate & Blood Pressure & Sleep Monitor】The smart watch can provide 24/7 continuous heart rate monitoring and blood pressure detection, which helps you optimize the way of workout, prevent injuries of sports and gives thoughtful protection for your health. And provide comprehensive analysis of your sleep quality (deep sleep, light sleep and wake up time) to help you adjust sleep time., ♥【7 Stylish Watch Face & One Touch Control】1.3-inch TFT-LCD color touch screen smart watch features 7 customized displays, making it easier and quicker to view time and date, steps travelled and calories burned. Just long touch the screen to choose your favorite watch face. One touch button is easy to switch any interface on the smart band., ♥【Call Message Alert & IP68 Waterproof】Always stay connected and get vibration notifications of your calls(can directly hang up call on the watch), texts, and SNS messages, including Facebook, Twitter, WhatsApp, Linkedin, Instagram, Skype, Snapchat, etc. Not miss any important messages. Arbily R1 smart watch is IP68 waterproof which can be worn to wash hands., ♥【Female Health Tracker & Long-lasting Battery】When the users are female, they can set their own current physiological statuses(only records for menstrual period, preparation for pregnancy, duration of pregnancy and production time) in the APP. The smart watch will remind you which period is coming according to your record. Equipped with 200mAh battery life a single charge can provide sufficient power up to 5-7 days of daily using or about 20 days standby time., ♥【More Practical Function & App Details】Arbily R1 smart watch also features with many practical functions, such as alarm clocks, stopwatch, sedentary reminder, 10 adjustable brightness, find phone, phone’s camera control, wrist sensor. The APP's name is “Health Band”, which works with Android 4. 0 or iOS 8. 0 and above, but not for pc or tablet.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61yqD-4rnKL._SL1500_.jpg"]},
{"product_name": "Honor Watch Magic (Lava Black) 9.8mm Thickness & Lightweight Smart Watch, Personal Fitness Mentor, Watch Faces Store, 7 Days Battery Life, GPS,11 Workout Modes, Scientific Sleep & Heart Rate Monitor", "stores": [{"storeProductId": "B07MTKF77H", "storeLink": "https://www.amazon.in/Honor-Watch-Magic-Lava-Black/dp/B07MTKF77H/ref=sr_1_27?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-27", "storeName": "amazon", "storePrice": "7800"}], "category": "Electronics", "subcategory": "Others", "description": "1.2-inch AMOLED colmor screen: multiple watch faces with ALS ambient light monitoring allows automatic screen brightness adjusting, Use Huawei Health App to connect the phone. Connectivity - Bluetooth 4.2, Battery life: lasts up to 1 week on a single charge, Honor Watch Magic comes with 9.8mm thickness and It is backed by 178 mAh battery which can deliver up to 7-day battery life; It is compatible with both Android and iOS devices, 24/7 continuous heart rate monitoring: supports resting, single continuous heart rate and other measuring features, Scientific sleep tracking: automatic sleep recognition and data statistics (validated by the CDB center at harvard medical school), 5ATM water-resistance;For any queries please contact_us on: [1800-209-6555], High precision tracking: supports US-GPS, Russia-GLONASS, Europe-GALILEO satellite to provide accurate and precise location information, Various exercise types: supports exercise statistics on various types of exercises, including outdoor and indoor run, outdoor walk, outdoor and indoor cycling, mountain climbing, pool swim stoke recognition etc, Notification reminders: supports caller ID, SMS, e-mail, calendar, social app notification, Fitness interactions: tracks, monitors and identifies types of daily activities, provides step, calories, activity intensity, activity time and standing statistics; firstbeat professional running guidance; create and manage groups, initiate friendly competitions, view daily activity rankings and friendly competition rankings and more, Other cool features: find my phone, displays time, altitude barometer, compass, weather, stopwatch, timer, flashlight alarm clock, For more Product Information or Support Kindly contact our Hotline Number- 1800-210-9999, Country of Origin: China", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81wWxtlyb6L._SL1500_.jpg"]},
{"product_name": "ITRUE Android A1 Smart Watch for Men | BT 3.0 Support SIM and TF Card Camera Android Watch for Facebook, tiktok and Whatsapp Message Compatible with All Android and iOS Phone Or Device (A1 White)", "stores": [{"storeProductId": "B08DCS3C18", "storeLink": "https://www.amazon.in/ITRUE-Android-Facebook-Whatsapp-Compatible/dp/B08DCS3C18/ref=sr_1_28?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-28", "storeName": "amazon", "storePrice": "899"}], "category": "Electronics", "subcategory": "Others", "description": "SIM card / Bluetooth phone call / answer: You can dial or answer a phone call from your wrist watch with help of bluetooth or directly from sim in the watch. (GSM call), Features: Sleep monitoring, Pedometer , Sedentary reminder , Anti-lost / finding phone , Remote control phone camera , Sound recorder / alarm / calender, Music playing : Enjoy splendid music anywhere and anytime with Bluetooth (directly from phone) or memory card (supports upto 32 gb), Phonebook / call log / message / music synchronization : You can view the SMS messages and Notifications of Facebook Whatsapp Skype Twitter from the watch directly in the real time., 1.54 inch TFT HD LCD touch screen, 240 x 240 pixels: Best suitable screen size with high definition picture displaying gives you great experience. Talking Time: 3 Hours, Standby Time: 180 Hours and Charging Time: 2-3 Hours.", "image_urls": [null]},
{"product_name": "Huami Amazfit Bip S Smart Watch with Built -in GPS, Long Battery Life, Always-on Display, 5ATM Water Resistance (White Rock)", "stores": [{"storeProductId": "B0892ZXTFZ", "storeLink": "https://www.amazon.in/Amazfit-Battery-Always-Display-Resistance/dp/B0892ZXTFZ/ref=sr_1_29?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-29", "storeName": "amazon", "storePrice": "4999"}], "category": "Electronics", "subcategory": "Others", "description": "31g ULTRA LIGHTWEIGHT & THIN DESIGN, 40-DAY BATTERY LIFE, 5 ATM WATER RESISTANT, Huami-PAI (PERSONAL ACTIVITY INTELLIGENCE), BioTracker PPG HEART RATE SENSOR, 10 SPORTS MODES, TRANSFLECTIVE ALWAYS-ON COLOR DISPLAY, Built-in GPS + GLONASS", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61NQHkpb%2BBL._SL1500_.jpg"]},
{"product_name": "Noise Colorfit Pro 2 Full Touch Control Smart Watch (Teal Green)", "stores": [{"storeProductId": "B07YY8LDHZ", "storeLink": "https://www.amazon.in/Noise-Colorfit-Pro-Touch-Control/dp/B07YY8LDHZ/ref=sr_1_25?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-25", "storeName": "amazon", "storePrice": "3499"}], "category": "Electronics", "subcategory": "Others", "description": "The brilliant 1.3\" colour display is now full capacitive touch, supporting taps and swipes, so it is easy to read and operate., The strong polycarbonate case makes the ColorFit Pro 2 featherlight on your wrist and is available in 4 beautiful colours with matching swappable straps., 24x7 heart rate monitoring with the built in optical HR monitor that measures your heart rate every five minutes., 9 sports modes to cover all your activities, whether you walk, run, hike, bike, treadmill, work-out, climb, spin, of perform yoga., You can sweat as much as you like and even wear the ColorFit Pro 2 in the rain, thanks to its IP68 waterproof rating., With up to ten day battery life, ColorFit Pro 2 can go for more than a week without needing to be charged via the included magnetic charger., Complete activity and health tracking with sleep monitoring, heart rate monitoring, step tracking, sedentary alarm and calories burned. , Optional menstrual tracking for women takes the guesswork out of cycle tracking., Track your health and fitness details for the past 2 weeks and see an overview for the last 30 days in the dedicated app, Noisefit – Android users & Noisefit Sport -iOS users., Customise your ColorFit Pro 2 with multiple watch faces that can be changed on the device itself., Control music playback on your smartphone with the remote function on your ColorFit Pro 2, Bluetooth v5.0 compatible with all smartphones running Android 4.4 or iOS 8.0 and above, Email | Support | Contact - help@nexxbase.com | support.gonoise.in | +91 8882132132", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61GmP3iHTML._SL1500_.jpg"]},
{"product_name": "AQFIT W15 Fitness Smartwatch Activity Tracker| Waterproof | 4.2 Bluetooth | Metal Case | Full Touch Screen Display | for Men and Women(Black)", "stores": [{"storeProductId": "B085LGG8M5", "storeLink": "https://www.amazon.in/AQFIT-Smartwatch-Activity-Waterproof-Bluetooth/dp/B085LGG8M5/ref=sr_1_26?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-26", "storeName": "amazon", "storePrice": "3699"}], "category": "Electronics", "subcategory": "Others", "description": "FULL TOUCH SCREEN DISPLAY: The 1.33 inches HD IPS round, full touch color display with a resolution of 240*240 makes it easy for you to scroll, see messages, notifications, track health and do other things on your watch. It brings you different visual experiences., IP68 WATERPROOF: AQFIT W15 comes with IP68, fully waterproof function, now swim, running in the rain or just jump into the water without any worries., MULTI-SPORTS MODES: Switch your AQFIT W15 Smart watch in 15 different sports modes and track all your activities whether it's running, walking, bike, treadmill, yoga, football, badminton, hike and what not in just one watch., HEALTH TRACKER: Built with latest Nordic chipset NFR52832 & and supported with ST LIS2DH12TR sensor, AQFIT present W15 which features comprehensive activity and health tracking with a 24*7 Heart Rate Monitoring, Blood Oxygen (SPO2) Monitor, Sleep Monitor, Drink Water Reminder, Pedometer and Number of Calories Burnt., DESIGN: Slim and sleek, Zinc-Magnesium Alloy body, comfortable food-grade silicone strap, artistic design, carbon fiber back case, unibody design and large screen display makes it the best and the most worthy Smart watch in the market.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81mVbrigrhL._SL1500_.jpg"]},
{"product_name": "HONOR Band 5 (MeteoriteBlack)- Waterproof Full Color AMOLED Touchscreen, SpO2 (Blood Oxygen), Music Control, Watch Faces Store, up to 14 Day Battery Life", "stores": [{"storeProductId": "B07WTHFBQS", "storeLink": "https://www.amazon.in/HONOR-Band-5-Meteorite-Black/dp/B07WTHFBQS/ref=sr_1_19?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-19", "storeName": "amazon", "storePrice": "2199"}], "category": "Electronics", "subcategory": "Others", "description": "0.95 Inch (2.41 cms) AMOLED Touch Large Color Screen: Adjustable screen brightness, dynamic and vivid display; home button control, Belt clip design makes band firmly attached to your wrist. Compatible with Android 4.4 or later/iOS 9.0 or later, Scientific Sleep Monitoring: TruSleep allows sleep status recognition, collection and analyzing data. Storage: RAM 384 KB |ROM 1 MB|PSRAM 8M |Flash 32 MB, SpO2 Monitor for Everyone: HONOR Band 5's SpO2 Monitor tracks oxygen saturation levels in the bloodstream so you can assess how your body is adapting during workouts or at high altitudes. Connectivity Bluetooth 4.2, Smart Music & Volume Controls: Don't stop your workout for anything. Change the song, adjust the volume from your HONOR Band 5 effortlessly, Heart Rate Monitoring: TruSeen allows 24-hour accurate real-time heart rate monitoring and warnings, Special Features & Battery Life: Multiple Watch Faces; Remote Control Camera (only available on Huawei/Honor EMUI 8.1 devices or later). Long standby time up to 14 days and saves time on frequent charging, Multiple Sports Modes: Supports Outdoor and Indoor Run, Walking, Indoor and Outdoor Cycling, Pool Swim and Training Various Exercises Types, 5ATM 50 meters water-resistant. Swimming Posture Recognition: 6-Axis sensor recognizes main strokes, Records speed, distance, number of turns, calories, average SWOLF, and other data, Daily Activities Tracking and Monitoring: Step count, calories burned, distance covered, moderate to high-intensity activities duration and standing status, target setting and achievement reminder, Smart Assistant and Notification Reminders: Stopwatch and timer; Find your phone; Alarm reminder (including smart and event alarms); Caller ID, SMS, e-mail, Weather Reports, Calendar and Social Apps, For any queries, please contact_us on: [1800-210-9999], Smart Assistant and Notification Reminders: Stopwatch and timer; Find your phone; Alarm reminder (including smart and event alarms); Caller ID, SMS, e-mail, Weather Reports, Calendar and Social Apps, Country of Origin: China", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81CwFEsrQUL._SL1500_.jpg"]},
{"product_name": "TISWAQ® D13 Smart Watch Intelligent Bracelet,ip67 Waterproof Fitness Tracker Smart Watch,Color Screen Smart Watch with Heart Rate Blood Pressure Calories Pedometer Sleep Monitor Smart Wristband", "stores": [{"storeProductId": "B089BYFRRX", "storeLink": "https://www.amazon.in/Intelligent-Bracelet-Waterproof-Pedometer-Wristband/dp/B089BYFRRX/ref=sr_1_18?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-18", "storeName": "amazon", "storePrice": "599"}], "category": "Electronics", "subcategory": "Others", "description": "Uses a larger 1.3-inch display, larger words, clearer, high-sensitivity touch, screen can achieve various operations, smart call reminder, Bluetooth camera, steps, calories, sleep monitoring Bluetooth music, heart rate quickly view various functions, and the touch operation of the large color screen is smoother, and smart life is started from then on., The bracelet is made of diamond-shaped lattice texture. The TPU material has a skin-friendly texture and is soft and smooth. The single-breasted design allows you to relax and not fall off. The five colors are optional and can be replaced at will., Plug-in design, plug-and-play and worry-free charging, the charging port is USB interface, remove the wrist strap, you can plug directly into the USB or charging head, easy and convenient., Built-in optical heart rate sensor, pay attention to your heart rate changes 24 hours a day, record your heart rate changes in each time on the excellent living APP, outline your heart rate, present your health and beauty., The APP connection product distinguishes the exercise warm-up, the burning fat, the cardio-pulmonary enhancement and the like by drawing a curve of the data obtained by the monitoring. Let you know the heart rate changes in each time period, reasonably plan the exercise intensity, and release your sports passion more effectively.", "image_urls": [null]},
{"product_name": "ITRUE Smart Watch for Girl Pink A1 Smart Watch BT 3.0 Support SIM and TF Card Camera Android Watch for Facebook, tiktok,Whatsapp Message Compatible with All Android and iOS Phone Or Device - A1 Pink", "stores": [{"storeProductId": "B08DCVBHXG", "storeLink": "https://www.amazon.in/ITRUE-Support-Facebook-Whatsapp-Compatible/dp/B08DCVBHXG/ref=sr_1_20?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-20", "storeName": "amazon", "storePrice": "899"}], "category": "Electronics", "subcategory": "Others", "description": "SIM card / Bluetooth phone call / answer: You can dial or answer a phone call from your wrist watch with help of bluetooth or directly from sim in the watch. (GSM call), Features: Sleep monitoring, Pedometer , Sedentary reminder , Anti-lost / finding phone , Remote control phone camera , Sound recorder / alarm / calender, Music playing : Enjoy splendid music anywhere and anytime with Bluetooth (directly from phone) or memory card (supports upto 32 gb), Phonebook / call log / message / music synchronization : You can view the SMS messages and Notifications of Facebook Whatsapp Skype Twitter from the watch directly in the real time., 1.54 inch TFT HD LCD touch screen, 240 x 240 pixels: Best suitable screen size with high definition picture displaying gives you great experience. Talking Time: 3 Hours, Standby Time: 180 Hours and Charging Time: 2-3 Hours.", "image_urls": [null]},
{"product_name": "AMBLink A1 Bluetooth 4G Touch Screen Watch with Camera/Sim Card/SD Card Slot/Fitness Activity Feature for All Smartphone Device", "stores": [{"storeProductId": "B07QN9VFLW", "storeLink": "https://www.amazon.in/AMBLink-A1-Bluetooth-Activity-Smartphone/dp/B07QN9VFLW/ref=sr_1_23_sspa?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-23-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzR082QVpPU05SOEtOJmVuY3J5cHRlZElkPUEwNjA5NjU5VjI3NVc1WkxYSFhXJmVuY3J5cHRlZEFkSWQ9QTA4MjkwOTUyTTJOVFE3Sk5WT0pFJndpZGdldE5hbWU9c3BfbXRmJmFjdGlvbj1jbGlja1JlZGlyZWN0JmRvTm90TG9nQ2xpY2s9dHJ1ZQ==", "storeName": "amazon", "storePrice": "899"}], "category": "Electronics", "subcategory": "Others", "description": "SYNC FUNCTION- With your Android device, Sync call log, contacts, SMS, and also sync the notifications such as Twitter, Facebook and Instagram etc., PHONE FUNCTION-- Make phone call directly from the smart watch, including answering and dial-up. SIM slot, support make calls by Pinktooth or smart watch., FITNESS MANAGER- Pedometer, sleep monitoring and sedentary reminder track your steps, calories you burn, record your sleeping condition and remind of you how long you have sit., ANTI-LOST FUNCTION- If you have a habit of misplacing your phone, then you are going to like this anti-theft feature on this watch. After a distance of 10 meters, your watch will automatically beep to alert you that your phone is not in hand. This helpful feature will ensure that you have your phone on hand at all times. The feature only supports Android device., OTHER FUNCTIONS- Phonebook, Calculator, Clock, Stopwatch, Acceleration Sensor, Gravity Sensor, Vibration Motor and so on are waiting for you to discover and experience. PinkTOOTH MODE- For Android system, it supports anti-lost, phone book, remote camera and notification push including calls, Facebook.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61Gkw7%2BOO-L._SL1025_.jpg"]},
{"product_name": "Huami Amazfit GTS Smart Watch(Obsidian Black)", "stores": [{"storeProductId": "B07XLMY2HW", "storeLink": "https://www.amazon.in/Huami-Amazfit-Smart-Watch-Obsidian/dp/B07XLMY2HW/ref=sr_1_17?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-17", "storeName": "amazon", "storePrice": "9999"}], "category": "Electronics", "subcategory": "Others", "description": "1.65” AMOLED Display with high 341 PPI resolution and Corning Gorilla glass, Metal body (Aluminum Alloy), giving premium and solid look and feel, 5 ATM water-resistance to ensure a normal use up to 50 meters water pressure, Activity Tracking with distance, active hours, calories and steps, Smart Notifications with customized vibrations, to get all your important information right on your wrist, 14 days battery life to avoid frequent charging and focus on your daily activities mind free", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61iKz%2B-mRCL._SL1500_.jpg"]},
{"product_name": "AMBLink A1 Bluetooth 4G Touch Screen Watch with Camera/Sim Card/SD Card Slot/Fitness Activity Feature for All Smartphone Device", "stores": [{"storeProductId": "B07QN92J76", "storeLink": "https://www.amazon.in/AMBLink-A1-Bluetooth-Activity-Smartphone/dp/B07QN92J76/ref=sr_1_22_sspa?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-22-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzR082QVpPU05SOEtOJmVuY3J5cHRlZElkPUEwNjA5NjU5VjI3NVc1WkxYSFhXJmVuY3J5cHRlZEFkSWQ9QTA4Mjg0NDcxNTBaTFZHVTA0VUs1JndpZGdldE5hbWU9c3BfbXRmJmFjdGlvbj1jbGlja1JlZGlyZWN0JmRvTm90TG9nQ2xpY2s9dHJ1ZQ==", "storeName": "amazon", "storePrice": "899"}], "category": "Electronics", "subcategory": "Others", "description": "SYNC FUNCTION- With your Android device, Sync call log, contacts, SMS, and also sync the notifications such as Twitter, Facebook and Instagram etc., PHONE FUNCTION-- Make phone call directly from the smart watch, including answering and dial-up. SIM slot, support make calls by Bluetooth or smart watch., FITNESS MANAGER- Pedometer, sleep monitoring and sedentary reminder track your steps, calories you burn, record your sleeping condition and remind of you how long you have sit., ANTI-LOST FUNCTION- If you have a habit of misplacing your phone, then you are going to like this anti-theft feature on this watch. After a distance of 10 meters, your watch will automatically beep to alert you that your phone is not in hand. This helpful feature will ensure that you have your phone on hand at all times. The feature only supports Android device., OTHER FUNCTIONS- Phonebook, Calculator, Clock, Stopwatch, Acceleration Sensor, Gravity Sensor, Vibration Motor and so on are waiting for you to discover and experience. BLUETOOTH MODE- For Android system, it supports anti-lost, phone book, remote camera and notification push including calls, Facebook.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61JxcQqS4FL._SL1000_.jpg"]},
{"product_name": "AMBLink A1 Bluetooth 4G Touch Screen Watch with Camera/Sim Card/SD Card Slot/Fitness Activity Feature for All Smartphone Device", "stores": [{"storeProductId": "B07QG3X6W2", "storeLink": "https://www.amazon.in/AMBLink-A1-Bluetooth-Activity-Smartphone/dp/B07QG3X6W2/ref=sr_1_21_sspa?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-21-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzR082QVpPU05SOEtOJmVuY3J5cHRlZElkPUEwNjA5NjU5VjI3NVc1WkxYSFhXJmVuY3J5cHRlZEFkSWQ9QTA4MjgwMjMyR1pSNk1RMERROTk5JndpZGdldE5hbWU9c3BfbXRmJmFjdGlvbj1jbGlja1JlZGlyZWN0JmRvTm90TG9nQ2xpY2s9dHJ1ZQ==", "storeName": "amazon", "storePrice": "899"}], "category": "Electronics", "subcategory": "Others", "description": "SYNC FUNCTION- With your Android device, Sync call log, contacts, SMS, and also sync the notifications such as Twitter, Facebook and Instagram etc., PHONE FUNCTION-- Make phone call directly from the smart watch, including answering and dial-up. SIM slot, support make calls by Bluetooth or smart watch., FITNESS MANAGER- Pedometer, sleep monitoring and sedentary reminder track your steps, calories you burn, record your sleeping condition and remind of you how long you have sit., ANTI-LOST FUNCTION- If you have a habit of misplacing your phone, then you are going to like this anti-theft feature on this watch. After a distance of 10 meters, your watch will automatically beep to alert you that your phone is not in hand. This helpful feature will ensure that you have your phone on hand at all times. The feature only supports Android device., OTHER FUNCTIONS- Phonebook, Calculator, Clock, Stopwatch, Acceleration Sensor, Gravity Sensor, Vibration Motor and so on are waiting for you to discover and experience. BLUETOOTH MODE- For Android system, it supports anti-lost, phone book, remote camera and notification push including calls, Facebook.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61oxFkJ6%2B6L._SL1000_.jpg"]},
{"product_name": "Arbily Smart Watch for Men Women Boys Girls One Touch Control IP68 Waterproof Fitness Tracker Watch with Heart Rate Monitor Blood Pressure Monitor Sleep Monitor All Day Activity Tracker Female Health Tracker 7 Stylish Interface Call Message Alert for Android and iOS Phone", "stores": [{"storeProductId": "B088LDTG2V", "storeLink": "https://www.amazon.in/Arbily-Waterproof-Pressure-Activity-Interface/dp/B088LDTG2V/ref=sr_1_24_sspa?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-24-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzR082QVpPU05SOEtOJmVuY3J5cHRlZElkPUEwNjA5NjU5VjI3NVc1WkxYSFhXJmVuY3J5cHRlZEFkSWQ9QTA4NzA2MjkxR0pTWDM3MlJEQThXJndpZGdldE5hbWU9c3BfbXRmJmFjdGlvbj1jbGlja1JlZGlyZWN0JmRvTm90TG9nQ2xpY2s9dHJ1ZQ==", "storeName": "amazon", "storePrice": "2699"}], "category": "Electronics", "subcategory": "Others", "description": "♥【Heart Rate & Blood Pressure & Sleep Monitor】The smart watch can provide 24/7 continuous heart rate monitoring and blood pressure detection, which helps you optimize the way of workout, prevent injuries of sports and gives thoughtful protection for your health. And provide comprehensive analysis of your sleep quality (deep sleep, light sleep and wake up time) to help you adjust sleep time., ♥【7 Stylish Watch Face & One Touch Control】1.3-inch TFT-LCD color touch screen smart watch features 7 customized displays, making it easier and quicker to view time and date, steps travelled and calories burned. Just long touch the screen to choose your favorite watch face. One touch button is easy to switch any interface on the smart band., ♥【Call Message Alert & IP68 Waterproof】Always stay connected and get vibration notifications of your calls(can directly hang up call on the watch), texts, and SNS messages, including Facebook, Twitter, WhatsApp, Linkedin, Instagram, Skype, Snapchat, etc. Not miss any important messages. Arbily R1 smart watch is IP68 waterproof which can be worn to wash hands., ♥【Female Health Tracker & Long-lasting Battery】When the users are female, they can set their own current physiological statuses(only records for menstrual period, preparation for pregnancy, duration of pregnancy and production time) in the APP. The smart watch will remind you which period is coming according to your record. Equipped with 200mAh battery life a single charge can provide sufficient power up to 5-7 days of daily using or about 20 days standby time., ♥【More Practical Function & App Details】Arbily R1 smart watch also features with many practical functions, such as alarm clocks, stopwatch, sedentary reminder, 10 adjustable brightness, find phone, phone’s camera control, wrist sensor. The APP's name is “Health Band”, which works with Android 4. 0 or iOS 8. 0 and above, but not for pc or tablet.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61nStuTRw8L._SL1500_.jpg"]},
{"product_name": "HUG PUPPY A1 Sim Card Smart Watch with Camera Bluetooth Smartwatch Compatible Men and Women", "stores": [{"storeProductId": "B089JZFKF3", "storeLink": "https://www.amazon.in/HUG-PUPPY-Bluetooth-Smartwatch-Compatible/dp/B089JZFKF3/ref=sr_1_15?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-15", "storeName": "amazon", "storePrice": "810"}], "category": "Electronics", "subcategory": "Others", "description": "SIM card / Bluetooth phone call / answer: You can dial or answer a phone call from your wrist watch with help of bluetooth or directly from sim in the watch. (GSM call), Features: Sleep monitoring, Pedometer , Sedentary reminder , Anti-lost / finding phone , Remote control phone camera , Sound recorder / alarm / calender, Music playing : Enjoy splendid music anywhere and anytime with Bluetooth (directly from phone) or memory card (supports upto 32 gb), Phonebook / call log / message / music synchronization : You can view the SMS messages and Notifications of Facebook Whatsapp Skype Twitter from the watch directly in the real time., 1.54 inch TFT HD LCD touch screen, 240 x 240 pixels: Best suitable screen size with high definition picture displaying gives you great experience. Talking Time: 3 Hours, Standby Time: 180 Hours and Charging Time: 2-3 Hours.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71onN7tsFsL._SL1500_.jpg"]},
{"product_name": "SHOPTOSHOP Genuine A1 Smart Watch Phone Camera SIM Card Pedometer (Black)", "stores": [{"storeProductId": "B083LZJDWZ", "storeLink": "https://www.amazon.in/SHOPTOSHOP-Genuine-A1-Camera-Pedometer/dp/B083LZJDWZ/ref=sr_1_14?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-14", "storeName": "amazon", "storePrice": "939"}], "category": "Electronics", "subcategory": "Others", "description": "SIM card / Bluetooth phone call / answer: You can dial or answer a phone call from your wrist watch with help of bluetooth or directly from sim in the watch. (GSM call), Features: Sleep monitoring, Pedometer , Sedentary reminder , Anti-lost / finding phone , Remote control phone camera , Sound recorder / alarm / calender, Music playing : Enjoy splendid music anywhere and anytime with Bluetooth (directly from phone) or memory card (supports upto 32 gb), Phonebook / call log / message / music synchronization : You can view the SMS messages and Notifications of Facebook Whatsapp Skype Twitter from the watch directly in the real time., 1.54 inch TFT HD LCD touch screen, 240 x 240 pixels: Best suitable screen size with high definition picture displaying gives you great experience. Talking Time: 3 Hours, Standby Time: 180 Hours and Charging Time: 2-3 Hours.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61V9nyc-UJL._SL1500_.jpg"]},
{"product_name": "ITRUE A1 Bluetooth Smartwatch Android 4G Phone Watch with Camera/SIM Card Slot Sports Tracker Smart Watch for Men Compatible with All Android and iOS Smartphones, Black", "stores": [{"storeProductId": "B08DCYS2L8", "storeLink": "https://www.amazon.in/ITRUE-Bluetooth-Smartwatch-Compatible-Smartphones/dp/B08DCYS2L8/ref=sr_1_13?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-13", "storeName": "amazon", "storePrice": "899"}], "category": "Electronics", "subcategory": "Others", "description": "SIM card / Bluetooth phone call / answer: You can dial or answer a phone call from your wrist watch with help of bluetooth or directly from sim in the watch. (GSM call), Features: Sleep monitoring, Pedometer , Sedentary reminder , Anti-lost / finding phone , Remote control phone camera , Sound recorder / alarm / calender, Music playing : Enjoy splendid music anywhere and anytime with Bluetooth (directly from phone) or memory card (supports upto 32 gb), Phonebook / call log / message / music synchronization : You can view the SMS messages and Notifications of Facebook Whatsapp Skype Twitter from the watch directly in the real time., 1.54 inch TFT HD LCD touch screen, 240 x 240 pixels: Best suitable screen size with high definition picture displaying gives you great experience. Talking Time: 3 Hours, Standby Time: 180 Hours and Charging Time: 2-3 Hours.", "image_urls": [null]},
{"product_name": "Fastrack Reflex 2.0 Unisex Activity Tracker - SWD90059PP05", "stores": [{"storeProductId": [], "storeLink": "https://www.amazon.in/Fastrack-Reflex-Digital-Black-Watch-SWD90059PP05/dp/B07DQN5B3G/ref=sr_1_10?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-10", "storeName": "amazon", "storePrice": "1495"}], "category": "Electronics", "subcategory": "Others", "description": "Dial Color: Black, Case Shape: Rectangular, Dial Glass Material: Acrylic; Case Thickness:12.5 mm; Case Length(6H-12H):50 mm, It is compatible with all iOS versions 8.0 and above and android versions 5.0 and above except the following phone models :Samsung Galaxy A9 Pro, Samsung Galaxy C9 Pro, Moto G5 series - all phones, Samsung Galaxy J2 Pro, Band Color: Black, Band Material: TPU; Watch Movement Type: processor, Watch Display Type: Digital, Case Material: Plastic, Touch screen; Note: Please charge the device completely before use, It tracks the number of steps you have taken, the total distance you have travelled and the number of calories that you have burned, It helps you to have an active lifestyle with an inbuilt sedentary reminder which you can customise as per your lifestyle, It helps you track your sleep patterns, in the bed and off it, It acts as a remote control to click pictures on your phone, after all who doesn’t love to take the perfect selfie, Remove plastic at crown to start the watch, 12 Months Manufacturer Warranty on manufacturing defects For technical issues kindly contact_us on : [ 1800-266-0123 ]", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/814d7DPCPfL._UL1500_.jpg"]},
{"product_name": "MevoFit Echo-Swim Swimming-Fitness-Band & Smart Watch for Fitness & Sports PRO Sporty-Fitness-Band, All Activity (Black_Grey)", "stores": [{"storeProductId": "B07NRN52RL", "storeLink": "https://www.amazon.in/MevoFit-Echo-Swim-Swimming-Fitness-Band-Sporty-Fitness-Band-Activity/dp/B07NRN52RL/ref=sr_1_1_sspa?dchild=1&keywords=fitness+band&qid=1597359277&sr=8-1-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzR082QVpPU05SOEtOJmVuY3J5cHRlZElkPUEwNDk5NDg2MUZTSE83VUZVSkhVQSZlbmNyeXB0ZWRBZElkPUEwOTUxODE4M1FQQllWQzNXWDRUQyZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU=", "storeName": "amazon", "storePrice": "1699"}], "category": "Electronics", "subcategory": "Others", "description": "★ MevoFit Swim is a strong, smart and durable fitness band which comes with SWIM MODE, advanced daily activity tracker, sleep, HR, BP, Blood Oxygen, Sports Mode, Timer, & Notifications Display (Call, SMS & Social)., ★ This Fitness Band comes with 3 sports mode including Walking, Running, & Hiking., ★ Works on all popular phone brands like Samsung, Apple, Xiaomi Mi, Huawei, Motorola, Lenovo, Oppo, Vivo, One Plus, LG, etc., ★ MevoFit Swim shows weather forecast and comes with Smart Notification Alerts, Advanced Sleep Tracker, & Heart Rate. A Smart Activity Tracker | Fitness Tracker | Smart Watch with Heart Rate, Blood Pressure, Color Display & Gesture Control - Large Waterproof Fitness Tracker Monitor., ★ Customer Care & 1 Year Warranty Claims - please get in touch with us through IN-APP HELP DESK 24*7, Email: merchsupport@mevofit.com, Phone: +91 88266 92984/64. We will be very happy to assist you & resolve any query!", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61Rcepsw6WL._SL1500_.jpg"]},
{"product_name": "Sprinto WX02 Smart Wrist Band Intelligent Bracelet Waterproof Fitness Tracker Smart Watch Color Screen with Heart Rate Blood Pressure Calories Pedometer Sleep Monitor Etc. (Rendom Color)", "stores": [{"storeProductId": "B08DLPJVVF", "storeLink": "https://www.amazon.in/%E0%A4%87%E0%A4%82%E0%A4%9F%E0%A5%87%E0%A4%B2%E0%A5%80%E0%A4%9C%E0%A5%87%E0%A4%82%E0%A4%9F-%E0%A4%AC%E0%A5%8D%E0%A4%B0%E0%A5%87%E0%A4%B8%E0%A4%B2%E0%A5%87%E0%A4%9F-%E0%A4%B5%E0%A4%BE%E0%A4%9F%E0%A4%B0%E0%A4%AA%E0%A5%8D%E0%A4%B0%E0%A5%82%E0%A4%AB-%E0%A4%B8%E0%A5%8D%E0%A4%AE%E0%A4%BE%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A4%B5%E0%A5%89%E0%A4%9A-%E0%A4%AA%E0%A5%87%E0%A4%A1%E0%A5%8B%E0%A4%AE%E0%A5%80%E0%A4%9F%E0%A4%B0/dp/B08DLPJVVF/ref=sr_1_9?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-9", "storeName": "amazon", "storePrice": "459"}], "category": "Electronics", "subcategory": "Others", "description": "[Compatibility]: Adapt to support mobile for IOS8.0 or above, for Android 4.4 or higher, built-in optical sensor, pay attention to your heart rate changes 24 hours a day, outline your heart rate, present your health and beauty, Unique design]: USB plug-in charging design, you can plug in the USB or charging head interface directly after removing the wrist strap. It is easy and convenient, plug and play., High-resolution color touch screen]: 1.3TFT touch color screen, high-resolution large color touch screen, sensitive touch keys provide quick and easy operation, Multi-function]: Shake the camera, pedometer, calorie counter, distance counter, sleep monitor (sleep time, sleep quality), heart rate monitor, multiple sports modes, and keep an eye on your health., ip67 Waterproof smart watch]: Effectively protects the device from cold rain and splashes, you can't use it while showering or swimming", "image_urls": [null]},
{"product_name": "Noise ColorFit NAV Smart Watch with Built-in GPS and High Resolution Display (Stealth Black)", "stores": [{"storeProductId": "B08D1GV7V2", "storeLink": "https://www.amazon.in/Noise-ColorFit-NAV-Resolution-Display/dp/B08D1GV7V2/ref=sr_1_11?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-11", "storeName": "amazon", "storePrice": "4499"}], "category": "Electronics", "subcategory": "Others", "description": "Full Touch: Swipe and tap on the display, with full touch controls., Built-in GPS: Track runs and other outdoor activities with accuracy, view GPS maps for completed activities., Large 1.4\" LCD Screen: ColorFit NAV has a high resolution of 320x320 pixels., Customisable & Cloud-Based Watch faces: Now personalise the look of your ColorFit NAV., 4 day battery life and 30 day standby, IP68 Water Resistant: ColorFit NAV is rain-proof and sweat-proof for worry-free usage., 10 Sports Modes: Track your indoor and outdoor fitness activities and get detailed report on the progress made., 6 Axis Sensors: Now track steps and calorie burn with high precision and accuracy., Smart notifications: For calls, texts and social media, supported on iOS and Android phones download the NoiseFit X App., Reminders: Stay on the right track of fitness with sedentary alerts and hand wash reminders, For support, Contact_us on: +91 8882132132 Email: help@nexxbase.com or support.gonoise.in", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61PBtrwxS%2BL._SL1500_.jpg"]},
{"product_name": "Generic Bluetooth Smart Watch with SIM and Memory Card Support", "stores": [{"storeProductId": "B01HXWCS84", "storeLink": "https://www.amazon.in/Generic-Bluetooth-Support-Android-Assorted/dp/B01HXWCS84/ref=sr_1_12?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-12", "storeName": "amazon", "storePrice": "620"}], "category": "Electronics", "subcategory": "Others", "description": "HD display: High sensitive capacitive touch screen; High sensitive capacitive touch screen;perfect match technology, The lost function: Seek mobile phone, Tow-way anti lost; Entertainment: MP3,MP4,Camera;Sync function: Twitter, Facebook; time, schedule, read message or news; Sport health, Works on dual mode: company mode in which make or receive call & send or get message via Bluetooth and Network mode in which SIM card in inserted and call can be made via your network provider, GSM 850/900/1800/1900 four frequency call function, hands-free, phone records, phone book, Bluetooth phone, Note: This watch supports Android OS, Android phone's Bluetooth, APP download and connection, Note:The customer has to insert sim card with 2G networks support", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61FG21KJAqL._SL1000_.jpg"]},
{"product_name": "Noise Colorfit Pro 2 Full Touch Control Smart Watch Jet Black", "stores": [{"storeProductId": "B07YY1BY5B", "storeLink": "https://www.amazon.in/Noise-Colorfit-Pro-Touch-Control/dp/B07YY1BY5B/ref=sr_1_6?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-6", "storeName": "amazon", "storePrice": "3499"}], "category": "Electronics", "subcategory": "Others", "description": "The brilliant 1.3\" colour display is now full capacitive touch, supporting taps and swipes, so it is easy to read and operate., The strong polycarbonate case makes the ColorFit Pro 2 featherlight on your wrist and is available in 4 beautiful colours with matching swappable straps., 24x7 heart rate monitoring with the built in optical HR monitor that measures your heart rate every five minutes., 9 sports modes to cover all your activities, whether you walk, run, hike, bike, treadmill, work-out, climb, spin, of perform yoga., You can sweat as much as you like and even wear the ColorFit Pro 2 in the rain, thanks to its IP68 waterproof rating., With up to ten day battery life, ColorFit Pro 2 can go for more than a week without needing to be charged via the included magnetic charger., Complete activity and health tracking with sleep monitoring, heart rate monitoring, step tracking, sedentary alarm and calories burned. , Optional menstrual tracking for women takes the guesswork out of cycle tracking., Track your health and fitness details for the past 2 weeks and see an overview for the last 30 days in the dedicated app, Noisefit – Android users & Noisefit Sport -iOS users., Customise your ColorFit Pro 2 with multiple watch faces that can be changed on the device itself., Control music playback on your smartphone with the remote function on your ColorFit Pro 2, Bluetooth v5.0 compatible with all smartphones running Android 4.4 or iOS 8.0 and above, Email | Support | Contact - help@nexxbase.com | support.gonoise.in | +91 8882132132", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/6113mS%2BxhyL._SL1500_.jpg"]},
{"product_name": "SHOPTOSHOP SM3 Smart Band Fitness Tracker Watch Heart Rate with Activity Tracker Waterproof Body Functions Like Steps Counter, Calorie Counter, Blood Pressure, Heart Rate Monitor LED Touchscreen", "stores": [{"storeProductId": "B07X1XMDB2", "storeLink": "https://www.amazon.in/SHOPTOSHOP-Activity-Waterproof-Functions-Touchscreen/dp/B07X1XMDB2/ref=sr_1_8?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-8", "storeName": "amazon", "storePrice": "464"}], "category": "Electronics", "subcategory": "Others", "description": "All-day activity tracking: Track steps, distance, calories burned, active minutes, you can check daily activity and time on OLED display or APP, TFT HD LCD touch screen, there have four different operation interface for you to change, Resolution ratio: 128x64 pixel; 380MAH polymer lithium battery, standby time up to 2 Days fully charged, You will receive only notification to See Calls & Messages on Your Wrist: Receive/Rejection call, calendar, SMS and SNS (Facebook, WhatsApp, LinkedIn, Instagram, and Twitter) notifications on display, fitness tracker band let you never miss the messages that matter., Need to download app in your smart phone and switch ON Bluetooth of your smart phone to connect the fitness band, NOTE- For Any Product Issue Please Contact Us Through Buyer Massage Please Install Any One App From Play Store for the device App Name YOHO,FIT PRO,LEFUN HEALTH", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71xqNTW7ggL._SL1434_.jpg"]},
{"product_name": "Mi Smart Band 4- India's No.1 Fitness Band, Up-to 20 Days Battery Life, Color AMOLED Full-Touch Screen, Waterproof with Music Control and Unlimited Watch Faces", "stores": [{"storeProductId": "B07WLL998K", "storeLink": "https://www.amazon.in/Mi-Smart-Band-Waterproof-up/dp/B07WLL998K/ref=sr_1_5?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-5", "storeName": "amazon", "storePrice": "2299"}], "category": "Electronics", "subcategory": "Others", "description": "The Mi Smart Band 4 features a 39.9% larger (than Mi Band 3) AMOLED color full-touch display with adjustable brightness, so everything is clear as can be. Compatible with Android 4.4 or later/iOS 9.0 or later, With music control on the band you can change the song, increase/decrease the volume and groove on without even touching your phone, With a sturdy 5ATM waterproof built, you can now take your band for a swim. It auto detects your swim style and captures 12 detailed data points for tracking. Connectivity - Bluetooth 5.0, Health and wellness tracking at its best with 24/7 automatic heart rating monitoring and alerts to warn you when the heart rate is high, Style the band display as per your mood with unlimited watch faces. Simply pick a photo from your gallery and set it as your watch face, With the band on your wrist, you can receive text messages, silence or reject calls, and get social media notifications instantly, Up to 20 days of long lasting battery life for uninterrupted performance, Start your day right by understanding your sleep pattern with accurate light and deep sleep monitoring, 30+ features rolled into one band, your perfect companion, Customer care number: Call 18001036286 or Reach Out to Nearest Authorized Service Center of Xiaomi for any after sales support, Country of Origin: China", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71ZSpNjEl0L._SL1500_.jpg"]},
{"product_name": "Noise Colorfit Pro 2 Full Touch Control Smart Watch Jet Black", "stores": [{"storeProductId": "B07YY1BY5B", "storeLink": "https://www.amazon.in/Noise-Colorfit-Pro-Touch-Control/dp/B07YY1BY5B/ref=sr_1_2_sspa?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-2-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzR082QVpPU05SOEtOJmVuY3J5cHRlZElkPUEwNjA5NjU5VjI3NVc1WkxYSFhXJmVuY3J5cHRlZEFkSWQ9QTAzODU2OTAySVc0VDNGNkVaWDZCJndpZGdldE5hbWU9c3BfYXRmJmFjdGlvbj1jbGlja1JlZGlyZWN0JmRvTm90TG9nQ2xpY2s9dHJ1ZQ==", "storeName": "amazon", "storePrice": "3499"}], "category": "Electronics", "subcategory": "Others", "description": "The brilliant 1.3\" colour display is now full capacitive touch, supporting taps and swipes, so it is easy to read and operate., The strong polycarbonate case makes the ColorFit Pro 2 featherlight on your wrist and is available in 4 beautiful colours with matching swappable straps., 24x7 heart rate monitoring with the built in optical HR monitor that measures your heart rate every five minutes., 9 sports modes to cover all your activities, whether you walk, run, hike, bike, treadmill, work-out, climb, spin, of perform yoga., You can sweat as much as you like and even wear the ColorFit Pro 2 in the rain, thanks to its IP68 waterproof rating., With up to ten day battery life, ColorFit Pro 2 can go for more than a week without needing to be charged via the included magnetic charger., Complete activity and health tracking with sleep monitoring, heart rate monitoring, step tracking, sedentary alarm and calories burned. , Optional menstrual tracking for women takes the guesswork out of cycle tracking., Track your health and fitness details for the past 2 weeks and see an overview for the last 30 days in the dedicated app, Noisefit – Android users & Noisefit Sport -iOS users., Customise your ColorFit Pro 2 with multiple watch faces that can be changed on the device itself., Control music playback on your smartphone with the remote function on your ColorFit Pro 2, Bluetooth v5.0 compatible with all smartphones running Android 4.4 or iOS 8.0 and above, Email | Support | Contact - help@nexxbase.com | support.gonoise.in | +91 8882132132", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/6113mS%2BxhyL._SL1500_.jpg"]},
{"product_name": "AMBLink A1 Bluetooth Smart Watch", "stores": [{"storeProductId": "B07QFSBSM2", "storeLink": "https://www.amazon.in/AMBLink-A1-Bluetooth-Smart-Watch/dp/B07QFSBSM2/ref=sr_1_4_sspa?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-4-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzR082QVpPU05SOEtOJmVuY3J5cHRlZElkPUEwNjA5NjU5VjI3NVc1WkxYSFhXJmVuY3J5cHRlZEFkSWQ9QTA4Mjc0NjdGNUwzR1lLOFdaMU4md2lkZ2V0TmFtZT1zcF9hdGYmYWN0aW9uPWNsaWNrUmVkaXJlY3QmZG9Ob3RMb2dDbGljaz10cnVl", "storeName": "amazon", "storePrice": "899"}], "category": "Electronics", "subcategory": "Others", "description": "FUNCTIONS: Bluetooth connectivity Bluetooth Music Control, Voice Recorder, Sim-card (Micro) support, Calling function, Cellphone finder, Reminder for long time sitting, Battery with durable power, Pedometer, Anti-lost function, Push notifications: QQ, WeChat, Facebook, WhatsApp, Sleep Monitor, Calculator and Calendar support, FITNESS FEATURE- Your sleep patterns and your daily step count are two important fitness activities that you need to keep a track of. You can use this watch to do the same as it comes with a sleep monitor, a pedometer, and a sedentary reminder. Apart from this, it also comes with a stopwatch to help you keep a tab on your activities., MAXIMUM COMPATIBILITY - Compatible with all Android & IOS phone, such as Apple, Samsung, Google, HTC, Sony, LG, Huawei, ZTE, Oppo, Xiomi, Lenovo etc. It is 100% compatible with Android smartphones, Please Note: There's no APP for iPhone 7, 7 plus, iPhone 6s, 6s plus, iPhone 6, iPhone 5s, iPhone 5, so sync Message, sync notification, remote capture, Anti lost functions not work for iPhone, WATER INTAKE REMINDER- It's important that you stay hydrated at all times irrespective of the weather. The watch comes with a feature that reminds you to consume water at regular intervals, allowing you to remain hydrated at all times.", "image_urls": [null]},
{"product_name": "Apple Watch Series 3 (GPS, 42mm) - Space Grey Aluminium Case with Black Sport Band", "stores": [{"storeProductId": [], "storeLink": "https://www.amazon.in/Apple-Watch-Smart-Space-Aluminum/dp/B075R9P7H8/ref=sr_1_1_sspa?dchild=1&keywords=smart+watch&qid=1597359277&sr=8-1-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzR082QVpPU05SOEtOJmVuY3J5cHRlZElkPUEwNjA5NjU5VjI3NVc1WkxYSFhXJmVuY3J5cHRlZEFkSWQ9QTAzMzYyMTYzVU1DRkY5MUNCQkY1JndpZGdldE5hbWU9c3BfYXRmJmFjdGlvbj1jbGlja1JlZGlyZWN0JmRvTm90TG9nQ2xpY2s9dHJ1ZQ==", "storeName": "amazon", "storePrice": "23900"}], "category": "Electronics", "subcategory": "Others", "description": "GPS, Optical heart sensor, Apple Watch app, Digital crown, S3 with dual-core processor, Accelerometer and gyroscope, Swimproof, watchOS 5, Aluminium case, Country of Origin: China", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71EoGntO5bL._SL1500_.jpg"]},
{"product_name": "Fire TV Stick 4K with All-New Alexa Voice Remote | Streaming Media Player", "stores": [{"storeProductId": [], "storeLink": "https://www.amazon.in/Amazon-FireTV-Stick-4K-Alexa-Voice-Remote-Streaming-Player/dp/B079QQZZJK/ref=sr_1_9_sspa?dchild=1&keywords=tv+stick&qid=1597359277&sr=8-9-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzR082QVpPU05SOEtOJmVuY3J5cHRlZElkPUEwMjEyMjI1MzFISEtWWUQ4UFQ1UyZlbmNyeXB0ZWRBZElkPUExMDA1NjQxMlo4SjVDMzVUVzdHOCZ3aWRnZXROYW1lPXNwX210ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU=", "storeName": "amazon", "storePrice": "5999"}], "category": "Electronics", "subcategory": "Others", "description": "Our most powerful streaming media stick —over 80% more powerful than the best-selling Fire TV Stick., Launch and control content with the next-gen Alexa Voice Remote. Use the dedicated power, volume, and mute buttons to control your TV., Enjoy brilliant picture and immersive sound with access to 4K Ultra HD, Dolby Vision, Dolby Atmos, HDR, HDR-10, HLG, and HDR-10+. Choose from thousands of movies and TV episodes. Enjoy favorites from Prime Video, Hotstar, Netflix, Zee5, Sony LIV, Apple TV and others., The official YouTube app is now available on Fire TV. Use your voice to find, launch and play content on YouTube. Simply say \"Alexa, open YouTube\" or \"Alexa, find movie trailers on YouTube\", Experience thousands of apps, Alexa skills, and millions of websites like Facebook, and Twitter., Do more with Alexa—view live camera feeds, check cricket scores, order food, and stream music., Amazon Prime members get unlimited access to thousands of movies and TV episodes, plus ad-free listening to millions of songs with Amazon Prime Music.", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61RfMDdt-iL._SL1000_.jpg"]}
]